index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-16 Fri 08:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beckwith Tangled Emacs Initialization</title>
<meta name="author" content="Benjamin Beckwith" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Beckwith Tangled Emacs Initialization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0b313e4">1. Introduction</a>
<ul>
<li><a href="#orgca2c0ad">1.1. Installation</a></li>
<li><a href="#org028feab">1.2. Notes</a>
<ul>
<li><a href="#org06ce46f">1.2.1. Elpaca</a></li>
<li><a href="#org41e13f4">1.2.2. Emacs Build</a></li>
<li><a href="#org2a3f40c">1.2.3. Pending sections</a></li>
<li><a href="#orgbf1266a">1.2.4. Performance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9b6d1bd">2. Preamble</a>
<ul>
<li><a href="#orgb7857ff">2.1. Personal Information</a></li>
<li><a href="#org8a7b115">2.2. Local customizations (custom.el, username.var.el)</a>
<ul>
<li><a href="#org77a5e0f">2.2.1. Local variables (user-login-name)</a></li>
</ul>
</li>
<li><a href="#org0bc3499">2.3. Early Initialization</a></li>
<li><a href="#org126e538">2.4. Libraries</a>
<ul>
<li><a href="#org3cd693f">2.4.1. Dash</a></li>
<li><a href="#orgb93b49e">2.4.2. Delight</a></li>
<li><a href="#org65e0a76">2.4.3. Hydra</a></li>
<li><a href="#orgb047eaa">2.4.4. Seq</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga2a095e">3. Settings</a>
<ul>
<li><a href="#orgd03c9cc">3.1. Keys</a>
<ul>
<li><a href="#orgbc8eada">3.1.1. Binding Keys</a></li>
<li><a href="#org16a060a">3.1.2. Personal Keymaps</a></li>
<li><a href="#org9751a02">3.1.3. Super keys</a></li>
</ul>
</li>
<li><a href="#org49bc1f7">3.2. Command Launchers</a>
<ul>
<li><a href="#org1cb815b">3.2.1. Hydra</a></li>
<li><a href="#org206b335">3.2.2. Vertico</a></li>
</ul>
</li>
<li><a href="#org10dff39">3.3. Expansion &amp; Completion</a>
<ul>
<li><a href="#org435fc7a">3.3.1. Abbrev</a></li>
<li><a href="#orgeffaac9">3.3.2. Cape</a></li>
<li><a href="#org1bc9c88">3.3.3. Company</a></li>
<li><a href="#orga0077e9">3.3.4. Corfu</a></li>
<li><a href="#orgcf49715">3.3.5. Yasnippet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
<li><a href="#orge3bc916">3.3.6. Hippie Expand</a></li>
</ul>
</li>
<li><a href="#orgb5fcc00">3.4. Built-in Features</a>
<ul>
<li><a href="#orgb3c7e9f">3.4.1. Backups</a></li>
<li><a href="#org6590a54">3.4.2. Default File encoding</a></li>
<li><a href="#org70ee5fb">3.4.3. Native Compilation</a></li>
<li><a href="#orgdb068f1">3.4.4. Path</a></li>
<li><a href="#org41c9964">3.4.5. Server</a></li>
<li><a href="#orgd2937b8">3.4.6. Sounds</a></li>
<li><a href="#org356f8da">3.4.7. Recentf</a></li>
<li><a href="#orgc7108fb">3.4.8. Timezones</a></li>
<li><a href="#org2e6fbee">3.4.9. Isearch</a></li>
</ul>
</li>
<li><a href="#org502dcc8">3.5. Minibuffer</a>
<ul>
<li><a href="#orgd622298">3.5.1. Minibuffer History</a></li>
</ul>
</li>
<li><a href="#org522a4f6">3.6. Movement</a>
<ul>
<li><a href="#orgabac837">3.6.1. Ace Utilities</a></li>
<li><a href="#orgf2dad87">3.6.2. Errors</a></li>
<li><a href="#orga610ec6">3.6.3. Read-only helpers</a></li>
<li><a href="#org2c3d6e8">3.6.4. Scroll Screen Position</a></li>
</ul>
</li>
<li><a href="#orge7fe4e1">3.7. Custom Helpers</a>
<ul>
<li><a href="#org9c2b51a">3.7.1. Auto-display agenda</a></li>
<li><a href="#org10de967">3.7.2. Auto-indent when pasting</a></li>
<li><a href="#orgcb640ef">3.7.3. Better window splitting functions</a></li>
<li><a href="#org08d2ce2">3.7.4. Hide mode line</a></li>
<li><a href="#org2ebe5d3">3.7.5. Open/Edit This file</a></li>
<li><a href="#org7e7872b">3.7.6. Org-column resizing</a></li>
<li><a href="#org4fc60a7">3.7.7. Styled HTML Export</a></li>
<li><a href="#orga31a498">3.7.8. Transparency</a></li>
<li><a href="#orgec9233b">3.7.9. Weekly Score Goal in Org-Agenda</a></li>
<li><a href="#org9abaee4">3.7.10. Weekly Time Reporting</a></li>
<li><a href="#org021d4b4">3.7.11. Workweeks</a></li>
</ul>
</li>
<li><a href="#org4b569fc">3.8. Editing</a>
<ul>
<li><a href="#org4309660">3.8.1. Ediff single frame</a></li>
<li><a href="#orgb98de27">3.8.2. Multiple Cursors</a></li>
<li><a href="#orgb03267c">3.8.3. Regexp-Builder</a></li>
<li><a href="#org9aac43a">3.8.4. Executable Scripts on save</a></li>
<li><a href="#org3c9e5e8">3.8.5. Auto Reverting</a></li>
</ul>
</li>
<li><a href="#org6a6ceb0">3.9. Images</a>
<ul>
<li><a href="#orga0f4dba">3.9.1. ImageMagick</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd3d6d27">4. Minor Modes</a>
<ul>
<li><a href="#org224cdfb">4.1. Reference</a>
<ul>
<li><a href="#org85dbd4a">4.1.1. Helpful</a></li>
<li><a href="#orge59c991">4.1.2. Which Key</a></li>
<li><a href="#org155aee4">4.1.3. Dictionary</a></li>
<li><a href="#orgecb22e6">4.1.4. OSX Dictionary</a></li>
</ul>
</li>
<li><a href="#orgdbe9069">4.2. Editing</a>
<ul>
<li><a href="#org8d8936b">4.2.1. Adaptive Fill&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
<li><a href="#org33f0108">4.2.2. Focus Mode</a></li>
<li><a href="#org8fa52a0">4.2.3. Common User Access mode</a></li>
<li><a href="#orgf96ac0b">4.2.4. Easy Kill</a></li>
<li><a href="#orgff69a08">4.2.5. Vundo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
<li><a href="#org1b22077">4.2.6. Expand Region</a></li>
<li><a href="#org6f0771f">4.2.7. Citar (Bibtex completions)</a></li>
<li><a href="#org0376c36">4.2.8. Tree Sitter</a></li>
</ul>
</li>
<li><a href="#org07fd57b">4.3. Version Control</a>
<ul>
<li><a href="#orga9358f0">4.3.1. Magit</a></li>
<li><a href="#org20ccbc3">4.3.2. Smerge</a></li>
</ul>
</li>
<li><a href="#orgc2f693c">4.4. Checking</a>
<ul>
<li><a href="#org5c1c326">4.4.1. Writegood Mode</a></li>
<li><a href="#org4486ec1">4.4.2. Spell Checking</a></li>
<li><a href="#org20690c8">4.4.3. Proselint</a></li>
</ul>
</li>
<li><a href="#org16ebbc9">4.5. Buffers</a>
<ul>
<li><a href="#org236ea7b">4.5.1. Midnight Mode</a></li>
<li><a href="#org8b896c7">4.5.2. IBuffer</a></li>
<li><a href="#org45d9da7">4.5.3. Unique Buffer Names</a></li>
<li><a href="#orge02b4d4">4.5.4. OSX Reveal</a></li>
</ul>
</li>
<li><a href="#org2e3158f">4.6. Development</a>
<ul>
<li><a href="#org09be855">4.6.1. Check parens on save</a></li>
<li><a href="#orgf3c1b6c">4.6.2. Eldoc</a></li>
<li><a href="#orgfff06cd">4.6.3. LSP</a></li>
<li><a href="#org256376e">4.6.4. Paredit</a></li>
<li><a href="#org292a4d6">4.6.5. Paxedit</a></li>
<li><a href="#org7f82a9f">4.6.6. Rainbow Delimiters</a></li>
</ul>
</li>
<li><a href="#org6174e59">4.7. Organization</a>
<ul>
<li><a href="#orgec8ce42">4.7.1. Bookmarks</a></li>
<li><a href="#org48bf6ff">4.7.2. Project</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org029f98d">5. Major Modes</a>
<ul>
<li><a href="#orgca01fe3">5.1. File Management</a>
<ul>
<li><a href="#org85b8584">5.1.1. Dired</a></li>
<li><a href="#org91bc8d8">5.1.2. Neotree</a></li>
</ul>
</li>
<li><a href="#org9772500">5.2. Documents</a>
<ul>
<li><a href="#org0add342">5.2.1. AucTeX</a></li>
<li><a href="#org8bc35e3">5.2.2. HTML</a></li>
<li><a href="#orgb984cc0">5.2.3. Markdown</a></li>
<li><a href="#orgf3faca8">5.2.4. Orgmode</a></li>
<li><a href="#org95290c3">5.2.5. PDF Tools</a></li>
</ul>
</li>
<li><a href="#org8bde3a4">5.3. Miscellaneous</a>
<ul>
<li><a href="#org2ba3bac">5.3.1. Calc</a></li>
<li><a href="#orge2a001a">5.3.2. Dashboard</a></li>
<li><a href="#org999e73c">5.3.3. Hyperbole&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
</ul>
</li>
<li><a href="#org349bb7b">5.4. Programming Languages</a>
<ul>
<li><a href="#org6d3eeed">5.4.1. C++</a></li>
<li><a href="#org4e069ee">5.4.2. Elisp</a></li>
<li><a href="#org43acd8c">5.4.3. Javascript</a></li>
<li><a href="#org0116569">5.4.4. Plantuml</a></li>
<li><a href="#org7b4ed7e">5.4.5. Rust</a></li>
<li><a href="#org885d8ec">5.4.6. Emacs Speaks Statistics (ESS)</a></li>
<li><a href="#orge984e5b">5.4.7. Utilities</a></li>
<li><a href="#orga1dcbd6">5.4.8. Web Mode</a></li>
</ul>
</li>
<li><a href="#orgf6a7c9a">5.5. Shells</a>
<ul>
<li><a href="#org5afe55e">5.5.1. Ansi Term</a></li>
<li><a href="#orgddf86ed">5.5.2. Eshell</a></li>
</ul>
</li>
<li><a href="#org67733df">5.6. Visual</a>
<ul>
<li><a href="#org7bd6e42">5.6.1. Nerd Icons</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb8e281c">6. Style</a>
<ul>
<li><a href="#orgc84fb0d">6.1. Frame Changes</a></li>
<li><a href="#orge17d4dc">6.2. Window Changes</a></li>
<li><a href="#org28a3710">6.3. Faces</a>
<ul>
<li><a href="#orgf9299df">6.3.1. Default Fonts</a></li>
<li><a href="#org4cb140c">6.3.2. Unicode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
<li><a href="#org409de2a">6.3.3. Trying out fonts on Windows</a></li>
<li><a href="#org36a7c13">6.3.4. Dynamic Font sizes</a></li>
<li><a href="#orgd019de3">6.3.5. Mode Line Style</a></li>
<li><a href="#org9adfbc6">6.3.6. Missing Glyphs</a></li>
<li><a href="#org1dd3f61">6.3.7. Cursor width</a></li>
</ul>
</li>
<li><a href="#org5478a0f">6.4. Themes</a>
<ul>
<li><a href="#orgff5492f">6.4.1. Extra Themes</a></li>
</ul>
</li>
<li><a href="#org4accf49">6.5. Sky Color Clock</a></li>
<li><a href="#orgf4d53af">6.6. Doom Modeline</a></li>
<li><a href="#org05b537b">6.7. Asterism (⁂) Mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></a></li>
<li><a href="#org650eab9">6.8. Prettify Symbols</a></li>
<li><a href="#org539fc13">6.9. Color</a>
<ul>
<li><a href="#orgdbd050d">6.9.1. Rainbow Mode</a></li>
<li><a href="#org77f4984">6.9.2. KureColor</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcb2f728">7. Postamble</a>
<ul>
<li><a href="#orgee6a0a2">7.1. Local customizations (custom.el)</a></li>
<li><a href="#orgc4cf1a5">7.2. Local customizations (user-login-name)</a></li>
<li><a href="#orga5dc87f">7.3. Housekeeping</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0b313e4" class="outline-2">
<h2 id="org0b313e4"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document tangles (in literate programming style) the necessary
commands to initialize Emacs to my liking and the documentation for my
choices. 
</p>

<p>
To clone, go to the <a href="http://github.com/bnbeckwith/bnb-emacs">github repository</a>. For a pretty view, head over to
the <a href="http://bnbeckwith.com/bnb-emacs/">generated page</a>.
</p>
</div>
