index.html

<div id="outline-container-orgca2c0ad" class="outline-3">
<h3 id="orgca2c0ad"><span class="section-number-3">1.1.</span> Installation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
My <code>init.el</code> file is quite simple and is generated by the following
block. Essentially, I just have to install this package
(<code>bnb-emacs</code>) in the <a href="file:///Users/ben.beckwith/.emacs.d/">~/.emacs.d/</a> directory and run the following
code block (<code>C-c C-c</code>) to bootstrap the system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;;; </span><span style="color: #8e908c; font-style: italic;">init.el --- bnbeckwith config -*- eval: (read-only-mode 1) -*-</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> package-enable-at-startup nil<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">elpaca-installer-version</span> 0.6<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">elpaca-directory</span> <span style="color: #3e999f;">(</span>expand-file-name <span style="color: #3e999f;">"elpaca/"</span> user-emacs-directory<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">elpaca-builds-directory</span> <span style="color: #3e999f;">(</span>expand-file-name <span style="color: #3e999f;">"builds/"</span> elpaca-directory<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">elpaca-repos-directory</span> <span style="color: #3e999f;">(</span>expand-file-name <span style="color: #3e999f;">"repos/"</span> elpaca-directory<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">elpaca-order</span>
  '<span style="color: #3e999f;">(</span>elpaca <span style="color: #8959a8;">:repo</span> <span style="color: #3e999f;">"https://github.com/progfolio/elpaca.git"</span>
           <span style="color: #8959a8;">:ref</span> nil
           <span style="color: #8959a8;">:files</span> <span style="color: #eab700;">(</span><span style="color: #8959a8;">:defaults</span> <span style="color: #3e999f;">"elpaca-test.el"</span> <span style="color: #718c00;">(</span><span style="color: #8959a8;">:exclude</span> <span style="color: #3e999f;">"extensions"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
           <span style="color: #8959a8;">:build</span> <span style="color: #eab700;">(</span><span style="color: #8959a8;">:not</span> elpaca--activate-package<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">let*</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>repo  <span style="color: #718c00;">(</span>expand-file-name <span style="color: #3e999f;">"elpaca/"</span> elpaca-repos-directory<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
       <span style="color: #eab700;">(</span>build <span style="color: #718c00;">(</span>expand-file-name <span style="color: #3e999f;">"elpaca/"</span> elpaca-builds-directory<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
       <span style="color: #eab700;">(</span>order <span style="color: #718c00;">(</span>cdr elpaca-order<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
       <span style="color: #eab700;">(</span>default-directory repo<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'load-path <span style="color: #eab700;">(</span><span style="color: #718c00;">if</span> <span style="color: #718c00;">(</span>file-exists-p build<span style="color: #718c00;">)</span> build repo<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">unless</span> <span style="color: #eab700;">(</span>file-exists-p repo<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>make-directory repo t<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">when</span> <span style="color: #718c00;">(</span>&lt; emacs-major-version 28<span style="color: #718c00;">)</span> <span style="color: #718c00;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">subr-x</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">condition-case-unless-debug</span> err
        <span style="color: #718c00;">(</span><span style="color: #718c00;">if-let</span> <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span>buffer <span style="color: #3e999f;">(</span>pop-to-buffer-same-window <span style="color: #3e999f;">"*elpaca-bootstrap*"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>zerop <span style="color: #eab700;">(</span>call-process <span style="color: #3e999f;">"git"</span> nil buffer t <span style="color: #3e999f;">"clone"</span>
                                       <span style="color: #718c00;">(</span>plist-get order <span style="color: #8959a8;">:repo</span><span style="color: #718c00;">)</span> repo<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>zerop <span style="color: #eab700;">(</span>call-process <span style="color: #3e999f;">"git"</span> nil buffer t <span style="color: #3e999f;">"checkout"</span>
                                       <span style="color: #718c00;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>plist-get order <span style="color: #8959a8;">:ref</span><span style="color: #4d4d4c;">)</span> <span style="color: #3e999f;">"--"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span>emacs <span style="color: #3e999f;">(</span>concat invocation-directory invocation-name<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>zerop <span style="color: #eab700;">(</span>call-process emacs nil buffer nil <span style="color: #3e999f;">"-Q"</span> <span style="color: #3e999f;">"-L"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"--batch"</span>
                                       <span style="color: #3e999f;">"--eval"</span> <span style="color: #3e999f;">"(byte-recompile-directory \".\" 0 'force)"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">elpaca</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>elpaca-generate-autoloads <span style="color: #3e999f;">"elpaca"</span> repo<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
            <span style="color: #4271ae;">(</span><span style="color: #718c00;">progn</span> <span style="color: #4d4d4c;">(</span>message <span style="color: #3e999f;">"%s"</span> <span style="color: #3e999f;">(</span>buffer-string<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span> <span style="color: #4d4d4c;">(</span>kill-buffer buffer<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #c82829; font-weight: bold;">error</span> <span style="color: #3e999f;">"%s"</span> <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-current-buffer</span> buffer <span style="color: #3e999f;">(</span>buffer-string<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span><span style="color: #c82829; font-weight: bold;">error</span><span style="color: #4271ae;">)</span> <span style="color: #4271ae;">(</span><span style="color: #c82829; font-weight: bold;">warn</span> <span style="color: #3e999f;">"%s"</span> err<span style="color: #4271ae;">)</span> <span style="color: #4271ae;">(</span>delete-directory repo 'recursive<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">unless</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">elpaca-autoloads</span> nil t<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">elpaca</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>elpaca-generate-autoloads <span style="color: #3e999f;">"elpaca"</span> repo<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>load <span style="color: #3e999f;">"./elpaca-autoloads"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>add-hook 'after-init-hook #'elpaca-process-queues<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> `<span style="color: #3e999f;">(</span>,@elpaca-order<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Install use-package support</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> elpaca-use-package
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Enable :elpaca use-package keyword.</span>
  <span style="color: #3e999f;">(</span>elpaca-use-package-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Assume :elpaca t unless otherwise specified.</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> elpaca-use-package-by-default t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>elpaca-wait<span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span>load <span style="color: #3e999f;">"~/.emacs.d/full.el"</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
From there on, the bootstrapping is simple. Emacs finds
<a href="file:///Users/ben.beckwith/.emacs.d/init.el">~/.emacs.d/init.el</a> and runs the code. 
</p>

<p>
First, I disable <code>package</code>, and use the standard <code>elpaca</code>
initialization. Following that, I enable <code>elpaca-use-package</code> so that
the rest of this setup can use the standard <code>use-package</code> interface.
</p>

<p>
Finally, the output of this file, <a href="file:///Users/ben.beckwith/.emacs.d/full.el">~/.emacs.d/full.el</a>, is loaded for
the complete initialization.
</p>

<p>
If you are reading this online, the html version of this file is
generated by using `bnb/export-readme` explained in <a href="#org4fc60a7">Styled HTML
Export</a>.
</p>
</div>
</div>
