Readme.org
** Notes

This section has specific notes that are relevant to my emacs setup
in general and this document in particular.

But, before all of the detail, let's ensure =lexical-binding= gods are
appeased and credit/rights are retained.

#+begin_src emacs-lisp
  ;; -*- mode: emacs-lisp; lexical-binding: t; -*-
  ;; copyright (c) Ben Beckwith, 2010-2025
#+end_src

*** Elpaca

A newer package manager, [[https://github.com/progfolio/elpaca][Elpaca]] seeks to be a preferred drop-in
replacement for the built-in =package.el= manager. For the
configuration above, I use the standard installation boilerplate
and enable [[help:use-package][use-package]] support.

This is the quick cheat sheet of commands:
| Operation                             | UI (keys apply in elpaca-ui-mode) | completing-read interface commands               |
|---------------------------------------+-----------------------------------+--------------------------------------------------|
| Finding Packages                      | =M-x elpaca-manager=                | [[help:elpaca-try][elpaca-try]]                                       |
| Trying Packages (for current session) | =i x=                               | [[help:elpaca-try][elpaca-try]]                                       |
| Fetching Package Updates              | =f x=                               | [[help:elpaca-fetch][elpaca-fetch]] or [[help:elpaca-fetch-all][elpaca-fetch-all]]                 |
| Merging Updates                       | =u x=                               | [[help:elpaca-merge][elpaca-merge]] or [[help:elpaca-merge-all][elpaca-merge-all]]                 |
| Pulling Updates*                      | =C-u u x=                           | =C-u M-x elpaca-merge= or =C-u M-x elpaca-merge-all= |
| Rebuilding Packages                   | =r x=                               | [[help:elpaca-rebuild][elpaca-rebuild]]                                   |
| Deleting Packages                     | =d x=                               | [[help:elpaca-delete][elpaca-delete]]                                    |
| View Package Logs                     | =l= filters log to current package  | [[help:elpaca-log][elpaca-log]]                                       |
| Visit Package Repository Directory    | =v=                                 | [[help:elpaca-visit][elpaca-visit]]                                     |
| Visit Package Build Directory         | =C-u v=                             | =C-u M-x elpaca-visit=                             |
| Browse Package Website                | =b=                                 | [[help:elpaca-browse][elpaca-browse]]                                    |

There is also a [[https://github.com/progfolio/elpaca/blob/master/doc/manual.md][helpful manual]].

To see how the startup time has imporoved, let's store when we start
evaluating these settings.

#+begin_src emacs-lisp
  (setq bnb/start-time (float-time))
#+end_src

To aid with general code that needs to run /after/ =elpaca=, the following
macro sets up the right hook.

#+begin_src emacs-lisp
  (defmacro with-after-elpaca-init (&rest body)
      "Adds BODY to `elpaca-after-init-hook`"
      `(add-hook 'elpaca-after-init-hook (lambda () ,@body)))
#+end_src

*** Emacs Build

My current flavor of Emacs comes from:
https://github.com/d12frosted/homebrew-emacs-plus

To install with =brew=, run the following command:
#+begin_src sh :tangle no :eval no
  brew install emacs-plus@29 --with-nobu417-big-sur-icon --with-imagemagick --with-native-comp
#+end_src

And then, to link in =/Applications=, run the following command:
#+begin_src sh :tangle no :eval no
  oascript -e 'tell application "Finder" to make alias file to posix file "<prefix>/Emacs.app" at POSIX file "/Applications"
#+end_src

Notes: [[https://www.masteringemacs.org/article/whats-new-in-emacs-29-1][What's new in 29.1]]

*** Pending sections

There are some features that I like to take on a /trial run/. These are
marked with the *PENDING* tag to help me remember and evaluate.

*** Performance

By utilizing elements of =use-package=, I can keep an eye on troublesome
packages during startup. Together, these turn on reporting and set the
minimum time to consider when building the report.

#+begin_src emacs-lisp
  (setq use-package-verbose t
        use-package-compute-statistics t
        use-package-minimum-reported-time 0)
#+end_src

The generated messages will be found in the =*Messsages*= buffer.

There is also the [[elisp:(elpaca-log)][elpaca log]] that can show loading times.

* Preamble

This sections houses the settings that need to be made up front and
support subsuquent package installation and activiation.

** Default Setup

The full name is used for email messages. And =bnb/biblio= is set to a
sensible default. These can be overridden in =<username>.var.el=.

#+begin_src emacs-lisp
  (setq user-full-name "Benjamin Beckwith"
        bnb/biblio '("~/references.bib"))
#+end_src

** Local customizations (custom.el, username.var.el)

I typically use the customize interface to generate any local settings
such as proxies, paths, fonts, etc. that may vary from machine to
machine. This keeps the setup the same and allows for only some
details to differ.

I like to set the custom file explicitly. Mine resides in the
[[file+emacs:~/.emacs.d/][~/.emacs.d/]] directory. This code block sets the file name and loads it
if it exists.

#+begin_src emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (if (file-exists-p custom-file)
      (load-file custom-file))
#+end_src

If the file doesn't exist, =Emacs= will still use the file if any
changes are made through the /custom interface/.

Sometimes I'll get bad settings or cruft in that file. I now have a
key, ~<F7>~, for easy navigation to wherever the =custom-file= points.

*** Local variables (user-login-name)

I also intend to have a generic call to an installed local file that
may need to behave differently from =custom.el=. This loads last so that
it can modify any existing setting made here to work on the specific
system in question.

In the code below, I add =~/.emacs.d/= to the load path and have a
protected call to [[help:load-library][load-library]].  If the file exists, it gets loaded,
otherwise the error normally returned if the file is non-existent gets
ignored.

#+begin_src emacs-lisp
  (condition-case err
      (progn
        (load-file (format "~/.emacs.d/%s.vars.el"  user-login-name))
        (message "Loaded local settings file %s.vars.el" user-login-name))
    (file-error
     (message "Skipping %s.vars library as it does not exist." user-login-name))
    nil)
#+end_src

