index.html

<div id="outline-container-org028feab" class="outline-3">
<h3 id="org028feab"><span class="section-number-3">1.2.</span> Notes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This section has specific notes that are relevant to my emacs setup
in general and this document in particular.
</p>
</div>

<div id="outline-container-org06ce46f" class="outline-4">
<h4 id="org06ce46f"><span class="section-number-4">1.2.1.</span> Elpaca</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
A newer package manager, <a href="https://github.com/progfolio/elpaca">Elpaca</a> seeks to be a preferred drop-in
replacement for the built-in <code>package.el</code> manager. For the
configuration above, I use the standard installation boilerplate
and enable <code>use-package</code> support.
</p>

<p>
This is the quick cheat sheet of commands:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">UI (keys apply in elpaca-ui-mode)</th>
<th scope="col" class="org-left">completing-read interface commands</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Finding Packages</td>
<td class="org-left"><code>M-x elpaca-manager</code></td>
<td class="org-left"><code>elpaca-try</code></td>
</tr>

<tr>
<td class="org-left">Trying Packages (for current session)</td>
<td class="org-left"><code>i x</code></td>
<td class="org-left"><code>elpaca-try</code></td>
</tr>

<tr>
<td class="org-left">Fetching Package Updates</td>
<td class="org-left"><code>f x</code></td>
<td class="org-left"><code>elpaca-fetch</code> or <code>elpaca-fetch-all</code></td>
</tr>

<tr>
<td class="org-left">Merging Updates</td>
<td class="org-left"><code>u x</code></td>
<td class="org-left"><code>elpaca-merge</code> or <code>elpaca-merge-all</code></td>
</tr>

<tr>
<td class="org-left">Pulling Updates*</td>
<td class="org-left"><code>C-u u x</code></td>
<td class="org-left"><code>C-u M-x elpaca-merge</code> or <code>C-u M-x elpaca-merge-all</code></td>
</tr>

<tr>
<td class="org-left">Rebuilding Packages</td>
<td class="org-left"><code>r x</code></td>
<td class="org-left"><code>elpaca-rebuild</code></td>
</tr>

<tr>
<td class="org-left">Deleting Packages</td>
<td class="org-left"><code>d x</code></td>
<td class="org-left"><code>elpaca-delete</code></td>
</tr>

<tr>
<td class="org-left">View Package Logs</td>
<td class="org-left"><code>l</code> filters log to current package</td>
<td class="org-left"><code>elpaca-log</code></td>
</tr>

<tr>
<td class="org-left">View Package Statuses</td>
<td class="org-left"><code>t</code> show most recent log entries</td>
<td class="org-left"><code>elpaca-status</code></td>
</tr>

<tr>
<td class="org-left">Visit Package Repository Directory</td>
<td class="org-left"><code>v</code></td>
<td class="org-left"><code>elpaca-visit</code></td>
</tr>

<tr>
<td class="org-left">Visit Package Build Directory</td>
<td class="org-left"><code>C-u v</code></td>
<td class="org-left"><code>C-u M-x elpaca-visit</code></td>
</tr>

<tr>
<td class="org-left">Browse Package Website</td>
<td class="org-left"><code>b</code></td>
<td class="org-left"><code>elpaca-browse</code></td>
</tr>
</tbody>
</table>

<p>
There is also a <a href="https://github.com/progfolio/elpaca/blob/master/doc/manual.md">helpful manual</a>.
</p>


<p>
To see how the startup time has imporoved, let's store when we
start evaluating these settings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> bnb/start-time <span style="color: #3e999f;">(</span>float-time<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org41e13f4" class="outline-4">
<h4 id="org41e13f4"><span class="section-number-4">1.2.2.</span> Emacs Build</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
My current flavor of Emacs comes from:
<a href="https://github.com/d12frosted/homebrew-emacs-plus">https://github.com/d12frosted/homebrew-emacs-plus</a>
</p>

<p>
To install with <code>brew</code>, run the following command:
</p>
<div class="org-src-container">
<pre class="src src-sh">brew install emacs-plus@29 --with-nobu417-big-sur-icon --with-imagemagick --with-native-comp
</pre>
</div>

<p>
Notes: <a href="https://www.masteringemacs.org/article/whats-new-in-emacs-29-1">What's new in 29.1</a>
</p>
</div>
</div>

<div id="outline-container-org2a3f40c" class="outline-4">
<h4 id="org2a3f40c"><span class="section-number-4">1.2.3.</span> Pending sections</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
There are some features that I like to take on a <i>trial run</i>. These
are marked with the <b>PENDING</b> tag to help me remember and evaluate.
</p>
</div>
</div>

<div id="outline-container-orgbf1266a" class="outline-4">
<h4 id="orgbf1266a"><span class="section-number-4">1.2.4.</span> Performance</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
By utilizing elements of <code>use-package</code>, I can keep an eye on
troublesome packages during startup. Together, these turn on
reporting and set the minimum time to consider when building the
report.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> use-package-verbose t
      use-package-compute-statistics t
      use-package-minimum-reported-time 0<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The generated messages will be found in the <code>*Messsages*</code> buffer.
</p>

<p>
There is also the <a href="(elpaca-log)">elpaca log</a> that can show loading times.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b6d1bd" class="outline-2">
<h2 id="org9b6d1bd"><span class="section-number-2">2.</span> Preamble</h2>
<div class="outline-text-2" id="text-2">
<p>
This sections houses the settings that need to be made up front and
support subsuquent package installation and activiation.
</p>
</div>

<div id="outline-container-orgb7857ff" class="outline-3">
<h3 id="orgb7857ff"><span class="section-number-3">2.1.</span> Personal Information</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The full name is used for email messages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> user-full-name <span style="color: #3e999f;">"Benjamin Beckwith"</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a7b115" class="outline-3">
<h3 id="org8a7b115"><span class="section-number-3">2.2.</span> Local customizations (custom.el, username.var.el)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I typically use the customize interface to generate any local
settings such as proxies, paths, fonts, etc. that may vary from
machine to machine. This keeps the setup the same and allows for
only some details to differ.
</p>

<p>
I like to set the custom file explicitly. Mine resides in the
<a href="file:///Users/ben.beckwith/.emacs.d/">~/.emacs.d/</a> directory. This code block sets the file name and
loads it if it exists.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> custom-file <span style="color: #3e999f;">"~/.emacs.d/custom.el"</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">if</span> <span style="color: #3e999f;">(</span>file-exists-p custom-file<span style="color: #3e999f;">)</span>
    <span style="color: #3e999f;">(</span>load-file custom-file<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
If the file doesn't exist, <code>Emacs</code> will still use the file if any
changes are made through the <i>custom interface</i>.
</p>

<p>
Sometimes I'll get bad settings or cruft in that file. I now have a
key, <code>&lt;F7&gt;</code>, for easy navigation to wherever the <code>custom-file</code> points.
</p>
</div>
