Readme.org
*** Seq

[[*Magit][Magit]] needs an updated [[https://elpa.gnu.org/packages/seq.html][seq]], so we can install it here. Note that the
functions below unload the library if already loaded, and then does
the correct install.

#+begin_src emacs-lisp
  (defun +elpaca-unload-seq (e)
    (and (featurep 'seq) (unload-feature 'seq t))
    (elpaca--continue-build e))
  (defun +elpaca-seq-build-steps ()
    (append (butlast (if (file-exists-p (expand-file-name "seq" elpaca-builds-directory))
  		       elpaca--pre-built-steps elpaca-build-steps))
            (list '+elpaca-unload-seq 'elpaca--activate-package)))
  (use-package seq
    :if (version< emacs-version "30")
    :ensure `(seq :build ,(+elpaca-seq-build-steps)))
#+end_src

** Coda

Evey good initialization must have an end.
#+begin_src emacs-lisp
  ;;; Wait for this to be processed before packages that depend on it
  (elpaca-wait)
#+end_src

* Settings

The sections here contain mostly settings that configure keymaps,
command launchers, built-in features, and other details for
day-to-day life.

** Keys

These sections contain setting related to keys and keymaps.

*** Binding Keys

For binding keys, I use the [[https://github.com/jwiegley/use-package/blob/master/bind-key.el][bind-key]] package. Not only does it
easily bind keys, but it does so with some nice features.

#+begin_src emacs-lisp
  (with-after-elpaca-init
    (bind-keys ("C-h B" . describe-personal-keybindings)
               ("<f7>"  . (lambda () (interactive (find-file custom-file))))))
#+end_src

By using ~bind-key~, you can specify the keystrokes that invoke a
command. In the example above, we bind functions to the global key
map. Note that in later settings, there are also examples of mapping
keys within local keymaps.

If you also want to override any possible minor-mode bindings of the
same keys, you can use ~bind-key*~ instead.

There is also an ~unbind-key~ to, of course, remove any binding.

The real kicker is that it will keep track of these bindings and let
you see a summary of your customizations with

: M-x describe-personal-keybindings

This is bound to ~C-h B~ above.

As of emacs 28.1, there is a setting to group bindings into an outline
format. Use the following settings with ~M-x describe-bindings~ or ~C-h
b~.

#+begin_src emacs-lisp
  (setq describe-bindings-outline t)
#+end_src

*** Personal Keymaps

The following settings are inspired from
[[http://endlessparentheses.com/the-toggle-map-and-wizardry.html]].

