index.html

<div id="outline-container-orgb047eaa" class="outline-4">
<h4 id="orgb047eaa"><span class="section-number-4">2.4.4.</span> Seq</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
<a href="#orga9358f0">Magit</a> needs an updated <a href="https://elpa.gnu.org/packages/seq.html">seq</a>, so we can install it here. Note that
the functions below unload the library if already loaded, and then
does the correct install.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">    <span style="color: #8e908c; font-style: italic;">;;; </span><span style="color: #8e908c; font-style: italic;">Take care of the seq dependency</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">+elpaca-unload-seq</span> <span style="color: #3e999f;">(</span>e<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">and</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">featurep</span> '<span style="color: #4271ae;">seq</span><span style="color: #eab700;">)</span> <span style="color: #eab700;">(</span>unload-feature 'seq t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>elpaca--continue-build e<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">+elpaca-seq-build-steps</span> <span style="color: #3e999f;">()</span>
  <span style="color: #3e999f;">(</span>append <span style="color: #eab700;">(</span>butlast <span style="color: #718c00;">(</span><span style="color: #718c00;">if</span> <span style="color: #4271ae;">(</span>file-exists-p <span style="color: #4d4d4c;">(</span>expand-file-name <span style="color: #3e999f;">"seq"</span> elpaca-builds-directory<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
                       elpaca--pre-built-steps elpaca-build-steps<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
          <span style="color: #eab700;">(</span>list '+elpaca-unload-seq 'elpaca--activate-package<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">seq</span> <span style="color: #8959a8;">:ensure</span> `<span style="color: #3e999f;">(</span>seq <span style="color: #8959a8;">:build</span> ,<span style="color: #eab700;">(</span>+elpaca-seq-build-steps<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;;; </span><span style="color: #8e908c; font-style: italic;">Wait for this to be processed before packages that depend on it</span>
<span style="color: #4d4d4c;">(</span>elpaca-wait<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga2a095e" class="outline-2">
<h2 id="orga2a095e"><span class="section-number-2">3.</span> Settings</h2>
<div class="outline-text-2" id="text-3">
<p>
The sections here contain mostly settings that configure keymaps,
command launchers, built-in features, and other details for
day-to-day life.
</p>
</div>

<div id="outline-container-orgd03c9cc" class="outline-3">
<h3 id="orgd03c9cc"><span class="section-number-3">3.1.</span> Keys</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These sections contain setting related to keys and keymaps.
</p>
</div>

<div id="outline-container-orgbc8eada" class="outline-4">
<h4 id="orgbc8eada"><span class="section-number-4">3.1.1.</span> Binding Keys</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
For binding keys, I use the <a href="https://github.com/jwiegley/use-package/blob/master/bind-key.el">bind-key</a> package. Not only does it
easily bind keys, but it does so with some nice features.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-keys</span> <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-h B"</span> . describe-personal-keybindings<span style="color: #eab700;">)</span>
             <span style="color: #eab700;">(</span><span style="color: #3e999f;">"&lt;f7&gt;"</span>  . <span style="color: #718c00;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #4271ae;">()</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">interactive</span> <span style="color: #4d4d4c;">(</span>find-file custom-file<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
By using <code>bind-key</code>, you can specify the keystrokes that invoke a
command. In the example above, we bind functions to the global key
map. Note that in later settings, there are also examples of
mapping keys within local keymaps.
</p>

<p>
If you also want to override any possible minor-mode bindings of
the same keys, you can use <code>bind-key*</code> instead.
</p>

<p>
There is also an <code>unbind-key</code> to, of course, remove any binding.
</p>

<p>
The real kicker is that it will keep track of these bindings and
let you see a summary of your customizations with
</p>

<pre class="example">
M-x describe-personal-keybindings
</pre>


<p>
This is bound to <code>C-h B</code> above.
</p>

<p>
As of emacs 28.1, there is a setting to group bindings into an
outline format. Use the following settings with <code>M-x
    describe-bindings</code> or <code>C-h b</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> describe-bindings-outline t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org16a060a" class="outline-4">
<h4 id="org16a060a"><span class="section-number-4">3.1.2.</span> Personal Keymaps</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The following settings are inspired from
<a href="http://endlessparentheses.com/the-toggle-map-and-wizardry.html">http://endlessparentheses.com/the-toggle-map-and-wizardry.html</a>.
</p>
</div>

<ol class="org-ol">
