Readme.org
****** Deletion

By default, ~M-\~ performs =delete-horizontal-space= and will consume all
of the whitespace present.

I'd like it to be smart and leave one or no spaces if possible. The
=fixup-whitespace= function will do that.

#+begin_src emacs-lisp
  (with-after-elpaca-init
    (bind-key "M-k" 'fixup-whitespace))
#+end_src

***** Scroll window up/down

In addition to moving the cursor, it is also interesting to scroll the
screen (without moving the cursor with respect to the frame).

#+begin_src emacs-lisp
  (defun bnb/scroll-up-1 ()
    "Scroll up by one line."
    (interactive)
    (cua-scroll-up 1))

  (defun bnb/scroll-down-1 ()
    "Scroll down by one line."
    (interactive)
    (cua-scroll-down 1))

  (with-after-elpaca-init
   (with-eval-after-load 'bind-key
     (bind-keys
      ("M-n" . bnb/scroll-up-1)
      ("M-p" . bnb/scroll-down-1))))
#+end_src

***** Align Regexp

When selecting a region, a quick trip to [[help:align-regexp][align-regexp]] can align all of
that nasty text.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (with-eval-after-load 'bind-key
     (bind-key "C-c TAB" 'align-regexp)))
#+end_src

**** Kill current buffer

Another great tip from [[http://pragmaticemacs.com/emacs/dont-kill-buffer-kill-this-buffer-instead/][Pragmatic Emacs]], use [[help:kill-this-buffer][kill-this-buffer]] to kill
the current buffer instead of asking which one.  I'm not overriding
the =C-x k= default, but added a =C-x C-k= alternative.

#+begin_src emacs-lisp
  (defun bnb/kill-this-buffer ()
    "Kill the current buffer"
    (interactive)
    (kill-buffer (current-buffer)))

  (with-after-elpaca-init
   (bind-keys
    ("C-x C-k" . bnb/kill-this-buffer)))
#+end_src

*** Super keys

I like to be able to use the command (or super or hyper) keys for
shortcuts. I need to take care to not interfere with the built-in
operating system shortcuts or my bindings will not work.

#+begin_src emacs-lisp
  (setq mac-function-modifier 'hyper
        mac-pass-command-to-system nil
        mac-right-option-modifier 'none
        mac-right-command-modifier 'hyper
        mac-right-control-modifier 'hyper
        mac-command-modifier 'meta
        mac-control-modifier 'ctrl
        mac-option-modifier 'super)
#+end_src

Note that the right =option= and =command= keys will pass through to the
system. This is especially cool for the =option= key on a mac that lets
insert special characters directly. (E.g. á or ∑ or ®)

Inspiration for the keys comes from [[https://www.wisdomandwonder.com/article/10146/every-emacser-can-use-hyper-on-every-usb-hid-keyboard][wisdom and wonder]].

** Command Launchers

This section holds the settings for my two main command launchers:
hydra and vertico.

*** Hydra

Sometimes it is useful to go into a /command mode/ that lets you quickly
do a few different actions. Hydra does that and more.

By defining specific /hydras/, you can group together commands with
documentation. Think of it as a mini-control-panel. I include it here
and use it elsewhere when grouping commands. (See [[Toggle Map]] for an
example)

The setup is in [[*Hydra][Hydra]] so that I can use it with the previous
keybinding commands.

*** Vertico

Or [[https://github.com/minad/vertico][VERTical Interactive COmpletion]], is my preferred completion
interface.

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :config (vertico-mode))
#+end_src

**** Vertico Directory

The [[https://github.com/minad/vertico/blob/main/extensions/vertico-directory.el][directory]] extension navigates directories like =Ido=.

#+begin_src emacs-lisp
  ;; Configure directory extension.
  (use-package vertico-directory
    :after vertico
    :ensure nil
    ;; More convenient directory navigation commands
    :bind (:map vertico-map
                ("RET"   . vertico-directory-enter)
                ("DEL"   . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word)
                ("?"     . minibuffer-completion-help))
    ;; Tidy shadowed file names
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

