index.html
<li><a id="org5c8bd75"></a>Deletion<br />
<div class="outline-text-7" id="text-3-1-2-3-0-1">
<p>
By default, <code>M-\</code> performs <code>delete-horizontal-space</code> and will
consume all of the whitespace present.
</p>

<p>
I'd like it to be smart and leave one or no spaces if
possible. The <code>fixup-whitespace</code> function will do that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-key</span> <span style="color: #3e999f;">"M-k"</span> 'fixup-whitespace<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>

<li><a id="org38d355e"></a>Scroll window up/down<br />
<div class="outline-text-6" id="text-3-1-2-3-1">
<p>
In addition to moving the cursor, it is also interesting to
scroll the screen (without moving the cursor with respect to the
frame).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/scroll-up-1</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Scroll up by one line."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>cua-scroll-up 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/scroll-down-1</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Scroll down by one line."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>cua-scroll-down 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'bind-key
    <span style="color: #eab700;">(</span><span style="color: #718c00;">bind-keys</span>
     <span style="color: #718c00;">(</span><span style="color: #3e999f;">"M-n"</span> . bnb/scroll-up-1<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #3e999f;">"M-p"</span> . bnb/scroll-down-1<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgaf37466"></a>Align Regexp<br />
<div class="outline-text-6" id="text-3-1-2-3-2">
<p>
When selecting a region, a quick trip to <code>align-regexp</code> can align
all of that nasty text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'bind-key
    <span style="color: #eab700;">(</span><span style="color: #718c00;">bind-key</span> <span style="color: #3e999f;">"C-c TAB"</span> 'align-regexp<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="org4dfd2c0"></a>Kill current buffer<br />
<div class="outline-text-5" id="text-3-1-2-4">
<p>
Another great tip from <a href="http://pragmaticemacs.com/emacs/dont-kill-buffer-kill-this-buffer-instead/">Pragmatic Emacs</a>, use <code>kill-this-buffer</code> to
kill the current buffer instead of asking which one.  I'm not
overriding the <code>C-x k</code> default, but added a <code>C-x C-k</code> alternative.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/kill-this-buffer</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Kill the current buffer"</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>kill-buffer <span style="color: #eab700;">(</span>current-buffer<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-keys</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x C-k"</span> . bnb/kill-this-buffer<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9751a02" class="outline-4">
<h4 id="org9751a02"><span class="section-number-4">3.1.3.</span> Super keys</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
I like to be able to use the command (or super or hyper) keys for
shortcuts. I need to take care to not interfere with the built-in
operating system shortcuts or my bindings will not work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> mac-function-modifier 'hyper
      mac-pass-command-to-system nil
      mac-right-option-modifier 'super
      mac-right-command-modifier 'hyper
      mac-right-control-modifier 'hyper
      mac-command-modifier 'meta
      mac-control-modifier 'ctrl
      mac-option-modifier 'none<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Note that the right <code>option</code> and <code>command</code> keys will pass through to
the system. This is especially cool for the <code>option</code> key on a mac
that lets insert special characters directly. (E.g. á or ∑ or ®)
</p>

<p>
Inspiration for the keys comes from <a href="https://www.wisdomandwonder.com/article/10146/every-emacser-can-use-hyper-on-every-usb-hid-keyboard">wisdom and wonder</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org49bc1f7" class="outline-3">
<h3 id="org49bc1f7"><span class="section-number-3">3.2.</span> Command Launchers</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This section holds the settings for my two main command launchers:
hydra and vertico.
</p>
</div>

<div id="outline-container-org1cb815b" class="outline-4">
<h4 id="org1cb815b"><span class="section-number-4">3.2.1.</span> Hydra</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Sometimes it is useful to go into a <i>command mode</i> that lets you
quickly do a few different actions. Hydra does that and more.
</p>

<p>
By defining specific <i>hydras</i>, you can group together commands with
documentation. Think of it as a mini-control-panel. I include it
here and use it elsewhere when grouping commands. (See <a href="#org5d3992f">3.1.2.1</a>
for an example)
</p>

<p>
The setup is in <a href="#org1cb815b">Hydra</a> so that I can use it with the previous
keybinding commands.
</p>
</div>
</div>

<div id="outline-container-org206b335" class="outline-4">
<h4 id="org206b335"><span class="section-number-4">3.2.2.</span> Vertico</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Or <a href="https://github.com/minad/vertico">VERTical Interactive COmpletion</a>, is my preferred completion
interface.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">vertico</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:config</span> <span style="color: #3e999f;">(</span>vertico-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org579eb4a"></a>Vertico Directory<br />
<div class="outline-text-5" id="text-3-2-2-1">
<p>
The <a href="https://github.com/minad/vertico/blob/main/extensions/vertico-directory.el">directory</a> extension navigates directories like <code>Ido</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Configure directory extension.</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">vertico-directory</span>
  <span style="color: #8959a8;">:after</span> vertico
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">More convenient directory navigation commands</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> vertico-map
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"RET"</span>   . vertico-directory-enter<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"DEL"</span>   . vertico-directory-delete-char<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-DEL"</span> . vertico-directory-delete-word<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"?"</span>     . minibuffer-completion-help<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Tidy shadowed file names</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span>rfn-eshadow-update-overlay . vertico-directory-tidy<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
