Readme.org
**** Embark

The [[https://github.com/oantolin/embark][embark]] package helps find actions relevant to what is near the
point. With =C-.=, a menu pops up with actions to choose from.

#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :bind
    (("C-." . embark-act)
     ("C-;" . embark-dwim)
     ("C-x ." . embark-act)
     ("C-x ;" . embark-dwim)
     ("C-h C-b" . embark-bindings))
    :init
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    (add-to-list 'display-buffer-alist
                 '("\\'\\*Embark Collect \\(Live\\|Comletions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :after (emark consult)
    :ensure t
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

**** Orderless

Easy completion is possible with [[https://github.com/oantolin/orderless][Orderless.]] This completion framework
lets users utilize matching elements separated by spaces.

#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

Within the matching framework, a few /dispatchers/ can modify the
subsequent matchers. The following table summarizes these elements.

| Character | Effect                            |
|-----------+-----------------------------------|
| =!=         | Does /not/ match following literal  |
| =,=         | Matches initial characters        |
| ===         | Forces a literal match            |
| =~=         | Uses the flex matching            |
| =%=         | Matches while ignoring diacritics |

**** Consult

Rounding out the completion helpers, [[https://github.com/minad/consult][Consult]] provides specific
functions that help complete actions or find elements. The bindings
are supplied below.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :bind (;; C-c bindings
           ("C-c h" . consult-history)
           ("C-c m" . consult-mode-command)
           ("C-c b" . consult-bookmark)
           ("C-c k" . consult-macro)
           ("C-c o" . consult-outline)
           ;; C-x bindings
           ("C-x b"   . consult-buffer)
           ("C-x 4 b" . consult-buffer-other-window)
           ("C-x 5 b" . consult-buffer-other-frame)
           ("C-x r x" . consult-register)
           ("C-x r b" . consult-bookmark)
           ;; Custom M bindings
           ("M-g o" . consult-ouline)
           ("M-y"   . consult-yank-pop)
           ("M-i"   . consult-imenu))
    :config
    (defvar bnb/org-agendas
      (list :name "Org Agenda Files"
            :category 'file
            :narrow   ?a
            :face     'consult-file
            :history  'file-name-history
            :action   #'consult--file-action
            :items    #'org-agenda-files))
    (add-to-list 'consult-buffer-sources 'bnb/org-agendas 'append)
    :init
    (fset 'multi-occur #'consult-multi-occur))
#+end_src

One of the more interesting feaures is virtual buffers. When viewing
buffers, recent files, bookmarks, and similar, the interface shows the
buffer as you are selecting so that you can have the right file
context for the line you are selecting.

The [[help:consult-buffer][consult-buffer]] command is powerful and has specific key sequences
that can narrow the buffer list in useful ways.  These are summarized
in the following list.

- =b <SPC>= :: buffers
- =<SPC>= :: hidden buffers
- =* <SPC>= :: modified buffers
- =f <SPC>= :: files
- =r <SPC>= :: file registers
- =m <SPC>= :: bookmarks
- =p <SPC>= :: project


In the code block above, I add one more, =a <SPC>= that will show the
available [[help:org-agenda-files][org-agenda-files]] for easy selection.

