index.html

<li><a id="org0cbaf5e"></a>Embark<br />
<div class="outline-text-5" id="text-3-2-2-2">
<p>
The <a href="https://github.com/oantolin/embark">embark</a> package helps find actions relevant to what is near
the point. With <code>C-.</code>, a menu pops up with actions to choose from.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">embark</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-."</span> . embark-act<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-;"</span> . embark-dwim<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x ."</span> . embark-act<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x ;"</span> . embark-dwim<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-h C-b"</span> . embark-bindings<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> prefix-help-command #'embark-prefix-help-command<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>add-to-list 'display-buffer-alist
               '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\'\\*Embark Collect </span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">Live</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">|</span><span style="color: #3e999f;">Comletions</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">\\*"</span>
                 nil
                 <span style="color: #718c00;">(</span>window-parameters <span style="color: #4271ae;">(</span>mode-line-format . none<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">embark-consult</span>
  <span style="color: #8959a8;">:after</span> <span style="color: #3e999f;">(</span>emark consult<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>embark-collect-mode . consult-preview-at-point-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd30be0d"></a>Orderless<br />
<div class="outline-text-5" id="text-3-2-2-3">
<p>
Easy completion is possible with <a href="https://github.com/oantolin/orderless">Orderless.</a> This completion
framework lets users utilize matching elements separated by
spaces.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">orderless</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>completion-styles '<span style="color: #eab700;">(</span>orderless basic<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>completion-category-overrides '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>file <span style="color: #4271ae;">(</span>styles basic partial-completion<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Within the matching framework, a few <i>dispatchers</i> can modify the
subsequent matchers. The following table summarizes these
elements.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Character</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left">Does <i>not</i> match following literal</td>
</tr>

<tr>
<td class="org-left"><code>,</code></td>
<td class="org-left">Matches initial characters</td>
</tr>

<tr>
<td class="org-left"><code>=</code></td>
<td class="org-left">Forces a literal match</td>
</tr>

<tr>
<td class="org-left"><code>~</code></td>
<td class="org-left">Uses the flex matching</td>
</tr>

<tr>
<td class="org-left"><code>%</code></td>
<td class="org-left">Matches while ignoring diacritics</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org1d0a9ee"></a>Consult<br />
<div class="outline-text-5" id="text-3-2-2-4">
<p>
Rounding out the completion helpers, <a href="https://github.com/minad/consult">Consult</a> provides specific
functions that help complete actions or find elements. The
bindings are supplied below.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">consult</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">C-c bindings</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c h"</span> . consult-history<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c m"</span> . consult-mode-command<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c b"</span> . consult-bookmark<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c k"</span> . consult-macro<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c o"</span> . consult-outline<span style="color: #eab700;">)</span>
         <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">C-x bindings</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x b"</span>   . consult-buffer<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x 4 b"</span> . consult-buffer-other-window<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x 5 b"</span> . consult-buffer-other-frame<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x r x"</span> . consult-register<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x r b"</span> . consult-bookmark<span style="color: #eab700;">)</span>
         <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Custom M bindings</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-g o"</span> . consult-ouline<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-y"</span>   . consult-yank-pop<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-i"</span>   . consult-imenu<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">bnb/org-agendas</span>
    <span style="color: #eab700;">(</span>list <span style="color: #8959a8;">:name</span> <span style="color: #3e999f;">"Org Agenda Files"</span>
          <span style="color: #8959a8;">:category</span> 'file
          <span style="color: #8959a8;">:narrow</span>   ?a
          <span style="color: #8959a8;">:face</span>     'consult-file
          <span style="color: #8959a8;">:history</span>  'file-name-history
          <span style="color: #8959a8;">:action</span>   #'consult--file-action
          <span style="color: #8959a8;">:items</span>    #'org-agenda-files<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'consult-buffer-sources 'bnb/org-agendas 'append<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>fset 'multi-occur #'consult-multi-occur<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
One of the more interesting feaures is virtual buffers. When
viewing buffers, recent files, bookmarks, and similar, the
interface shows the buffer as you are selecting so that you can
have the right file context for the line you are selecting.
</p>

<p>
The <code>consult-buffer</code> command is powerful and has specific key
sequences that can narrow the buffer list in useful ways.  These
are summarized in the following list.
</p>

<dl class="org-dl">
<dt><code>b &lt;SPC&gt;</code></dt><dd>buffers</dd>
<dt><code>&lt;SPC&gt;</code></dt><dd>hidden buffers</dd>
<dt><code>* &lt;SPC&gt;</code></dt><dd>modified buffers</dd>
<dt><code>f &lt;SPC&gt;</code></dt><dd>files</dd>
<dt><code>r &lt;SPC&gt;</code></dt><dd>file registers</dd>
<dt><code>m &lt;SPC&gt;</code></dt><dd>bookmarks</dd>
<dt><code>p &lt;SPC&gt;</code></dt><dd>project</dd>
</dl>


<p>
In the code block above, I add one more, <code>a &lt;SPC&gt;</code> that will show
the available <code>org-agenda-files</code> for easy selection.
</p>
</div>
</li>
