Readme.org
**** Marginalia

The great thing about vertical completion is the extra horizontal
space. [[https://github.com/minad/marginalia][Marginalia]] makes use of this extra space by providing
relevant extra information about each element on the line.

#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
    :init
    (marginalia-mode)
    :config
    (setq marginalia-annotators
          '(marginalia-annotators-heavy marginalia-annotators-light)))
#+end_src

** Expansion & Completion

This section defines interations with text expansion systems.

*** Abbrev

The following block is courtesy of [[http://endlessparentheses.com/ispell-and-abbrev-the-perfect-auto-correct.html][Endless Parentheses]]. For regular
misspellings, we can do [[help:ispell][ispell]] and then make an abbreviation for
future corrections.

#+begin_src emacs-lisp
  (defun bnb/ispell-word-then-abbrev (p)
    "Call `ispell-word'. Then create an abbrev for the correction
      made. With prefix P, create local abbrev. Otherwise, it will be
      global."
    (interactive "P")
    (let ((bef (downcase (or (thing-at-point 'word) ""))) aft)
      (call-interactively 'ispell-word)
      (setq aft (downcase (or (thing-at-point 'word) "")))
      (unless (string= aft bef)
        (message "\"%s\" now expands to \"%s\" %sally"
                 bef aft (if p "loc" "glob"))
        (define-abbrev
          (if p global-abbrev-table local-abbrev-table)
          bef aft))))

  (use-package abbrev
    :ensure nil
    :delight " ⚆"
    :bind (("C-x C-i" . bnb/ispell-word-then-abbrev))
    :config
    (setq save-abbrevs t)
    (setq-default abbrev-mode t))
#+end_src

