index.html

<li><a id="orgb17e65b"></a>Marginalia<br />
<div class="outline-text-5" id="text-3-2-2-5">
<p>
The great thing about vertical completion is the extra horizontal
space. <a href="https://github.com/minad/marginalia">Marginalia</a> makes use of this extra space by providing
relevant extra information about each element on the line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">marginalia</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> minibuffer-local-map
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-A"</span> . marginalia-cycle<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>marginalia-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> marginalia-annotators
        '<span style="color: #eab700;">(</span>marginalia-annotators-heavy marginalia-annotators-light<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org10dff39" class="outline-3">
<h3 id="org10dff39"><span class="section-number-3">3.3.</span> Expansion &amp; Completion</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This section defines interations with text expansion systems.
</p>
</div>

<div id="outline-container-org435fc7a" class="outline-4">
<h4 id="org435fc7a"><span class="section-number-4">3.3.1.</span> Abbrev</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
The following block is courtesy of <a href="http://endlessparentheses.com/ispell-and-abbrev-the-perfect-auto-correct.html">Endless Parentheses</a>. For
regular misspellings, we can do <code>ispell</code> and then make an
abbreviation for future corrections.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/ispell-word-then-abbrev</span> <span style="color: #3e999f;">(</span>p<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Call `</span><span style="color: #4271ae;">ispell-word</span><span style="color: #8959a8;">'. Then create an abbrev for the correction</span>
<span style="color: #8959a8;">    made. With prefix P, create local abbrev. Otherwise, it will be</span>
<span style="color: #8959a8;">    global."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span> <span style="color: #3e999f;">"P"</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>bef <span style="color: #4271ae;">(</span>downcase <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">or</span> <span style="color: #3e999f;">(</span>thing-at-point 'word<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">""</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span> aft<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>call-interactively 'ispell-word<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> aft <span style="color: #718c00;">(</span>downcase <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>thing-at-point 'word<span style="color: #4d4d4c;">)</span> <span style="color: #3e999f;">""</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">unless</span> <span style="color: #718c00;">(</span>string= aft bef<span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>message <span style="color: #3e999f;">"\"%s\" now expands to \"%s\" %sally"</span>
               bef aft <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> p <span style="color: #3e999f;">"loc"</span> <span style="color: #3e999f;">"glob"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>define-abbrev
        <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> p global-abbrev-table local-abbrev-table<span style="color: #4271ae;">)</span>
        bef aft<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">abbrev</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:delight</span> <span style="color: #3e999f;">"&#8201;&#9862;"</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x C-i"</span> . bnb/ispell-word-then-abbrev<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> save-abbrevs t<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> abbrev-mode t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
