Readme.org
*** Yasnippet                                                       :PENDING:

Text expansion makes sense in many programming modes. [[https://joaotavora.github.io/yasnippet/index.html][Yasnippet]] comes
in handy by providing a minor mode for easy expansions.

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :defer 30
    :hook
    (prog-mode . yas-minor-mode)
    (text-mode . yas-minor-mode)
    :config
    (yas-reload-all))
#+end_src

I also load a collection of [[https://github.com/AndreaCrotti/yasnippet-snippets][yasnippet snippets]] so I don't have to
maintain my own.

#+begin_src emacs-lisp
  (use-package yasnippet-snippets
    :ensure t)


*** Hippie Expand

Try to expand the text before point in an intelligent way. Repeat the
keypress to cycle through options.

#+begin_src emacs-lisp
  (with-after-elpaca-init
    (bind-key "M-/" 'hippie-expand))
#+end_src

** Built-in Features

Emacs comes with some nice batteries. This section configures my
favorites.

*** Backups

Sensible backup settings from [[https://www.emacswiki.org/emacs/BackupDirectory]]

#+begin_src emacs-lisp
  (setq backup-by-copying t
        create-lockfiles nil
        backup-directory-alist '((".*" . "~/.emacs.d/.saves"))
        ;; auto-save-file-name-transforms `((".*" "~/.saves" t))
        kill-buffer-delete-auto-save-files t
        delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t)
#+end_src

Here's a quick rundown of the settings:

- [[help:backup-by-copying][backup-by-copying]] :: Use copying to create backups when ~t~
- [[help:create-lockfile][create-lockfiles]] :: Don't use lockfiles if ~nil~
- [[help:backup-directory-alist][backup-directory-alist]] :: List of regexp/location pairs of where to backup files
- [[help:backup-directory-alist][kill-buffer-delete-auto-save-files]] :: Killing a buffer with an auto-save file will prompt for deletion
- [[help:delete-old-versions][delete-old-versions]] :: Delete excess backups silently if ~t~
- [[help:kept-new-versions][kept-new-versions]] :: Number of newest versions to keep
- [[help:kept-old-versions][kept-old-versions]] :: Number of oldest versions to keep
- [[help:version-control][version-control]] :: When ~t~, make numeric backup versions always

*** Default File encoding

I like to have the files be =utf-8= by default. Do let me know if I
shouldn't do this, will you?

Set =utf-8= for all coding systems except for the clipboard on
windows. That one gets =utf-16le= to be compatible.

#+begin_src emacs-lisp
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-language-environment 'utf-8)
  (setq buffer-file-coding-system 'utf-8
        x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
  ;; MS Windows clipboard is UTF-16LE
  (when (eq system-type 'windows-nt)
    (set-clipboard-coding-system 'utf-16le-dos))
#+end_src

*** Native Compilation

Emacs 28.1 introduced [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Native-Compilation.html][Native Compilation]]. When this feature is
available, I use it to compile the packages.

There are also two settings to make the process slightly more verbose
and ensure that warnings and erros are bubbled up from any async
processes.

#+begin_src emacs-lisp
  (if (native-comp-available-p)
      (setq package-native-compile t
            native-comp-verbose 1
            native-comp-async-report-warnings-errors t))
#+end_src

*** Path

Sometimes Emacs' idea of path differs from the shell. The package
[[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]] seeks to bring those in line with each other.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
#+end_src

*** Server

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html][Using Emacs as a server]] is a great way to keep the power responsive.

#+begin_src emacs-lisp
  (when (and (or (eq system-type 'windows-nt) (eq system-type 'darwin))
             (not (and (boundp 'server-clients) server-clients))
             (not (daemonp)))
    (server-start))
#+end_src

*** Sounds

I dislike the bell ringing when I hit =C-g=. To silence the bell, just
set the =ring-bell-function= to =nil=.

#+begin_src emacs-lisp
  (setq visual-bell nil
        ring-bell-function `(lambda () nil))
#+end_src

