index.html

<div id="outline-container-orgcf49715" class="outline-4">
<h4 id="orgcf49715"><span class="section-number-4">3.3.5.</span> Yasnippet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
Text expansion makes sense in many programming modes. <a href="https://joaotavora.github.io/yasnippet/index.html">Yasnippet</a>
comes in handy by providing a minor mode for easy expansions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">yasnippet</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:defer</span> 30
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>prog-mode . yas-minor-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>text-mode . yas-minor-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>yas-reload-all<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
I also load a collection of <a href="https://github.com/AndreaCrotti/yasnippet-snippets">yasnippet snippets</a> so I don't have to
maintain my own.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">yasnippet-snippets</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3bc916" class="outline-4">
<h4 id="orge3bc916"><span class="section-number-4">3.3.6.</span> Hippie Expand</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
Try to expand the text before point in an intelligent way. Repeat
the keypress to cycle through options.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-key</span> <span style="color: #3e999f;">"M-/"</span> 'hippie-expand<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgb5fcc00" class="outline-3">
<h3 id="orgb5fcc00"><span class="section-number-3">3.4.</span> Built-in Features</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Emacs comes with some nice batteries. This section configures my
favorites.
</p>
</div>

<div id="outline-container-orgb3c7e9f" class="outline-4">
<h4 id="orgb3c7e9f"><span class="section-number-4">3.4.1.</span> Backups</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Sensible backup settings from <a href="https://www.emacswiki.org/emacs/BackupDirectory">https://www.emacswiki.org/emacs/BackupDirectory</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> backup-by-copying t
      create-lockfiles nil
      backup-directory-alist '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">".*"</span> . <span style="color: #3e999f;">"~/.emacs.d/.saves"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
      <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">auto-save-file-name-transforms `((".*" "~/.saves" t))</span>
      kill-buffer-delete-auto-save-files t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Here's a quick rundown of the settings:
</p>

<dl class="org-dl">
<dt><code><code>backup-by-copying</code></code></dt><dd>Use copying to create backups when <code>t</code></dd>
<dt><code><code>create-lockfiles</code></code></dt><dd>Don't use lockfiles if <code>nil</code></dd>
<dt><code><code>backup-directory-alist</code></code></dt><dd>List of regexp/location pairs of where to backup files</dd>
<dt><code><code>kill-buffer-delete-auto-save-files</code></code></dt><dd>Killing a buffer with an auto-save file will prompt for deletion</dd>
<dt><code><code>delete-old-versions</code></code></dt><dd>Delete excess backups silently if <code>t</code></dd>
<dt><code><code>kept-new-versions</code></code></dt><dd>Number of newest versions to keep</dd>
<dt><code><code>kept-old-versions</code></code></dt><dd>Number of oldest versions to keep</dd>
<dt><code><code>version-control</code></code></dt><dd>When <code>t</code>, make numeric backup versions always</dd>
</dl>
</div>
</div>

<div id="outline-container-org6590a54" class="outline-4">
<h4 id="org6590a54"><span class="section-number-4">3.4.2.</span> Default File encoding</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
I like to have the files be <code>utf-8</code> by default. Do
let me know if I shouldn't do this, will you?
</p>

<p>
Set <code>utf-8</code> for all coding systems except for the clipboard on
windows. That one gets <code>utf-16le</code> to be compatible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>prefer-coding-system       'utf-8<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-default-coding-systems 'utf-8<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-terminal-coding-system 'utf-8<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-language-environment 'utf-8<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> buffer-file-coding-system 'utf-8
      x-select-request-type '<span style="color: #3e999f;">(</span>UTF8_STRING COMPOUND_TEXT TEXT STRING<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">MS Windows clipboard is UTF-16LE</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">when</span> <span style="color: #3e999f;">(</span>eq system-type 'windows-nt<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>set-clipboard-coding-system 'utf-16le-dos<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org70ee5fb" class="outline-4">
<h4 id="org70ee5fb"><span class="section-number-4">3.4.3.</span> Native Compilation</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Emacs 28.1 introduced <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Native-Compilation.html">Native Compilation</a>. When this feature is
available, I use it to compile the packages.
</p>

<p>
There are also two settings to make the process slightly more
verbose and ensure that warnings and erros are bubbled up from any
async processes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">if</span> <span style="color: #3e999f;">(</span>native-comp-available-p<span style="color: #3e999f;">)</span>
    <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> package-native-compile t
          native-comp-verbose 1
          native-comp-async-report-warnings-errors t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdb068f1" class="outline-4">
<h4 id="orgdb068f1"><span class="section-number-4">3.4.4.</span> Path</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
Sometimes Emacs' idea of path differs from the shell. The package
<a href="https://github.com/purcell/exec-path-from-shell">exec-path-from-shell</a> seeks to bring those in line with each other.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">exec-path-from-shell</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">when</span> <span style="color: #eab700;">(</span>memq window-system '<span style="color: #718c00;">(</span>mac ns x<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>exec-path-from-shell-initialize<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org41c9964" class="outline-4">
<h4 id="org41c9964"><span class="section-number-4">3.4.5.</span> Server</h4>
<div class="outline-text-4" id="text-3-4-5">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html">Using Emacs as a server</a> is a great way to keep the power
responsive.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">when</span> <span style="color: #3e999f;">(</span><span style="color: #718c00;">and</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">or</span> <span style="color: #718c00;">(</span>eq system-type 'windows-nt<span style="color: #718c00;">)</span> <span style="color: #718c00;">(</span>eq system-type 'darwin<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
           <span style="color: #eab700;">(</span>not <span style="color: #718c00;">(</span><span style="color: #718c00;">and</span> <span style="color: #4271ae;">(</span>boundp 'server-clients<span style="color: #4271ae;">)</span> server-clients<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
           <span style="color: #eab700;">(</span>not <span style="color: #718c00;">(</span>daemonp<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>server-start<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2937b8" class="outline-4">
<h4 id="orgd2937b8"><span class="section-number-4">3.4.6.</span> Sounds</h4>
<div class="outline-text-4" id="text-3-4-6">
<p>
I dislike the bell ringing when I hit <code>C-g</code>. To silence the bell,
just set the <code>ring-bell-function</code> to <code>nil</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> visual-bell nil
      ring-bell-function `<span style="color: #3e999f;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #eab700;">()</span> nil<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
