Readme.org
*** Recentf

I enable emacs remembering recently open files. For my setup, this
feeds into the candidates for [[*Consult][Consult]].

#+begin_src emacs-lisp
  (with-after-elpaca-init
    (recentf-mode t))
#+end_src

*** Timezones

For [[help:world-clock][world-clock]], it's best to define the time zones most relevant
to me. For compatible time zones, check [[https://en.wikipedia.org/wiki/List_of_tz_database_time_zones][this handy list]].

#+begin_src emacs-lisp
  (setq zoneinfo-style-world-list
        '(("America/New_York" "CBUS")
          ("America/Los_Angeles" "San Fran")
          ("Europe/London" "London")
          ("Australia/Sydney" "Sydney")
          ("Asia/Kolkata" "Bangalore")))
#+end_src

*** Isearch

Folding quotes will allow isearch to find /similar/ characters to
the ones being searched for.

#+begin_src emacs-lisp
  ;; New in Emacs 29
  (setq isearch-fold-quotes-mode t)
#+end_src

** Minibuffer

This section holds any =minibuffer= settings.

*** Minibuffer History

Let's get rid of duplicates in the minibuffer history.

#+begin_src emacs-lisp
  (setq history-delete-duplicates t)
#+end_src

This saves the minibuffer histories to preserve across emacs sessions.

#+begin_src emacs-lisp
  (with-after-elpaca-init
    (setq savehist-additional-variables '(search-ring regexp-search-ring)
          savehist-file "~/.emacs.d/savehist")
    (savehist-mode t))
#+end_src

** Movement

Getting around takes a little tweaking. This section holds the details
on how movement is defined for me.

*** Ace Utilities

The Ace (and subsequent Avy) packages aid in jumping the cursor to the
right place in the buffer.

**** Ace Flyspell

Turn on [[https://github.com/cute-jumper/ace-flyspell][ace-flyspell]] when flyspell is enabled. This mode helps jump
between the errors (misspellings) discovered by flyspell.

#+begin_src emacs-lisp
  (use-package ace-flyspell
    :after (hydra major-mode-hydra) 
    :ensure t
    :commands (ace-flyspell-setup)
    :bind
    ("H-s" . hydra-fly/body)
    :hook
    (flyspell-mode . ace-flyspell-setup)
    :init
    (pretty-hydra-define hydra-fly (:color pink :quit-key "q" :title "  Flyspell")
      ("Checking"
       (("b" flyspell-buffer "Check buffer")
        ("r" flyspell-region "Check region"))
       "Correction"
       (("c" ispell-word "Correct word")
        ("." ace-flyspell-dwim "dwim"))
       "Movement"
       (("n" flyspell-goto-next-error "Next error")
        ("j" ace-flyspell-jump-word "Jump word")))))
#+end_src


**** Ace Isearch

Supercharge ~isearch~ to vary its behavior depending on the input. The
~C-'~ key let's me jump to the isearch match easily with the ~ace-jump~
methods.

#+begin_src emacs-lisp
  (use-package ace-isearch
    :ensure t
    :bind (:map isearch-mode-map
                ("C-'" . ace-isearch-jump-during-isearch))
    :delight ace-isearch-mode
    :config
    (global-ace-isearch-mode t)
    (setq ace-isearch-input-length 8))
#+end_src

**** Ace Link

In modes with links, use =o= to jump to links. Map =M-o= to do the same in
[[*Orgmode][Orgmode]].

#+begin_src emacs-lisp
  (use-package ace-link
    :ensure t
    :bind (:map org-mode-map ("M-o" . ace-link-org))
    :config (ace-link-setup-default))
#+end_src

