index.html

<div id="outline-container-org356f8da" class="outline-4">
<h4 id="org356f8da"><span class="section-number-4">3.4.7.</span> Recentf</h4>
<div class="outline-text-4" id="text-3-4-7">
<p>
I enable emacs remembering recently open files. For my setup, this
feeds into the candidates for <a href="#org1d0a9ee">Consult</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span>recentf-mode t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7108fb" class="outline-4">
<h4 id="orgc7108fb"><span class="section-number-4">3.4.8.</span> Timezones</h4>
<div class="outline-text-4" id="text-3-4-8">
<p>
For <code>world-clock</code>, it's best to define the time zones most relevant
to me. For compatible time zones, check <a href="https://en.wikipedia.org/wiki/List_of_tz_database_time_zones">this handy list</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> zoneinfo-style-world-list
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"America/New_York"</span> <span style="color: #3e999f;">"CBUS"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"America/Los_Angeles"</span> <span style="color: #3e999f;">"San Fran"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"Europe/London"</span> <span style="color: #3e999f;">"London"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"Australia/Sydney"</span> <span style="color: #3e999f;">"Sydney"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"Asia/Kolkata"</span> <span style="color: #3e999f;">"Bangalore"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e6fbee" class="outline-4">
<h4 id="org2e6fbee"><span class="section-number-4">3.4.9.</span> Isearch</h4>
<div class="outline-text-4" id="text-3-4-9">
<p>
Folding quotes will allow isearch to find <i>similar</i> characters to
the ones being searched for.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">New in Emacs 29</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> isearch-fold-quotes-mode t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org502dcc8" class="outline-3">
<h3 id="org502dcc8"><span class="section-number-3">3.5.</span> Minibuffer</h3>
<div class="outline-text-3" id="text-3-5">
<p>
This section holds any <code>minibuffer</code> settings.
</p>
</div>

<div id="outline-container-orgd622298" class="outline-4">
<h4 id="orgd622298"><span class="section-number-4">3.5.1.</span> Minibuffer History</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Let's get rid of duplicates in the minibuffer history.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> history-delete-duplicates t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
This saves the minibuffer histories to preserve across emacs
sessions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> savehist-additional-variables '<span style="color: #eab700;">(</span>search-ring regexp-search-ring<span style="color: #eab700;">)</span>
        savehist-file <span style="color: #3e999f;">"~/.emacs.d/savehist"</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>savehist-mode t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org522a4f6" class="outline-3">
<h3 id="org522a4f6"><span class="section-number-3">3.6.</span> Movement</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Getting around takes a little tweaking. This section holds the
details on how movement is defined for me.
</p>
</div>

<div id="outline-container-orgabac837" class="outline-4">
<h4 id="orgabac837"><span class="section-number-4">3.6.1.</span> Ace Utilities</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
The Ace (and subsequent Avy) packages aid in jumping the cursor to
the right place in the buffer.
</p>
</div>

<ol class="org-ol">
<li><a id="orgc633edc"></a>Ace Flyspell<br />
<div class="outline-text-5" id="text-3-6-1-1">
<p>
Turn on <a href="https://github.com/cute-jumper/ace-flyspell">ace-flyspell</a> when flyspell is enabled. This mode helps
jump between the errors (misspellings) discovered by flyspell.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ace-flyspell</span>
  <span style="color: #8959a8;">:after</span> hydra
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>ace-flyspell-setup<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-s"</span> . hydra-fly/body<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>flyspell-mode . ace-flyspell-setup<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defhydra</span> hydra-fly <span style="color: #eab700;">(</span><span style="color: #8959a8;">:color</span> pink<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"n"</span> flyspell-goto-next-error <span style="color: #3e999f;">"Next error"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"c"</span> ispell-word <span style="color: #3e999f;">"Correct word"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"j"</span> ace-flyspell-jump-word <span style="color: #3e999f;">"Jump word"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"."</span> ace-flyspell-dwim <span style="color: #3e999f;">"dwim"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"q"</span> nil <span style="color: #3e999f;">"Quit"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>


<li><a id="orgdb98ec1"></a>Ace Isearch<br />
<div class="outline-text-5" id="text-3-6-1-2">
<p>
Supercharge <code>isearch</code> to vary its behavior depending on the
input. The <code>C-'</code> key let's me jump to the isearch match easily
with the <code>ace-jump</code> methods.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ace-isearch</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> isearch-mode-map
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-'"</span> . ace-isearch-jump-during-isearch<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:delight</span> ace-isearch-mode
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>global-ace-isearch-mode t<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> ace-isearch-input-length 8<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org4c2aa00"></a>Ace Link<br />
<div class="outline-text-5" id="text-3-6-1-3">
<p>
In modes with links, use <code>o</code> to jump to links. Map <code>M-o</code> to do the
same in <a href="#orgf3faca8">Orgmode</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ace-link</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> org-mode-map <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-o"</span> . ace-link-org<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span> <span style="color: #3e999f;">(</span>ace-link-setup-default<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
