Readme.org
*** Read-only helpers

For read-only files, look at them in [[help:view-mode][view-mode]] which will enable
vi-style navigation. In this mode, kill commands will save text, but
not remove it.

#+begin_src emacs-lisp
  (use-package view
    :ensure nil
    :delight " 👁"
    :init (setq view-read-only t)
    :bind (:map view-mode-map
                ("n" . next-line    )
                ("p" . previous-line)
                ("j" . next-line    )
                ("k" . previous-line)
                ("l" . forward-char)
                ("h" . bnb/view/h)
                ("q" . bnb/view/q))
    :config
    (defun bnb/view/h ()
      "Setup a function to go backwards a character"
      (interactive)
      (forward-char -1))
    (defun bnb/view/q ()
      "Setup a function to quit `view-mode`"
      (interactive)
      (view-mode -1)))
#+end_src

*** Scroll Screen Position

This is one of those cool finds for a problem I mostly knew that I
had. I often hit =C-v= by accident and lose my place. With the following
setting, =M-v= completely undoes the scroll leaving the cursor back in
the original position.

#+begin_src emacs-lisp
  (setq scroll-preserve-screen-position 'always)
#+end_src

Thanks to http://irreal.org/blog/?p=3963 for the tip.

** Custom Helpers

This is a collection of code specific to how I use emacs. Some are
from different websites or other Emacs users.

*** Auto-display agenda

[[http://lists.gnu.org/archive/html/emacs-orgmode/2010-03/msg00367.html][John Weigley shows a way]] to display the agenda after some period of
inactivity.

#+begin_src emacs-lisp
  (defun bnb/jump-to-org-agenda ()
    "Create and jump to the bnb org agenda."
    (interactive)
    (let ((buf (get-buffer "*Org Agenda*"))
          wind)
      (if buf
          (if (setq wind (get-buffer-window buf))
              (select-window wind)
            (if (called-interactively-p)
                (progn
                  (select-window (display-buffer buf t t))
                  (org-fit-window-to-buffer))
              (with-selected-window (display-buffer buf)
                (org-fit-window-to-buffer))))
        (org-agenda nil "f."))))

  (defun bnb/idle-agenda (&optional arg)
    "Set or cancel idle agenda timer based on [ARG]."
    (interactive "P")
    (setq bnb/iagenda
          (if arg
              (cancel-timer bnb/iagenda)
            (run-with-idle-timer 3600 t 'bnb/jump-to-org-agenda))))

  (with-after-elpaca-init
   (bnb/idle-agenda))
#+end_src

*** Auto-indent when pasting

Automatically indent pasted blocks of text.

#+begin_src elisp
  (dolist (command '(yank yank-pop))
    (eval `(defadvice ,command (after indent-region activate)
             (and (not current-prefix-arg)
                  (let ((mark-even-if-inactive transient-mark-mode))
                    (indent-region (region-beginning) (region-end) nil))))))
#+end_src

