index.html

<div id="outline-container-orga610ec6" class="outline-4">
<h4 id="orga610ec6"><span class="section-number-4">3.6.3.</span> Read-only helpers</h4>
<div class="outline-text-4" id="text-3-6-3">
<p>
For read-only files, look at them in <code>view-mode</code> which will enable
vi-style navigation. In this mode, kill commands will save text,
but not remove it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">view</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:delight</span> <span style="color: #3e999f;">"&#8201;&#128065;"</span>
  <span style="color: #8959a8;">:init</span> <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> view-read-only t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> view-mode-map
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"n"</span> . next-line    <span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"p"</span> . previous-line<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"j"</span> . next-line    <span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"k"</span> . previous-line<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"l"</span> . forward-char<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"h"</span> . bnb/view/h<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"q"</span> . bnb/view/q<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/view/h</span> <span style="color: #eab700;">()</span>
    <span style="color: #8959a8;">"Setup a function to go backwards a character"</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>forward-char -1<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/view/q</span> <span style="color: #eab700;">()</span>
    <span style="color: #8959a8;">"Setup a function to quit `view-mode`"</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>view-mode -1<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c3d6e8" class="outline-4">
<h4 id="org2c3d6e8"><span class="section-number-4">3.6.4.</span> Scroll Screen Position</h4>
<div class="outline-text-4" id="text-3-6-4">
<p>
This is one of those cool finds for a problem I mostly knew that I
had. I often hit <code>C-v</code> by accident and lose my place. With the
following setting, <code>M-v</code> completely undoes the scroll leaving the
cursor back in the original position.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> scroll-preserve-screen-position 'always<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Thanks to <a href="http://irreal.org/blog/?p=3963">http://irreal.org/blog/?p=3963</a> for the tip.
</p>
</div>
</div>
</div>

<div id="outline-container-orge7fe4e1" class="outline-3">
<h3 id="orge7fe4e1"><span class="section-number-3">3.7.</span> Custom Helpers</h3>
<div class="outline-text-3" id="text-3-7">
<p>
This is a collection of code specific to how I use emacs. Some
are from different websites or other Emacs users.
</p>
</div>

<div id="outline-container-org9c2b51a" class="outline-4">
<h4 id="org9c2b51a"><span class="section-number-4">3.7.1.</span> Auto-display agenda</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
<a href="http://lists.gnu.org/archive/html/emacs-orgmode/2010-03/msg00367.html">John Weigley shows a way</a> to display the agenda after some period
of inactivity.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/jump-to-org-agenda</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Create and jump to the bnb org agenda."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>buf <span style="color: #4271ae;">(</span>get-buffer <span style="color: #3e999f;">"*Org Agenda*"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        wind<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">if</span> buf
        <span style="color: #718c00;">(</span><span style="color: #718c00;">if</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">setq</span> wind <span style="color: #4d4d4c;">(</span>get-buffer-window buf<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
            <span style="color: #4271ae;">(</span>select-window wind<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> <span style="color: #4d4d4c;">(</span>called-interactively-p<span style="color: #4d4d4c;">)</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">progn</span>
                <span style="color: #3e999f;">(</span>select-window <span style="color: #eab700;">(</span>display-buffer buf t t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
                <span style="color: #3e999f;">(</span>org-fit-window-to-buffer<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-selected-window</span> <span style="color: #3e999f;">(</span>display-buffer buf<span style="color: #3e999f;">)</span>
              <span style="color: #3e999f;">(</span>org-fit-window-to-buffer<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>bnb/org-agenda-with-tip nil<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/idle-agenda</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;optional</span> arg<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Set or cancel idle agenda timer based on [ARG]."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span> <span style="color: #3e999f;">"P"</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> bnb/iagenda
        <span style="color: #eab700;">(</span><span style="color: #718c00;">if</span> arg
            <span style="color: #718c00;">(</span>cancel-timer bnb/iagenda<span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span>run-with-idle-timer 3600 t 'bnb/jump-to-org-agenda<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span>bnb/idle-agenda<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org10de967" class="outline-4">
<h4 id="org10de967"><span class="section-number-4">3.7.2.</span> Auto-indent when pasting</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
Automatically indent pasted blocks of text.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">dolist</span> <span style="color: #3e999f;">(</span>command '<span style="color: #eab700;">(</span>yank yank-pop<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eval `<span style="color: #eab700;">(</span><span style="color: #718c00;">defadvice</span> ,command <span style="color: #718c00;">(</span>after indent-region activate<span style="color: #718c00;">)</span>
           <span style="color: #718c00;">(</span><span style="color: #718c00;">and</span> <span style="color: #4271ae;">(</span>not current-prefix-arg<span style="color: #4271ae;">)</span>
                <span style="color: #4271ae;">(</span><span style="color: #718c00;">let</span> <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>mark-even-if-inactive transient-mark-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
                  <span style="color: #4d4d4c;">(</span>indent-region <span style="color: #3e999f;">(</span>region-beginning<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>region-end<span style="color: #3e999f;">)</span> nil<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
