Readme.org
*** Better window splitting functions

http://www.reddit.com/r/emacs/comments/25v0eo/you_emacs_tips_and_tricks/chldury

These settings split the window and load a previous buffer (instead of
the same buffer in both).  This has a better chance of being what I
want when splitting strings.

#+begin_src emacs-lisp
  (defun bnb/vplit-last-buffer ()
    "When splitting the frame, load the last visited buffer."
    (interactive)
    (split-window-vertically)
    (other-window 1 nil)
    (switch-to-next-buffer))

  (defun bnb/hsplit-last-buffer ()
    "When splitting the frame, load the last visited buffer."
    (interactive)
    (split-window-horizontally)
    (other-window 1 nil)
    (switch-to-next-buffer))

  (with-after-elpaca-init
   (bind-keys
    ("C-x 2" . bnb/vplit-last-buffer)
    ("C-x 3" . bnb/hsplit-last-buffer)))
#+end_src

*** Hide mode line

This is a fun one I picked from a now defunct website. This block
of code hides the mode-line for the current buffer (window).

#+begin_src emacs-lisp
  ;; Setup buffer-local behavior
  (defvar-local bnb/hide-mode-line-mode nil)
  ;; Setup minor mode
  (define-minor-mode bnb/hide-mode-line-mode
    "Minor mode to hide mode-line in current buffer"
    :init-value nil
    :global nil
    :variable bnb/hide-mode-line-mode
    :group 'editing-basics
    (if bnb/hide-mode-line-mode
        (setq bnb/hide-mode-line-mode/saved-format mode-line-format
              mode-line-format nil)
      (setq mode-line-format bnb/hide-mode-line-mode/saved-format
            bnb/hide-mode-line-mode/saved-format nil))
    (force-mode-line-update)
    (redraw-display)
    (when (and (called-interactively-p 'interactive)
               bnb/hide-mode-line-mode)
      (run-with-idle-timer
       0 nil 'message
       (concat "Goodbye mode line!"
               "Use M-x bnb/hide-mode-line-mode to make the mode-line appear"))))

  ;; Bind global key
  (with-after-elpaca-init
   (bind-key "H-0" 'bnb/hide-mode-line-mode))
#+end_src

*** Open/Edit This file

When I hit ~<F5>~, open this file for editing. That way, any
time I have something I need to remember for my emacs setting, it
is just a button-push away.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (bind-key
    "<f5>"
    (lambda ()
      (interactive)
      (find-file "~/.emacs.d/bnb-emacs/Readme.org"))))
#+end_src

*** Org-column resizing

In order to resize the face when `org-column` mode is on, some advice
is in order. The face used has a set =:height= that is not overridden by
custom face settings.

To have a custom height, this advice prepends the list with an
anonymous face with a height of 0.8. This setting happens first, so it
wins.

#+begin_src emacs-lisp
  (defun bnb/org-overlay-font-override (orig-fn beg end &optional txt face)
    (let ((bnbface (cons '(:height 0.8) face)))
      (funcall orig-fn beg end txt bnbface)))

  (with-eval-after-load 'org
    (advice-add 'org-columns--new-overlay :around #'bnb/org-overlay-font-override))
   ;(advice-remove 'org-columns--new-overlay #'bnb/org-overlay-font-override)
#+end_src

*** Prettify macro

There is a little bit of boilerplate to get the right set or
replacements set for prettify correctly. This is exactly why macros
are a thing. This one simplifies the call to provide a mode, and the
list of replacements.

#+begin_src emacs-lisp
  (defmacro bnb/prettify (mode replacements)
    "Set the prettify REPLACEMETS for MODE in a mode hook"
    `(progn
       (setq ,(intern (concat "bnb/prettify-" mode "-replacements")) ,replacements)
       (defun ,(intern (concat "bnb/prettify-" mode "-setup"))
           ()
         (mapc
          (lambda (pair) (push pair prettify-symbols-alist))
          ,(intern (concat "bnb/prettify-" mode "-replacements")))
         (prettify-symbols-mode t))
       (add-hook
        (quote ,(intern (concat mode "-hook")))
        (function ,(intern (concat "bnb/prettify-" mode "-setup"))))))
#+end_src

