index.html

<div id="outline-container-orgcb640ef" class="outline-4">
<h4 id="orgcb640ef"><span class="section-number-4">3.7.3.</span> Better window splitting functions</h4>
<div class="outline-text-4" id="text-3-7-3">
<p>
<a href="http://www.reddit.com/r/emacs/comments/25v0eo/you_emacs_tips_and_tricks/chldury">http://www.reddit.com/r/emacs/comments/25v0eo/you_emacs_tips_and_tricks/chldury</a>
</p>

<p>
These settings split the window and load a previous buffer (instead
of the same buffer in both).  This has a better chance of being
what I want when splitting strings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/vplit-last-buffer</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"When splitting the frame, load the last visited buffer."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>split-window-vertically<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>other-window 1 nil<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>switch-to-next-buffer<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/hsplit-last-buffer</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"When splitting the frame, load the last visited buffer."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>split-window-horizontally<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>other-window 1 nil<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>switch-to-next-buffer<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-keys</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x 2"</span> . bnb/vplit-last-buffer<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-x 3"</span> . bnb/hsplit-last-buffer<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org08d2ce2" class="outline-4">
<h4 id="org08d2ce2"><span class="section-number-4">3.7.4.</span> Hide mode line</h4>
<div class="outline-text-4" id="text-3-7-4">
<p>
This is a fun one I picked from a now defunct website. This block
of code hides the mode-line for the current buffer (window).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Setup buffer-local behavior</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar-local</span> <span style="color: #eab700;">bnb/hide-mode-line-mode</span> nil<span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Setup minor mode</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">define-minor-mode</span> <span style="color: #f5871f;">bnb/hide-mode-line-mode</span>
  <span style="color: #8959a8;">"Minor mode to hide mode-line in current buffer"</span>
  <span style="color: #8959a8;">:init-value</span> nil
  <span style="color: #8959a8;">:global</span> nil
  <span style="color: #8959a8;">:variable</span> bnb/hide-mode-line-mode
  <span style="color: #8959a8;">:group</span> 'editing-basics
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">if</span> bnb/hide-mode-line-mode
      <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> bnb/hide-mode-line-mode/saved-format mode-line-format
            mode-line-format nil<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> mode-line-format bnb/hide-mode-line-mode/saved-format
          bnb/hide-mode-line-mode/saved-format nil<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>force-mode-line-update<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>redraw-display<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">when</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">and</span> <span style="color: #718c00;">(</span>called-interactively-p 'interactive<span style="color: #718c00;">)</span>
             bnb/hide-mode-line-mode<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>run-with-idle-timer
     0 nil 'message
     <span style="color: #718c00;">(</span>concat <span style="color: #3e999f;">"Goodbye mode line!"</span>
             <span style="color: #3e999f;">"Use M-x bnb/hide-mode-line-mode to make the mode-line appear"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Bind global key</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-key</span> <span style="color: #3e999f;">"H-0"</span> 'bnb/hide-mode-line-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ebe5d3" class="outline-4">
<h4 id="org2ebe5d3"><span class="section-number-4">3.7.5.</span> Open/Edit This file</h4>
<div class="outline-text-4" id="text-3-7-5">
<p>
When I hit <code>&lt;F5&gt;</code>, open this file for editing. That way, any
time I have something I need to remember for my emacs setting, it
is just a button-push away.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-key</span>
   <span style="color: #3e999f;">"&lt;f5&gt;"</span>
   <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">()</span>
     <span style="color: #718c00;">(</span><span style="color: #718c00;">interactive</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>find-file <span style="color: #3e999f;">"~/.emacs.d/bnb-emacs/Readme.org"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e7872b" class="outline-4">
<h4 id="org7e7872b"><span class="section-number-4">3.7.6.</span> Org-column resizing</h4>
<div class="outline-text-4" id="text-3-7-6">
<p>
In order to resize the face when `org-column` mode is on, some
advice is in order. The face used has a set <code>:height</code> that is not
overridden by custom face settings.
</p>

<p>
To have a custom height, this advice prepends the list with an
anonymous face with a height of 0.8. This setting happens first, so
it wins.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/org-overlay-font-override</span> <span style="color: #3e999f;">(</span>orig-fn beg end <span style="color: #4271ae;">&amp;optional</span> txt face<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>bnbface <span style="color: #4271ae;">(</span>cons '<span style="color: #4d4d4c;">(</span><span style="color: #8959a8;">:height</span> 0.8<span style="color: #4d4d4c;">)</span> face<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>funcall orig-fn beg end txt bnbface<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>advice-add 'org-columns--new-overlay <span style="color: #8959a8;">:around</span> #'bnb/org-overlay-font-override<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;</span><span style="color: #8e908c; font-style: italic;">(advice-remove 'org-columns--new-overlay #'bnb/org-overlay-font-override)</span>
</pre>
</div>
</div>
</div>
