Readme.org
*** Styled HTML Export

This is how I get the one-page html output for Github Pages. There are
two main parts to setting up and executing the export.

First, I use a =SETUPFILE= from
https://github.com/fniessen/org-html-themes. Specifically, I use the
/readtheorg/ style.

Second, I setup the emacs theme correctly for nice code output. Syntax
highlighting in the export will pull from the current theme. I don't
want this. Instead, I want to specify which theme to use for /every/
export.

The code below stores away the current list of enabled themes before
disabling them all. Then, it enables my preferred export theme
(~sanityinc-tomorrow-day~) before performing the export. Finally, it
disables the last theme and renables all of the ones on the list.

#+begin_src emacs-lisp
  (defvar bnb/export-theme '(sanityinc-tomorrow-day))
  (defun bnb/export-readme ()
    "Export the tangled org setting as html.

  `bnb/export-theme` sets the theme for the code exports."
    (interactive)
    (let ((themes custom-enabled-themes)
          (file "~/.emacs.d/bnb-emacs/Readme.org"))
      (with-temp-buffer
        (insert "#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup\n")
        (insert (format "#+include: %s\n" (file-truename file)))
        (org-mode)
        (elpaca-wait) ;; ensure all modules are loaded
        (mapc 'disable-theme themes)
        (mapc 'load-theme bnb/export-theme)
        (let ((exported (org-export-as 'html))
              (save-silently-p t))
          (with-temp-file
              (format "%sindex.html" (file-name-directory file))
            (insert exported))
          (mapc 'disable-theme bnb/export-theme)
          (mapcar 'load-theme (reverse themes))))))
#+end_src

The process is to create a temp buffer and insert the setupfile and an
include to this file. Some of the finer points are that I ensure
=org-mode= is on, themes are loaded/unloaded correctly and the export
goes to the right file.

Not all of the links I use in this file easily export. Some require
some tweaking to show up nicely on the web. This next block sets up
some handlers for the link types that need a little extra care and
attention.

#+begin_src emacs-lisp
  (defun bnb/export-tooltip (link description format)
    "Exporter for help: links"
    (let ((desc (or description link)))
      (pcase format
        ('html (format "<span class=\"tooltip\"><code>%s</code>%s</span>" desc (bnb/make-doc-tooltip desc)))
        (_ desc))))

  (defun bnb/space-to-html-entity (text)
    "Change spaces to html entities in TEXT."
    (string-replace " " "&nbsp;" text))

  (defun bnb/linebreak-to-html-entity (text)
    "Change linebreaks to html entities in TEXT."
    (string-replace "\n" "<br>" text))

  (defun bnb/html-entity-replacement (text)
    "Perform html entity conversions on TEXT."
    (bnb/linebreak-to-html-entity
     (bnb/space-to-html-entity text)))

  (defun bnb/make-doc-tooltip (element)
    "Pop out tooltip text if we have it"
    (condition-case err
        (let* ((template "<span class=\"tooltiptext\">%s</span>")
               (sym (intern element))
               (doc (if (symbolp sym)
                        (or (documentation-property sym 'variable-documentation)
                            (documentation sym))
                      "")))
          (format template (bnb/html-entity-replacement doc)))
      (error (message "Skipping Error: %s" err))))

  (defun bnb/export-help-links (link description format)
    (bnb/export-tooltip link description format))

  (defun bnb/export-org-ql-links (link description format)
    (let ((desc (or description link)))
      (pcase format
        ('html (format "<span class=\"tooltip\"><code>%s</code>%s</span>" desc "<span class=\"tooltiptext\">Org QL search links only work in Emacs.</span>"))
        (_ desc))))

  (with-eval-after-load 'org
    (org-link-set-parameters "help" :export #'bnb/export-help-links)
    (org-link-set-parameters "org-ql-search" :export #'bnb/export-org-ql-links))
#+end_src

