index.html


<div id="outline-container-org4fc60a7" class="outline-4">
<h4 id="org4fc60a7"><span class="section-number-4">3.7.7.</span> Styled HTML Export</h4>
<div class="outline-text-4" id="text-3-7-7">
<p>
This is how I get the one-page html output for Github Pages. There
are two main parts to setting up and executing the export.
</p>

<p>
First, I use a <code>SETUPFILE</code> from
<a href="https://github.com/fniessen/org-html-themes">https://github.com/fniessen/org-html-themes</a>. Specifically, I use
the <i>readtheorg</i> style.
</p>

<p>
Second, I setup the emacs theme correctly for nice code
output. Syntax highlighting in the export will pull from the
current theme. I don't want this. Instead, I want to specify which
theme to use for <i>every</i> export.
</p>

<p>
The code below stores away the current list of enabled themes
before disabling them all. Then, it enables my preferred export
theme (<code>sanityinc-tomorrow-day</code>) before performing the
export. Finally, it disables the last theme and renables all of the
ones on the list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">bnb/export-theme</span> '<span style="color: #3e999f;">(</span>sanityinc-tomorrow-day<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/export-readme</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Export the tangled org setting as html.</span>

<span style="color: #8959a8;">`bnb/export-theme` sets the theme for the code exports."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>themes custom-enabled-themes<span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span>file <span style="color: #3e999f;">"~/.emacs.d/bnb-emacs/Readme.org"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">with-temp-buffer</span>
     <span style="color: #718c00;">(</span>insert <span style="color: #3e999f;">"#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup\n"</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>insert <span style="color: #4271ae;">(</span>format <span style="color: #3e999f;">"#+include: %s\n"</span> <span style="color: #4d4d4c;">(</span>file-truename file<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>org-mode<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>elpaca-wait<span style="color: #718c00;">)</span> <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">ensure all modules are loaded</span>
     <span style="color: #718c00;">(</span>mapc 'disable-theme themes<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>mapc 'load-theme bnb/export-theme<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #718c00;">let</span> <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span>exported <span style="color: #3e999f;">(</span>org-export-as 'html<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
           <span style="color: #4d4d4c;">(</span>save-silently-p t<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
       <span style="color: #4271ae;">(</span><span style="color: #718c00;">with-temp-file</span>
           <span style="color: #4d4d4c;">(</span>format <span style="color: #3e999f;">"%sindex.html"</span> <span style="color: #3e999f;">(</span>file-name-directory file<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
         <span style="color: #4d4d4c;">(</span>insert exported<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
       <span style="color: #4271ae;">(</span>mapc 'disable-theme bnb/export-theme<span style="color: #4271ae;">)</span>
       <span style="color: #4271ae;">(</span>mapcar 'load-theme <span style="color: #4d4d4c;">(</span>reverse themes<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The process is to create a temp buffer and insert the setupfile
and an include to this file. Some of the finer points are that I
ensure <code>org-mode</code> is on, themes are loaded/unloaded correctly and
the export goes to the right file.
</p>

<p>
Not all of the links I use in this file easily export. Some
require some tweaking to show up nicely on the web. This next
block sets up some handlers for the link types that need a little
extra care and attention.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/link-fallback-export</span> <span style="color: #3e999f;">(</span>link description format _<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Exporter for help: links"</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>desc <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> description link<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">pcase</span> format
      <span style="color: #718c00;">(</span>'html <span style="color: #4271ae;">(</span>format <span style="color: #3e999f;">"&lt;code&gt;%s&lt;/code&gt;"</span> desc<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>t desc<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>org-link-set-parameters <span style="color: #3e999f;">"help"</span> <span style="color: #8959a8;">:export</span> #'bnb/link-fallback-export<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-link-set-parameters <span style="color: #3e999f;">"org-ql-search"</span> <span style="color: #8959a8;">:export</span> #'bnb/link-fallback-export<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
