Readme.org
*** Transparency

Using the =ring= package, these commands will cycles through
transparency settings.

The transparency ring variable holds cells that determing the focused
and unfocused opacity settings in terms of percentage.

#+begin_src emacs-lisp
  (use-package ring
    :ensure nil
    :commands (bnb/transparency-apply bnb/transparency-next bnb/transparency-previous
                                      bnb/transparency-cycle bnb/transparency-add)
    :config
    (setq bnb/transparency-ring
          (ring-convert-sequence-to-ring (list '(100 100) '(100 50) '(100 10) '(95 50) '(90 50) '(85 50)))
          bnb/transparency
          (ring-ref bnb/transparency-ring 0))

    (defun bnb/transparency-apply (trans)
      "Apply the TRANS alpha value to the frame."
      (set-frame-parameter (selected-frame) 'alpha (setq bnb/transparency trans)))

    (defun bnb/transparency-next ()
      "Apply the next transparency value in the ring `bnb/transparency-ring`."
      (interactive)
      (bnb/transparency-apply (ring-next bnb/transparency-ring bnb/transparency)))

    (defun bnb/transparency-previous ()
      "Apply the previous transparency value in the ring `bnb/transparency-ring`."
      (interactive)
      (bnb/transparency-apply (ring-previous bnb/transparency-ring bnb/transparency)))

    (defun bnb/transparency-cycle ()
      "Cycle to the next transparency setting."
      (interactive)
      (bnb/transparency-next))

    (defun bnb/transparency-add (active inactive)
      "Add ACTIVE and INACTIVE transparency values to the ring."
      (interactive "nActive Transparency:\nnInactive Transparency:")
      (ring-insert+extend bnb/transparency-ring (list active inactive) t)
      (bnb/transparency-apply (list active inactive))))
#+end_src

