index.html

<div id="outline-container-orga31a498" class="outline-4">
<h4 id="orga31a498"><span class="section-number-4">3.7.8.</span> Transparency</h4>
<div class="outline-text-4" id="text-3-7-8">
<p>
Using the <code>ring</code> package, these commands will cycles through
transparency settings.
</p>

<p>
The transparency ring variable holds cells that determing the
focused and unfocused opacity settings in terms of percentage.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ring</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>bnb/transparency-apply bnb/transparency-next bnb/transparency-previous
                                    bnb/transparency-cycle bnb/transparency-add<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> bnb/transparency-ring
        <span style="color: #eab700;">(</span>ring-convert-sequence-to-ring <span style="color: #718c00;">(</span>list '<span style="color: #4271ae;">(</span>100 100<span style="color: #4271ae;">)</span> '<span style="color: #4271ae;">(</span>100 50<span style="color: #4271ae;">)</span> '<span style="color: #4271ae;">(</span>100 10<span style="color: #4271ae;">)</span> '<span style="color: #4271ae;">(</span>95 50<span style="color: #4271ae;">)</span> '<span style="color: #4271ae;">(</span>90 50<span style="color: #4271ae;">)</span> '<span style="color: #4271ae;">(</span>85 50<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
        bnb/transparency
        <span style="color: #eab700;">(</span>ring-ref bnb/transparency-ring 0<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>

  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/transparency-apply</span> <span style="color: #eab700;">(</span>trans<span style="color: #eab700;">)</span>
    <span style="color: #8959a8;">"Apply the TRANS alpha value to the frame."</span>
    <span style="color: #eab700;">(</span>set-frame-parameter <span style="color: #718c00;">(</span>selected-frame<span style="color: #718c00;">)</span> 'alpha <span style="color: #718c00;">(</span><span style="color: #718c00;">setq</span> bnb/transparency trans<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>

  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/transparency-next</span> <span style="color: #eab700;">()</span>
    <span style="color: #8959a8;">"Apply the next transparency value in the ring `bnb/transparency-ring`."</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/transparency-apply <span style="color: #718c00;">(</span>ring-next bnb/transparency-ring bnb/transparency<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>

  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/transparency-previous</span> <span style="color: #eab700;">()</span>
    <span style="color: #8959a8;">"Apply the previous transparency value in the ring `bnb/transparency-ring`."</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/transparency-apply <span style="color: #718c00;">(</span>ring-previous bnb/transparency-ring bnb/transparency<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>

  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/transparency-cycle</span> <span style="color: #eab700;">()</span>
    <span style="color: #8959a8;">"Cycle to the next transparency setting."</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/transparency-next<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>

  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/transparency-add</span> <span style="color: #eab700;">(</span>active inactive<span style="color: #eab700;">)</span>
    <span style="color: #8959a8;">"Add ACTIVE and INACTIVE transparency values to the ring."</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">interactive</span> <span style="color: #3e999f;">"nActive Transparency:\nnInactive Transparency:"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>ring-insert+extend bnb/transparency-ring <span style="color: #718c00;">(</span>list active inactive<span style="color: #718c00;">)</span> t<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/transparency-apply <span style="color: #718c00;">(</span>list active inactive<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
