Readme.org
*** Weekly Score Goal in Org-Agenda

I use a scoring system to keep track of my overall progress.  This
involves scoring my tasks and attributing my idea of impact of a
particular done item.

To use these numbers, I do a weekly review on Monday and compare the
numbers to past years/weeks/etc. To keep pushing forward, this little
bit of code will insert a running status at the top of my agenda.

If I am on track for the given day (at or above the scaled goal), all
is green. Otherwise, I get a warning type formatting above 80% and
error type formatting under.

#+begin_src emacs-lisp
  ;; Define my goal to hit
  (defvar bnb/weekly-score-goal 42)

  ;; Add up all the scores from DONE items in the agenda files
  (defun bnb/agenda-score-goal ()
    "Add up scores from done items.

     In the agenda, this will show the number of done items and the
     target goal from `bnb/weekly-score-goal`."
    (let* ((score ;; Add up all scores from DONE items
            (apply '+
                   (org-map-entries
                    (lambda () (string-to-number (or (org-entry-get (point) "Score") "0")))
                    "/DONE" 'agenda)))
           (scaled-goal (* bnb/weekly-score-goal
                           (/ (string-to-number (format-time-string "%w"))
                              5.0)))
           (face (cond ((>= score scaled-goal) 'success)
                       ((>= score (* .8 scaled-goal)) 'warning)
                       (t 'error)))
           (goal-label (format "✧ Score Goal (%d): " scaled-goal))
           (goal-metric (format "%d/%d\n" score bnb/weekly-score-goal))
           (header-size (+ (string-width goal-label)
                           (string-width goal-metric)))
           (goal-separator (concat (make-string header-size ?┄) "\n")))
      (insert
       (concat
        (propertize goal-label 'face 'org-agenda-structure)
        (propertize goal-metric 'face face)
        (propertize goal-separator 'face 'org-agenda-structure)))))

  ;; This hook runs first in the agenda (and before it is set to read-only)
  (with-eval-after-load 'org
    (add-hook 'org-agenda-mode-hook 'bnb/agenda-score-goal))
#+end_src

