index.html

<div id="outline-container-orgec9233b" class="outline-4">
<h4 id="orgec9233b"><span class="section-number-4">3.7.9.</span> Weekly Score Goal in Org-Agenda</h4>
<div class="outline-text-4" id="text-3-7-9">
<p>
I use a scoring system to keep track of my overall progress.  This
involves scoring my tasks and attributing my idea of impact of a
particular done item.
</p>

<p>
To use these numbers, I do a weekly review on Monday and compare
the numbers to past years/weeks/etc. To keep pushing forward, this
little bit of code will insert a running status at the top of my
agenda.
</p>

<p>
If I am on track for the given day (at or above the scaled goal),
all is green. Otherwise, I get a warning type formatting above 80%
and error type formatting under.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Define my goal to hit</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defvar</span> <span style="color: #eab700;">bnb/weekly-score-goal</span> 42<span style="color: #4d4d4c;">)</span>

<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Add up all the scores from DONE items in the agenda files</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/agenda-score-goal</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Add up scores from done items.</span>

<span style="color: #8959a8;">   In the agenda, this will show the number of done items and the</span>
<span style="color: #8959a8;">   target goal from `bnb/weekly-score-goal`."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let*</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>score <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Add up all scores from DONE items</span>
          <span style="color: #4271ae;">(</span>apply '+
                 <span style="color: #4d4d4c;">(</span>org-map-entries
                  <span style="color: #3e999f;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #eab700;">()</span> <span style="color: #eab700;">(</span>string-to-number <span style="color: #718c00;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>org-entry-get <span style="color: #3e999f;">(</span>point<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">"Score"</span><span style="color: #4d4d4c;">)</span> <span style="color: #3e999f;">"0"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">"/DONE"</span> 'agenda<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>scaled-goal <span style="color: #4271ae;">(</span>* bnb/weekly-score-goal
                         <span style="color: #4d4d4c;">(</span>/ <span style="color: #3e999f;">(</span>string-to-number <span style="color: #eab700;">(</span>format-time-string <span style="color: #3e999f;">"%w"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
                            5.0<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>face <span style="color: #4271ae;">(</span><span style="color: #718c00;">cond</span> <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>&gt;= score scaled-goal<span style="color: #3e999f;">)</span> 'success<span style="color: #4d4d4c;">)</span>
                     <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>&gt;= score <span style="color: #eab700;">(</span>* .8 scaled-goal<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span> 'warning<span style="color: #4d4d4c;">)</span>
                     <span style="color: #4d4d4c;">(</span>t 'error<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>goal-label <span style="color: #4271ae;">(</span>format <span style="color: #3e999f;">"&#10023; Score Goal (%d): "</span> scaled-goal<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>goal-metric <span style="color: #4271ae;">(</span>format <span style="color: #3e999f;">"%d/%d\n"</span> score bnb/weekly-score-goal<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>header-size <span style="color: #4271ae;">(</span>+ <span style="color: #4d4d4c;">(</span>string-width goal-label<span style="color: #4d4d4c;">)</span>
                         <span style="color: #4d4d4c;">(</span>string-width goal-metric<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>goal-separator <span style="color: #4271ae;">(</span>concat <span style="color: #4d4d4c;">(</span>make-string header-size ?&#9476;<span style="color: #4d4d4c;">)</span> <span style="color: #3e999f;">"\n"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>insert
     <span style="color: #718c00;">(</span>concat
      <span style="color: #4271ae;">(</span>propertize goal-label 'face 'org-agenda-structure<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>propertize goal-metric 'face face<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>propertize goal-separator 'face 'org-agenda-structure<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">This hook runs first in the agenda (and before it is set to read-only)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-hook 'org-agenda-mode-hook 'bnb/agenda-score-goal<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
