Readme.org
*** Weekly Time Reporting

This is a function to create an entry like a datetree, but using
years and workweeks instead.

#+begin_src emacs-lisp
  (defun bnb/find-year-create (year)
    "Find or create a [YEAR] in an Org journal."
    (let ((re "^\\**[ \t]+\\([12][0-9]\\{3\\}\\)")
          match)
      (org-narrow-to-subtree)
      (goto-char (point-min))
      (while (and (setq match (re-search-forward re nil t))
                  (goto-char (match-beginning 1))
                  (< (string-to-number (match-string 1)) year)))
      (cond
       ((not match)
        (goto-char (point-max))
        (or (bolp) (newline))
        (insert (format  "** %s\n" year)))
       ((= (string-to-number (match-string 1)) year)
        (goto-char (point-at-bol)))
       (t
        (beginning-of-line 1)
        (insert (format  "** %s\n" year))))))

  (defun bnb/find-ww-create (ww)
    "Find or create a [WW] (workweek) in an Org journal."
    (let ((re "^\\**[ \t]+\\WW\\([0-9]\\{2\\}\\)")
          match)
      (org-narrow-to-subtree)
      (goto-char (point-min))
      (while (and (setq match (re-search-forward re nil t))
                  (goto-char (match-beginning 1))
                  (< (string-to-number (match-string 1)) ww)))
      (cond
       ((not match)
        (goto-char (point-max))
        (or (bolp) (newline))
        (insert (format "*** WW%02d\n" ww)))
       ((= (string-to-number (match-string 1)) ww)
        (goto-char (point-at-bol)))
       (t
        (beginning-of-line 1)
        (insert (format "*** WW%02d\n" ww))))))

  (defun bnb/insert-weekly-time-sheet ()
    "Generated and insert a weekly time sheet generated from the default Org Agenda."
    (with-temp-buffer
      (insert
       (concat  "#+BEGIN: clocktable :maxlevel 3 :scope agenda-with-archives :block lastweek :fileskip0 t :properties (\"Score\") :indent nil \n"
                "#+TBLFM: $6='(org-clock-time% @2$4 $3..$5);%.1f::@2$2=vsum(@3$2..@>$2)\n"
                "#+END:\n\n"))
      (goto-char (point-min))
      (org-update-dblock)
      (buffer-substring (point-min) (point-max))))

  (defun bnb/insert-weekly-clocking ()
    "Insert the weekly clocking clocking data."
    (let ((year (number-to-string (nth 2 (calendar-gregorian-from-absolute (org-today)))))
          (ww (bnb/workweek)))
      (goto-char (point-min))
      (goto-char (cdr (org-id-find "clocking")))
      (bnb/find-year-create (string-to-number year))
      (bnb/find-ww-create ww)))
#+end_src

