index.html

<div id="outline-container-org9abaee4" class="outline-4">
<h4 id="org9abaee4"><span class="section-number-4">3.7.10.</span> Weekly Time Reporting</h4>
<div class="outline-text-4" id="text-3-7-10">
<p>
This is a function to create an entry like a datetree, but using
years and workweeks instead.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/find-year-create</span> <span style="color: #3e999f;">(</span>year<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Find or create a [YEAR] in an Org journal."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>re <span style="color: #3e999f;">"^\\**[ \t]+</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">[12][0-9]\\{</span><span style="color: #eab700;">3\\</span><span style="color: #3e999f;">}</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">"</span><span style="color: #718c00;">)</span>
        match<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>org-narrow-to-subtree<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>goto-char <span style="color: #718c00;">(</span>point-min<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">while</span> <span style="color: #718c00;">(</span><span style="color: #718c00;">and</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">setq</span> match <span style="color: #4d4d4c;">(</span>re-search-forward re nil t<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
                <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>match-beginning 1<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
                <span style="color: #4271ae;">(</span>&lt; <span style="color: #4d4d4c;">(</span>string-to-number <span style="color: #3e999f;">(</span>match-string 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span> year<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">cond</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>not match<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>point-max<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>bolp<span style="color: #4d4d4c;">)</span> <span style="color: #4d4d4c;">(</span>newline<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>insert <span style="color: #4d4d4c;">(</span>format  <span style="color: #3e999f;">"** %s\n"</span> year<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>= <span style="color: #4d4d4c;">(</span>string-to-number <span style="color: #3e999f;">(</span>match-string 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span> year<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>point-at-bol<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>t
      <span style="color: #4271ae;">(</span>beginning-of-line 1<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>insert <span style="color: #4d4d4c;">(</span>format  <span style="color: #3e999f;">"** %s\n"</span> year<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/find-ww-create</span> <span style="color: #3e999f;">(</span>ww<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Find or create a [WW] (workweek) in an Org journal."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>re <span style="color: #3e999f;">"^\\**[ \t]+\\WW</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">[0-9]\\{</span><span style="color: #eab700;">2\\</span><span style="color: #3e999f;">}</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">"</span><span style="color: #718c00;">)</span>
        match<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>org-narrow-to-subtree<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>goto-char <span style="color: #718c00;">(</span>point-min<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">while</span> <span style="color: #718c00;">(</span><span style="color: #718c00;">and</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">setq</span> match <span style="color: #4d4d4c;">(</span>re-search-forward re nil t<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
                <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>match-beginning 1<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
                <span style="color: #4271ae;">(</span>&lt; <span style="color: #4d4d4c;">(</span>string-to-number <span style="color: #3e999f;">(</span>match-string 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span> ww<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">cond</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>not match<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>point-max<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>bolp<span style="color: #4d4d4c;">)</span> <span style="color: #4d4d4c;">(</span>newline<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>insert <span style="color: #4d4d4c;">(</span>format <span style="color: #3e999f;">"*** WW%02d\n"</span> ww<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>= <span style="color: #4d4d4c;">(</span>string-to-number <span style="color: #3e999f;">(</span>match-string 1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span> ww<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>goto-char <span style="color: #4d4d4c;">(</span>point-at-bol<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>t
      <span style="color: #4271ae;">(</span>beginning-of-line 1<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>insert <span style="color: #4d4d4c;">(</span>format <span style="color: #3e999f;">"*** WW%02d\n"</span> ww<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/insert-weekly-time-sheet</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Generated and insert a weekly time sheet generated from the default Org Agenda."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">with-temp-buffer</span>
    <span style="color: #eab700;">(</span>insert
     <span style="color: #718c00;">(</span>concat  <span style="color: #3e999f;">"#+BEGIN: clocktable :maxlevel 3 :scope agenda-with-archives :block lastweek :fileskip0 t :properties (\"Score\") :indent nil \n"</span>
              <span style="color: #3e999f;">"#+TBLFM: $6='(org-clock-time% @2$4 $3..$5);%.1f::@2$2=vsum(@3$2..@&gt;$2)\n"</span>
              <span style="color: #3e999f;">"#+END:\n\n"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>goto-char <span style="color: #718c00;">(</span>point-min<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>org-update-dblock<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>buffer-substring <span style="color: #718c00;">(</span>point-min<span style="color: #718c00;">)</span> <span style="color: #718c00;">(</span>point-max<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/insert-weekly-clocking</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Insert the weekly clocking clocking data."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>year <span style="color: #4271ae;">(</span>number-to-string <span style="color: #4d4d4c;">(</span>nth 2 <span style="color: #3e999f;">(</span>calendar-gregorian-from-absolute <span style="color: #eab700;">(</span>org-today<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span>ww <span style="color: #4271ae;">(</span>bnb/workweek<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>goto-char <span style="color: #718c00;">(</span>point-min<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>goto-char <span style="color: #718c00;">(</span>cdr <span style="color: #4271ae;">(</span>org-id-find <span style="color: #3e999f;">"clocking"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/find-year-create <span style="color: #718c00;">(</span>string-to-number year<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>bnb/find-ww-create ww<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
