Readme.org
*** Workweeks

This is vestigal content from my Intel days and this generates
their idea of a work week number.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (progn
     (defun bnb/workweek ()
       "Return the current workweek number."
       (interactive)
       (string-to-number
        (format-time-string "%W" (current-time))))

     (defun bnb/workweek-string ()
       "Convert the current workweek into a string.

      The string is of the format WW##."
       (interactive)
       (concat "WW"
               (number-to-string
                (bnb/workweek))))

     (require 'calendar)
     (defun bnb/workweek-from-gregorian (&optional date)
       "Calculate the workweek from the Gregorian calendar."
       (let* ((date (or date (calendar-current-date)))
              (year (calendar-extract-year date))
              (fst (calendar-day-of-week (list 1 1 year)))
              (x   (if (>= fst 4)1 0)))
         (+ x
            (car
             (calendar-iso-from-absolute
              (calendar-absolute-from-gregorian date))))))

     (setq calendar-week-start-day 1
           calendar-intermonth-text
           '(propertize
             (format "%2d"
                     (bnb/workweek-from-gregorian (list month day year)))
             'font-lock-face 'font-lock-function-name-face))))
#+end_src

** Editing

Similar to movement, editing happens /every day/, so I use a few
customizations to make it nice.

*** Ediff Window Setup

I really dislike the multi-frame mode of =ediff=.  It is confusing to
use and really messes up my [[http://dwm.suckless.org][dwm]] usage. By explicitly setting the
following setting, it forces =ediff= to use only one frame.

#+begin_src emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain
        ediff-diff-options "-w"
        ediff-split-window-function 'split-window-horizontally)
#+end_src

Now the control window will be a small window instead of a separate
frame.

