index.html

<div id="outline-container-org021d4b4" class="outline-4">
<h4 id="org021d4b4"><span class="section-number-4">3.7.11.</span> Workweeks</h4>
<div class="outline-text-4" id="text-3-7-11">
<p>
This is vestigal content from my Intel days and this generates
their idea of a work week number.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">progn</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/workweek</span> <span style="color: #718c00;">()</span>
      <span style="color: #8959a8;">"Return the current workweek number."</span>
      <span style="color: #718c00;">(</span><span style="color: #718c00;">interactive</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span><span style="color: #718c00;">let*</span> <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span>now <span style="color: #3e999f;">(</span>current-time<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>weeks <span style="color: #3e999f;">(</span>string-to-number
                     <span style="color: #eab700;">(</span>format-time-string <span style="color: #3e999f;">"%W"</span> now<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>days <span style="color: #3e999f;">(</span>time-to-day-in-year now<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>daynum <span style="color: #3e999f;">(</span>string-to-number
                      <span style="color: #eab700;">(</span>format-time-string <span style="color: #3e999f;">"%w"</span> now<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>left <span style="color: #3e999f;">(</span>% days 7<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
        <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">and</span> <span style="color: #3e999f;">(</span>= 0 daynum<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>= left 0<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
            weeks
          <span style="color: #4d4d4c;">(</span>+ 1 weeks<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>

    <span style="color: #eab700;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/workweek-string</span> <span style="color: #718c00;">()</span>
      <span style="color: #8959a8;">"Convert the current workweek into a string.</span>

<span style="color: #8959a8;">    The string is of the format WW##."</span>
      <span style="color: #718c00;">(</span><span style="color: #718c00;">interactive</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>concat <span style="color: #3e999f;">"WW"</span>
              <span style="color: #4271ae;">(</span>number-to-string
               <span style="color: #4d4d4c;">(</span>bnb/workweek<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>

    <span style="color: #eab700;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">calendar</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/workweek-from-gregorian</span> <span style="color: #718c00;">(</span><span style="color: #4271ae;">&amp;optional</span> date<span style="color: #718c00;">)</span>
      <span style="color: #8959a8;">"Calculate the workweek from the Gregorian calendar."</span>
      <span style="color: #718c00;">(</span><span style="color: #718c00;">let*</span> <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span>date <span style="color: #3e999f;">(</span><span style="color: #718c00;">or</span> date <span style="color: #eab700;">(</span>calendar-current-date<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>year <span style="color: #3e999f;">(</span>calendar-extract-year date<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>fst <span style="color: #3e999f;">(</span>calendar-day-of-week <span style="color: #eab700;">(</span>list 1 1 year<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
             <span style="color: #4d4d4c;">(</span>x   <span style="color: #3e999f;">(</span><span style="color: #718c00;">if</span> <span style="color: #eab700;">(</span>&gt;= fst 4<span style="color: #eab700;">)</span>1 0<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
        <span style="color: #4271ae;">(</span>+ x
           <span style="color: #4d4d4c;">(</span>car
            <span style="color: #3e999f;">(</span>calendar-iso-from-absolute
             <span style="color: #eab700;">(</span>calendar-absolute-from-gregorian date<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>

    <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> calendar-week-start-day 1
          calendar-intermonth-text
          '<span style="color: #718c00;">(</span>propertize
            <span style="color: #4271ae;">(</span>format <span style="color: #3e999f;">"%2d"</span>
                    <span style="color: #4d4d4c;">(</span>bnb/workweek-from-gregorian <span style="color: #3e999f;">(</span>list month day year<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
            'font-lock-face 'font-lock-function-name-face<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4b569fc" class="outline-3">
<h3 id="org4b569fc"><span class="section-number-3">3.8.</span> Editing</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Similar to movement, editing happens <i>every day</i>, so I use a few
customizations to make it nice.
</p>
</div>

<div id="outline-container-org4309660" class="outline-4">
<h4 id="org4309660"><span class="section-number-4">3.8.1.</span> Ediff single frame</h4>
<div class="outline-text-4" id="text-3-8-1">
<p>
I really dislike the multi-frame mode of <code>ediff</code>.  It is confusing
to use and really messes up my <a href="http://dwm.suckless.org">dwm</a> usage. By explicitly setting
the following setting, it forces <code>ediff</code> to use only one
frame.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Now the control window will be a small window instead of a
separate frame.
</p>
</div>
</div>
