Readme.org
*** Helpful

Using [[https://github.com/Wilfred/helpful][Helpful]] enables a better help buffer by providing a more
organized screen with contextual information and linked references.

#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :bind
    ("C-h K" . helpful-key)
    ("C-h v" . helpful-variable)
    ("C-h f" . helpful-function)
    ("C-h x" . helpful-command)
    ("C-h z" . helpful-macro)
    ("C-h ." . helpful-at-point))
#+end_src

*** Which Key

This [[https://github.com/justbur/emacs-which-key][helpful little package]] makes it easy to remember emacs prefixed
commands.  Start typing a prefix such as =C-x= after a brief delay, the
options for any following commands are shown.

I am using a setup that tries the right side of emacs first, and punts
to a bottom window if there is not enough room.

#+begin_src emacs-lisp
  (use-package which-key
    :defer t
    :ensure t
    :delight which-key-mode
    :init
    (which-key-mode)
    (which-key-setup-side-window-right-bottom)
    :custom
    (which-key-max-description-length 60))
#+end_src

*** Dictionary

To use the online dictionary at [[https://dict.org][dict.org]], set =dictionary-server=
accordingly. Then swap around keybindinds such that this is an easy
deafult, but the OSX version isn't far away.

One of the cooler features of this mode is that the [[https://dict.org][dict.org]] server
has [[https://www.websters1913.com/][Webster's 1913]] dictionary.

#+begin_src emacs-lisp
  (use-package dictionary
    :init
    (setq dictionary-server "dict.org")
    :bind (("C-c d d" . dictionary-search)))
#+end_src

*** OSX Dictionary

Search ~Dictionary.app~ from the comfort of an Emacs buffer.

#+begin_src emacs-lisp
  (use-package osx-dictionary
    :ensure t
    :bind
    ("C-c d x" . osx-dictionary-search-word-at-point)
    ("C-c d i" . osx-dictionary-search-input))
#+end_src

** Editing

This section covers minor modes that personalize and improve the
editing experience.

*** Adaptive Fill                                                   :PENDING:

Update: Turning this off for now to see if I really use it for just
text modes.

Try to keep any prefixed elements of the first line for paragraph
filling.

#+begin_src emacs-lisp
  (use-package filladapt
    :delight " ▦"
    :disabled t
    :ensure t
    :commands filladapt-mode
    :init (setq-default filladapt-mode t)
    :hook ((text-mode . filladapt-mode)
           (org-mode . turn-off-filladapt-mode)
           (prog-mode . turn-off-filladapt-mode)))
#+end_src

*** Focus Mode

Dim everything except for the thing-at-point. Improves focus when
reading code and text.

#+begin_src emacs-lisp
  (use-package focus
    :ensure t
    :bind
    ("C-c f" . focus-mode)
    ("C-c F" . focus-read-only-mode))
#+end_src

*** Common User Access mode

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/CUA-Bindings.html][CUA]] has a primary feature of enabling cut, copy, paste and undo
shortcuts compatible with most applications, but I leave that part
disabled and prefer the normal emacs bindings.

What I do enjoy about CUA are the rectangle restures and *that* is why I
enable it.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (progn
     (cua-mode t)
     (setq cua-enable-cua-keys nil)))
#+end_src

There are two main binding types: [[CUA Rectangles]] and [[CUA Global Mark]].

