index.html

<div id="outline-container-org85dbd4a" class="outline-4">
<h4 id="org85dbd4a"><span class="section-number-4">4.1.1.</span> Helpful</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Using <a href="https://github.com/Wilfred/helpful">Helpful</a> enables a better help buffer by providing a more
organized screen with contextual information and linked
references.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">helpful</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h K"</span> . helpful-key<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h v"</span> . helpful-variable<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h f"</span> . helpful-function<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h x"</span> . helpful-command<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h z"</span> . helpful-macro<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-h ."</span> . helpful-at-point<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge59c991" class="outline-4">
<h4 id="orge59c991"><span class="section-number-4">4.1.2.</span> Which Key</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
This <a href="https://github.com/justbur/emacs-which-key">helpful little package</a> makes it easy to remember emacs
prefixed commands.  Start typing a prefix such as <code>C-x</code> after a brief
delay, the options for any following commands are shown.
</p>

<p>
I am using a setup that tries the right side of emacs first, and
punts to a bottom window if there is not enough room.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">which-key</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:delight</span> which-key-mode
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>which-key-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>which-key-setup-side-window-right-bottom<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>which-key-max-description-length 60<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org155aee4" class="outline-4">
<h4 id="org155aee4"><span class="section-number-4">4.1.3.</span> Dictionary</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
To use the online dictionary at <a href="https://dict.org">dict.org</a>, set <code>dictionary-server</code>
accordingly. Then swap around keybindinds such that this is an easy
deafult, but the OSX version isn't far away.
</p>

<p>
One of the cooler features of this mode is that the <a href="https://dict.org">dict.org</a> server
has <a href="https://www.websters1913.com/">Webster's 1913</a> dictionary.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">dictionary</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> dictionary-server <span style="color: #3e999f;">"dict.org"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c d"</span> . dictionary-search<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c D"</span> . osx-dictionary-search-word-at-point<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecb22e6" class="outline-4">
<h4 id="orgecb22e6"><span class="section-number-4">4.1.4.</span> OSX Dictionary</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Search <code>Dictionary.app</code> from the comfort of an Emacs buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">osx-dictionary</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c d"</span> . osx-dictionary-search-word-at-point<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c i"</span> . osx-dictionary-search-input<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdbe9069" class="outline-3">
<h3 id="orgdbe9069"><span class="section-number-3">4.2.</span> Editing</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This section covers minor modes that personalize and improve the
editing experience.
</p>
</div>

<div id="outline-container-org8d8936b" class="outline-4">
<h4 id="org8d8936b"><span class="section-number-4">4.2.1.</span> Adaptive Fill&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Update: Turning this off for now to see if I really use it for
just text modes.
</p>

<p>
Try to keep any prefixed elements of the first line for paragraph
filling.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">filladapt</span>
  <span style="color: #8959a8;">:delight</span> <span style="color: #3e999f;">"&#8201;&#9638;"</span>
  <span style="color: #8959a8;">:disabled</span> t
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> filladapt-mode
  <span style="color: #8959a8;">:init</span> <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> filladapt-mode t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>text-mode . filladapt-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>org-mode . turn-off-filladapt-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>prog-mode . turn-off-filladapt-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org33f0108" class="outline-4">
<h4 id="org33f0108"><span class="section-number-4">4.2.2.</span> Focus Mode</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Dim everything except for the thing-at-point. Improves focus when
reading code and text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">focus</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c f"</span> . focus-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c F"</span> . focus-read-only-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fa52a0" class="outline-4">
<h4 id="org8fa52a0"><span class="section-number-4">4.2.3.</span> Common User Access mode</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/CUA-Bindings.html">CUA</a> has a primary feature of enabling cut, copy, paste and undo
shortcuts compatible with most applications, but I leave that part
disabled and prefer the normal emacs bindings.
</p>

<p>
What I do enjoy about CUA are the rectangle restures and <b>that</b> is
why I enable it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">progn</span>
    <span style="color: #eab700;">(</span>cua-mode t<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> cua-enable-cua-keys nil<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
There are two main binding types: <a href="#org3e51095">4.2.3.0.1</a> and <a href="#org2cd4d18">4.2.3.0.2</a>.
</p>
</div>

<ol class="org-ol">
