Readme.org
***** CUA Rectangles

These take place with an active rectangle. To start/cancel a rectangle
use =C-RET=.

| Keys          | Function                                                              |
|---------------+-----------------------------------------------------------------------|
| =M-<arrow>=     | Move rectangle overlay                                                |
| =C-<SPACE>=     | Activate region bounded by rectangle                                  |
|---------------+-----------------------------------------------------------------------|
| =M-a=           | Align all words at the left edge                                      |
| =M-b=           | Fill rectangle with blanks (tabs and spaces)                          |
| =M-c=           | Closes the rectangle by removing left edge blanks                     |
| =M-f=           | Fills the rectangle with a single character (prompt)                  |
| =M-i=           | Increases number found on each line of rectangle                      |
| =M-k=           | Kills the rectangle as normal multi-line kill                         |
| =M-l=           | Downcases the rectangle                                               |
| =M-m=           | Copies the rectangle for normal multi-line paste                      |
| =M-n=           | Fills each line with increasing numbers (prompt)                      |
| =M-o=           | Opens the rect by moving hilighted text right and filling with blanks |
| =M-p=           | Toggles virtual straight rectangle edges                              |
| =M-P=           | Inserts tabs and spaces to make real straight edges                   |
| =M-q=           | Performs text filling on the rectangle                                |
| =M-q=           | Performs text filling on the rectangle                                |
| =M-r=           | Replaces REGEXP (prompt) by STRING (prompt) in rectangle              |
| =M-R=           | Reverse the lines in the rectangle                                    |
| =M-s=           | Fills each line of the rectangle with the same STRING (prompt)        |
| =M-t=           | Performs text fill of the rectangle with TEXT (prompt)                |
| =M-u=           | Upcases the rectangle                                                 |
| =M-<VBar>=      | Runs shell command on rectangle                                       |
| =M-'=           | Restricts rectangle to lines with CHAR (prompt) at left column        |
| =M-/=           | Restricts rectangle to lines matching REGEXP (prompt)                 |
| =C-?=           | Shows a brief list of the above commands.                             |
|---------------+-----------------------------------------------------------------------|
| =M-C-<UP/DOWN>= | Scrolls the lines INSIDE the rectangle up/down                        |

***** CUA Global Mark

The global mark feature enables a target the receives any
typed/copied/killed text from any buffer (even the current one).

| Key           | function                                                                                                            |
|---------------+---------------------------------------------------------------------------------------------------------------------|
| =<ch>=          | All characters (including newlines) you type are inserted at the global mark!                                       |
| =C-x=           | If you cut a region or rectangle, it is automatically inserted at the global mark, and the global mark is advanced. |
| =C-c=           | If you copy a region or rectangle, it is immediately inserted  at the global mark, and the global mark is advanced. |
| =C-v=           | Copies a single character to the global mark.                                                                       |
| =C-d=           | Moves (i.e. deletes and inserts) a single character to the global mark.                                             |
| =<BACKSPACE>=   | deletes the character before the global mark                                                                        |
| =<DELETE>=      | deletes the character after the global mark.                                                                        |
|---------------+---------------------------------------------------------------------------------------------------------------------|
| =S-C-space=     | Jumps to and cancels the global mark.                                                                               |
| =C-u S-C-space= | Cancels the global mark (stays in current buffer).                                                                  |
|---------------+---------------------------------------------------------------------------------------------------------------------|
| =<TAB>=         | Indents the current line or rectangle to the column of the global mark.                                             |

*** Easy Kill

While looking for a way to store the filename in the clipboard, I ran
across [[https://github.com/leoliu/easy-kill][easy-kill]]. Not only will it grab the filename, but provides
ways to grab all sorts of fun things.

#+begin_src emacs-lisp
  (use-package easy-kill
    :bind ("M-w" . easy-kill)
    :ensure t)
#+end_src

The way the binding works is as a prefix key that also tries a default
"kill" and replaces [[help:kill-ring-save][kill-ring-save]]. The thing at point is saved to the
kill ring. The following table shows the details.

| Key   | Saves at point                        |
|-------+---------------------------------------|
| =M-w w= | word                                  |
| =M-w s= | sexp                                  |
| =M-w l= | list                                  |
| =M-w d= | defun                                 |
| =M-w D= | defun name                            |
| =M-w f= | filename                              |
| =M-w b= | buffer file name or default directory |

There are also modifiers to treat how the saved text is handled.

| Modifier   | Effect                            |
|------------+-----------------------------------|
| =@=          | append to previous kill           |
| =C-w=        | kill selection                    |
| =+=, =-=, =1..9= | expand/shrink selection           |
| =0=          | shrink selection to initial size  |
| =<SPC>=      | cycle through =easy-kill-alist=     |
| =C-<SPC>=    | turn selection into active region |
| =C-g=        | abort                             |
| =?=          | help                              |

