index.html
<li><a id="org3e51095"></a>CUA Rectangles<br />
<div class="outline-text-6" id="text-4-2-3-0-1">
<p>
These take place with an active rectangle. To start/cancel a
rectangle use <code>C-RET</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keys</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-&lt;arrow&gt;</code></td>
<td class="org-left">Move rectangle overlay</td>
</tr>

<tr>
<td class="org-left"><code>C-&lt;SPACE&gt;</code></td>
<td class="org-left">Activate region bounded by rectangle</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-a</code></td>
<td class="org-left">Align all words at the left edge</td>
</tr>

<tr>
<td class="org-left"><code>M-b</code></td>
<td class="org-left">Fill rectangle with blanks (tabs and spaces)</td>
</tr>

<tr>
<td class="org-left"><code>M-c</code></td>
<td class="org-left">Closes the rectangle by removing left edge blanks</td>
</tr>

<tr>
<td class="org-left"><code>M-f</code></td>
<td class="org-left">Fills the rectangle with a single character (prompt)</td>
</tr>

<tr>
<td class="org-left"><code>M-i</code></td>
<td class="org-left">Increases number found on each line of rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-k</code></td>
<td class="org-left">Kills the rectangle as normal multi-line kill</td>
</tr>

<tr>
<td class="org-left"><code>M-l</code></td>
<td class="org-left">Downcases the rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-m</code></td>
<td class="org-left">Copies the rectangle for normal multi-line paste</td>
</tr>

<tr>
<td class="org-left"><code>M-n</code></td>
<td class="org-left">Fills each line with increasing numbers (prompt)</td>
</tr>

<tr>
<td class="org-left"><code>M-o</code></td>
<td class="org-left">Opens the rect by moving hilighted text right and filling with blanks</td>
</tr>

<tr>
<td class="org-left"><code>M-p</code></td>
<td class="org-left">Toggles virtual straight rectangle edges</td>
</tr>

<tr>
<td class="org-left"><code>M-P</code></td>
<td class="org-left">Inserts tabs and spaces to make real straight edges</td>
</tr>

<tr>
<td class="org-left"><code>M-q</code></td>
<td class="org-left">Performs text filling on the rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-q</code></td>
<td class="org-left">Performs text filling on the rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-r</code></td>
<td class="org-left">Replaces REGEXP (prompt) by STRING (prompt) in rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-R</code></td>
<td class="org-left">Reverse the lines in the rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-s</code></td>
<td class="org-left">Fills each line of the rectangle with the same STRING (prompt)</td>
</tr>

<tr>
<td class="org-left"><code>M-t</code></td>
<td class="org-left">Performs text fill of the rectangle with TEXT (prompt)</td>
</tr>

<tr>
<td class="org-left"><code>M-u</code></td>
<td class="org-left">Upcases the rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;VBar&gt;</code></td>
<td class="org-left">Runs shell command on rectangle</td>
</tr>

<tr>
<td class="org-left"><code>M-'</code></td>
<td class="org-left">Restricts rectangle to lines with CHAR (prompt) at left column</td>
</tr>

<tr>
<td class="org-left"><code>M-/</code></td>
<td class="org-left">Restricts rectangle to lines matching REGEXP (prompt)</td>
</tr>

<tr>
<td class="org-left"><code>C-?</code></td>
<td class="org-left">Shows a brief list of the above commands.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-C-&lt;UP/DOWN&gt;</code></td>
<td class="org-left">Scrolls the lines INSIDE the rectangle up/down</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org2cd4d18"></a>CUA Global Mark<br />
<div class="outline-text-6" id="text-4-2-3-0-2">
<p>
The global mark feature enables a target the receives any
typed/copied/killed text from any buffer (even the current
one).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;ch&gt;</code></td>
<td class="org-left">All characters (including newlines) you type are inserted at the global mark!</td>
</tr>

<tr>
<td class="org-left"><code>C-x</code></td>
<td class="org-left">If you cut a region or rectangle, it is automatically inserted at the global mark, and the global mark is advanced.</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code></td>
<td class="org-left">If you copy a region or rectangle, it is immediately inserted  at the global mark, and the global mark is advanced.</td>
</tr>

<tr>
<td class="org-left"><code>C-v</code></td>
<td class="org-left">Copies a single character to the global mark.</td>
</tr>

<tr>
<td class="org-left"><code>C-d</code></td>
<td class="org-left">Moves (i.e. deletes and inserts) a single character to the global mark.</td>
</tr>

<tr>
<td class="org-left"><code>&lt;BACKSPACE&gt;</code></td>
<td class="org-left">deletes the character before the global mark</td>
</tr>

<tr>
<td class="org-left"><code>&lt;DELETE&gt;</code></td>
<td class="org-left">deletes the character after the global mark.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>S-C-space</code></td>
<td class="org-left">Jumps to and cancels the global mark.</td>
</tr>

<tr>
<td class="org-left"><code>C-u S-C-space</code></td>
<td class="org-left">Cancels the global mark (stays in current buffer).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;TAB&gt;</code></td>
<td class="org-left">Indents the current line or rectangle to the column of the global mark.</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf96ac0b" class="outline-4">
<h4 id="orgf96ac0b"><span class="section-number-4">4.2.4.</span> Easy Kill</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
While looking for a way to store the filename in the clipboard, I
ran across <a href="https://github.com/leoliu/easy-kill">easy-kill</a>. Not only will it grab the filename, but
provides ways to grab all sorts of fun things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">easy-kill</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"M-w"</span> . easy-kill<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The way the binding works is as a prefix key that also tries a
default "kill" and replaces <code>kill-ring-save</code>. The thing at point is
saved to the kill ring. The following table shows the details.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Saves at point</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-w w</code></td>
<td class="org-left">word</td>
</tr>

<tr>
<td class="org-left"><code>M-w s</code></td>
<td class="org-left">sexp</td>
</tr>

<tr>
<td class="org-left"><code>M-w l</code></td>
<td class="org-left">list</td>
</tr>

<tr>
<td class="org-left"><code>M-w d</code></td>
<td class="org-left">defun</td>
</tr>

<tr>
<td class="org-left"><code>M-w D</code></td>
<td class="org-left">defun name</td>
</tr>

<tr>
<td class="org-left"><code>M-w f</code></td>
<td class="org-left">filename</td>
</tr>

<tr>
<td class="org-left"><code>M-w b</code></td>
<td class="org-left">buffer file name or default directory</td>
</tr>
</tbody>
</table>

<p>
There are also modifiers to treat how the saved text is handled.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modifier</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>@</code></td>
<td class="org-left">append to previous kill</td>
</tr>

<tr>
<td class="org-left"><code>C-w</code></td>
<td class="org-left">kill selection</td>
</tr>

<tr>
<td class="org-left"><code>+</code>, <code>-</code>, <code>1..9</code></td>
<td class="org-left">expand/shrink selection</td>
</tr>

<tr>
<td class="org-left"><code>0</code></td>
<td class="org-left">shrink selection to initial size</td>
</tr>

<tr>
<td class="org-left"><code>&lt;SPC&gt;</code></td>
<td class="org-left">cycle through <code>easy-kill-alist</code></td>
</tr>

<tr>
<td class="org-left"><code>C-&lt;SPC&gt;</code></td>
<td class="org-left">turn selection into active region</td>
</tr>

<tr>
<td class="org-left"><code>C-g</code></td>
<td class="org-left">abort</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">help</td>
</tr>
</tbody>
</table>
</div>
</div>
