Readme.org
*** Vundo                                                           :PENDING:

I like to have undo navigation. [[https://github.com/casouri/vundo][Vundo]] gives a nice mini interface
(git-style) to move around undo history.

#+begin_src emacs-lisp
  (use-package vundo
    :bind
    ("C-x u" . vundo)
    :custom
    (vundo-glyph-alist vundo-unicode-symbols))
#+end_src

When in the undo mode, some keys help with navigation.

| Key | Effect                               |
|-----+--------------------------------------|
| =f=   | go forward                           |
| =b=   | go backward                          |
|-----+--------------------------------------|
| =n=   | go to the node below at branch point |
| =p=   | go to the node above                 |
|-----+--------------------------------------|
| =a=   | go back to last branch               |
| =e=   | go to the end of the branch          |
| =l=   | go to last saved node                |
| =r=   | go to next saved node                |
|-----+--------------------------------------|
| =m=   | mark current node for diff           |
| =u=   | unmark marked node                   |
| =d=   | show a diff                          |
|-----+--------------------------------------|
| =q=   | quit (=C-g= also works)                |


*** Expand Region

Easily one of my favorite packages, this is a nice way to expand
selections to semantic regions. Read more on
[[https://github.com/magnars/expand-region.el]].

#+begin_src emacs-lisp
      (use-package expand-region
        :ensure t
        :bind ("C-=" . er/expand-region))
#+end_src

*** Citar (Bibtex completions)

For getting completions from bibliographic data, [[https://github.com/emacs-citar/citar][Citar]] links things
together.

#+begin_src emacs-lisp
  (use-package citar
    :commands (citar-capf-setup)
    :ensure t
    :bind
    (:map org-mode-map ("C-c b" . #'org-cite-insert))
    :custom
    (citar-bibliography bnb/biblio)
    (org-cite-global-bibliography bnb/biblio)
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    :hook
    (LaTeX-mode . citar-capf-setup)
    (org-mode . citar-capf-setup))

  (use-package citar-embark
    :ensure t
    :after (citar embark)
    :no-require
    :config (citar-embark-mode)
    :custom
    (citar-at-point-function 'embark-act))

  (use-package citar-org-roam
    :ensure t
    :after (citar org-roam)
    :config
    (add-to-list 'org-roam-capture-templates
                 '("n" "Literature note" plain
                   "%?"
                   :target
                   (file+head
                    "%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/${citar-citekey}.org"
                    "#+title: ${citar-citekey} (${citar-date}). ${note-title}.\n#+created: %U\n#+last_modified: %U\n\n")
                   :unnarrowed t))
    (citar-org-roam-mode))
#+end_src

*** Tree Sitter

Introduced in emacs 29, [[https://tree-sitter.github.io/tree-sitter/][tree sitter]] transforms code into a concrete
syntax tree.  [[https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][Read up on how to get started with tree-sitter]]

**** Treesit Auto

Automatically install treesit grammars

#+begin_src emacs-lisp
  (use-package treesit-auto
    :defer t
    :ensure t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src

** Version Control

Emacs is fantastic for interfacing with version control systems. For
git, it may have the best interface.

*** Magit

[[https://magit.vc/manual/magit.html][Magit]] is a git interface for Emacs.

Here I set a global key for ~magit-status~. Think 'G' looks like 6.

#+begin_src emacs-lisp
  (use-package transient)

  (use-package magit
    :ensure t
    :after transient
    :bind ("<f6>" . magit-status)
    :custom
    (magit-last-seen-setup-instructions "1.4.0"))
#+END_SRC

**** Release 1.4.0

This magit release warns about auto-revert of buffers.  This is turned
on by default and I will keep that setting.  To turn off the magit
warning, I set =magit-last-seen-setup-instructions= to 1.4.0 as shown
above.

