index.html

<div id="outline-container-orgff69a08" class="outline-4">
<h4 id="orgff69a08"><span class="section-number-4">4.2.5.</span> Vundo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
I like to have undo navigation. <a href="https://github.com/casouri/vundo">Vundo</a> gives a nice mini interface
(git-style) to move around undo history.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">vundo</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-x u"</span> . vundo<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>vundo-glyph-alist vundo-unicode-symbols<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
When in the undo mode, some keys help with navigation.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">go forward</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left">go backward</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left">go to the node below at branch point</td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left">go to the node above</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left">go back to last branch</td>
</tr>

<tr>
<td class="org-left"><code>e</code></td>
<td class="org-left">go to the end of the branch</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left">go to last saved node</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">go to next saved node</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">mark current node for diff</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">unmark marked node</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">show a diff</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">quit (<code>C-g</code> also works)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org1b22077" class="outline-4">
<h4 id="org1b22077"><span class="section-number-4">4.2.6.</span> Expand Region</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
Easily one of my favorite packages, this is a nice way to expand
selections to semantic regions. Read more on
<a href="https://github.com/magnars/expand-region.el">https://github.com/magnars/expand-region.el</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">expand-region</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-="</span> . er/expand-region<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f0771f" class="outline-4">
<h4 id="org6f0771f"><span class="section-number-4">4.2.7.</span> Citar (Bibtex completions)</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
For getting completions from bibliographic data, <a href="https://github.com/emacs-citar/citar">Citar</a> links
things together.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">citar</span>
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>citar-capf-setup<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> org-mode-map <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c b"</span> . #'org-cite-insert<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>citar-bibliography bnb/biblio<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-cite-global-bibliography bnb/biblio<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-cite-insert-processor 'citar<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-cite-follow-processor 'citar<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-cite-activate-processor 'citar<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>LaTeX-mode . citar-capf-setup<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-mode . citar-capf-setup<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">citar-embark</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:after</span> <span style="color: #3e999f;">(</span>citar embark<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:no-require</span>
  <span style="color: #8959a8;">:config</span> <span style="color: #3e999f;">(</span>citar-embark-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>citar-at-point-function 'embark-act<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">citar-org-roam</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:after</span> <span style="color: #3e999f;">(</span>citar org-roam<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>add-to-list 'org-roam-capture-templates
               '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"n"</span> <span style="color: #3e999f;">"Literature note"</span> plain
                 <span style="color: #3e999f;">"%?"</span>
                 <span style="color: #8959a8;">:target</span>
                 <span style="color: #718c00;">(</span>file+head
                  <span style="color: #3e999f;">"%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/${citar-citekey}.org"</span>
                  <span style="color: #3e999f;">"#+title: ${citar-citekey} (${citar-date}). ${note-title}.\n#+created: %U\n#+last_modified: %U\n\n"</span><span style="color: #718c00;">)</span>
                 <span style="color: #8959a8;">:unnarrowed</span> t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>citar-org-roam-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0376c36" class="outline-4">
<h4 id="org0376c36"><span class="section-number-4">4.2.8.</span> Tree Sitter</h4>
<div class="outline-text-4" id="text-4-2-8">
<p>
Introduced in emacs 29, <a href="https://tree-sitter.github.io/tree-sitter/">tree sitter</a> transforms code into a
concrete syntax tree.  <a href="https://www.masteringemacs.org/article/how-to-get-started-tree-sitter">Read up on how to get started with
tree-sitter</a>
</p>
</div>

<ol class="org-ol">
<li><a id="org94ed6c9"></a>Treesit Auto<br />
<div class="outline-text-5" id="text-4-2-8-1">
<p>
Automatically install treesit grammars
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">treesit-auto</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>treesit-auto-install 'prompt<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>treesit-auto-add-to-auto-mode-alist 'all<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>global-treesit-auto-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org07fd57b" class="outline-3">
<h3 id="org07fd57b"><span class="section-number-3">4.3.</span> Version Control</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Emacs is fantastic for interfacing with version control
systems. For git, it may have the best interface.
</p>
</div>

<div id="outline-container-orga9358f0" class="outline-4">
<h4 id="orga9358f0"><span class="section-number-4">4.3.1.</span> Magit</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
<a href="https://magit.vc/manual/magit.html">Magit</a> is a git interface for Emacs.
</p>

<p>
Here I set a global key for <code>magit-status</code>. Think 'G' looks like 6.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">magit</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;f6&gt;"</span> . magit-status<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>magit-last-seen-setup-instructions <span style="color: #3e999f;">"1.4.0"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org79bf8c7"></a>Release 1.4.0<br />
<div class="outline-text-5" id="text-4-3-1-1">
<p>
This magit release warns about auto-revert of buffers.  This is
turned on by default and I will keep that setting.  To turn off
the magit warning, I set <code>magit-last-seen-setup-instructions</code> to
1.4.0 as shown above.
</p>
</div>
</li>
