Readme.org
**** Forge

Git is different than [[https://github.com][Github]] and [[https://gitlab.com][Gitlab]]. [[https://magit.vc/manual/forge/index.html#Top][Forge]] provides the right
interface to work with both of these forges.

#+begin_src emacs-lisp
  (use-package forge
    :after magit
    :ensure (forge :host github :repo "magit/forge")
    :commands (forge-pull))
#+end_src

*** Smerge

Somewhere along the line, =smerge= was added to native version control
support. To facilitate editing merge conflicts, this hydra helps me do
the work.

#+begin_src emacs-lisp
  (use-package smerge
    :ensure nil
    :bind
    (:map smerge-mode-map ("C-c ^ h" . hydra-smerge/body))
    :mode-hydra
    (hydra-smerge (:color amaranth :title " SMerge" :quit-key "q")
                  ("Selection"
                   (("a" smerge-keep-all "Keep all")
                    ("b" smerge-keep-base "Keep base")
                    ("m" smerge-keep-mine "Keep mine")
                    ("o" smerge-keep-other "Keep other")
                    ("r" smerge-resolve "Keep mine"))
                   "Movement"
                   (("n" smerge-next "Next conflict")
                    ("p" smerge-previous "Previous conflict")))))
#+end_src

** Checking

Authors can always use that little bit of extra help to ensure the
prose is right from the beginning.

*** Writegood Mode

To avoid weaslewords, passive voice, and accidental duplicates, employ
[[https://github.com/bnbeckwith/writegood-mode][Writegood]].

#+begin_src emacs-lisp
  (use-package writegood-mode
    :ensure t
    :bind
    ("C-c g"     . writegood-mode)
    ("C-c C-g g" . writegood-grade-level)
    ("C-c C-g e" . writegood-reading-ease))
#+end_src

*** Spell Checking

[[http://blog.binchen.org/posts/what-s-the-best-spell-check-set-up-in-emacs.html][This site]] has an interesting suggestion on how to use =aspell= for
CamelCase spell checking.

#+begin_src emacs-lisp
  (with-eval-after-load "exec-path-from-shell"
    (progn
      (cond
       ((executable-find "aspell")
        (setq ispell-program-name (executable-find "aspell")
              ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")))
       (t (setq ispell-program-name nil)
          (message "No aspell found!")))
      (bind-key "H-$" 'ispell-word)))
#+end_src

*** Proselint

To get a complete, robust analysis of writing, [[https://github.com/amperser/proselint][Proselint]] can be
configured to work as a checker for flycheck.

Note that the executable needs to be installed on the system and is
not automatically provided.

#+begin_src emacs-lisp
  (with-eval-after-load "flycheck-mode"
    (flycheck-define-checker proselint
      "A linter for prose"
      :command ("proselint" source-inplace)
      :error-patterns
      ((warning line-start (file-name) ":" line ":" column ": "
                (id (one-or-more (not (any " "))))
                (message (one-or-more not-newline)
                         (zero-or-more "\n" (any " ") (one-or-more not-newline)))
                line-end))
      :modes (text-mode markdown-mode gfm-mode org-mode))
    (add-to-list 'flycheck-checkers 'proselint))
#+end_src

** Buffers

Handling buffers is central to an effective Emacs experience. This
section adds in the tools to make management easy.

*** Midnight Mode

This mode looks at midnight and kills any inactive buffers
(keeping things tidy). By default, /inactive/ means is any buffer
untouched for three days.

#+begin_src emacs-lisp
  (use-package midnight
    :ensure nil
    :defer 10)
#+end_src

