index.html

<li><a id="orgbc6d43b"></a>Forge<br />
<div class="outline-text-5" id="text-4-3-1-2">
<p>
Git is different than <a href="https://github.com">Github</a> and <a href="https://gitlab.com">Gitlab</a>. <a href="https://magit.vc/manual/forge/index.html#Top">Forge</a> provides the right
interface to work with both of these forges.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">forge</span>
  <span style="color: #8959a8;">:after</span> magit
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>forge-pull<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org20ccbc3" class="outline-4">
<h4 id="org20ccbc3"><span class="section-number-4">4.3.2.</span> Smerge</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Somewhere along the line, <code>smerge</code> was added to native version
control support. To facilitate editing merge conflicts, this hydra
helps me do the work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">smerge</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> smerge-mode-map <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c ^ h"</span> . hydra-smerge/body<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defhydra</span> hydra-smerge <span style="color: #eab700;">(</span><span style="color: #8959a8;">:color</span> amaranth<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"a"</span> smerge-keep-all <span style="color: #3e999f;">"Keep all"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"b"</span> smerge-keep-base <span style="color: #3e999f;">"Keep base"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"m"</span> smerge-keep-mine <span style="color: #3e999f;">"Keep mine"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"o"</span> smerge-keep-other <span style="color: #3e999f;">"Keep other"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"n"</span> smerge-next <span style="color: #3e999f;">"Next conflict"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"p"</span> smerge-previous <span style="color: #3e999f;">"Previous conflict"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"r"</span> smerge-resolve <span style="color: #3e999f;">"Keep mine"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #3e999f;">"q"</span> nil <span style="color: #3e999f;">"quit"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc2f693c" class="outline-3">
<h3 id="orgc2f693c"><span class="section-number-3">4.4.</span> Checking</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Authors can always use that little bit of extra help to ensure the
prose is right from the beginning.
</p>
</div>

<div id="outline-container-org5c1c326" class="outline-4">
<h4 id="org5c1c326"><span class="section-number-4">4.4.1.</span> Writegood Mode</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
To avoid weaslewords, passive voice, and accidental duplicates,
employ <a href="https://github.com/bnbeckwith/writegood-mode">Writegood</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">writegood-mode</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c g"</span>     . writegood-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c C-g g"</span> . writegood-grade-level<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c C-g e"</span> . writegood-reading-ease<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4486ec1" class="outline-4">
<h4 id="org4486ec1"><span class="section-number-4">4.4.2.</span> Spell Checking</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
<a href="http://blog.binchen.org/posts/what-s-the-best-spell-check-set-up-in-emacs.html">This site</a> has an interesting suggestion on how to use <code>aspell</code> for
CamelCase spell checking.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">progn</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">cond</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>executable-find <span style="color: #3e999f;">"aspell"</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span><span style="color: #718c00;">setq</span> ispell-program-name <span style="color: #4d4d4c;">(</span>executable-find <span style="color: #3e999f;">"aspell"</span><span style="color: #4d4d4c;">)</span>
            ispell-extra-args '<span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">"--sug-mode=ultra"</span> <span style="color: #3e999f;">"--lang=en_US"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>t <span style="color: #4271ae;">(</span><span style="color: #718c00;">setq</span> ispell-program-name nil<span style="color: #4271ae;">)</span>
        <span style="color: #4271ae;">(</span>message <span style="color: #3e999f;">"No aspell found!"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">bind-key</span> <span style="color: #3e999f;">"H-$"</span> 'ispell-word<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20690c8" class="outline-4">
<h4 id="org20690c8"><span class="section-number-4">4.4.3.</span> Proselint</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
To get a complete, robust analysis of writing, <a href="https://github.com/amperser/proselint">Proselint</a> can be
configured to work as a checker for flycheck.
</p>

<p>
Note that the executable needs to be installed on the system and
is not automatically provided.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> <span style="color: #3e999f;">"flycheck-mode"</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">flycheck-define-checker</span> proselint
    <span style="color: #8959a8;">"A linter for prose"</span>
    <span style="color: #8959a8;">:command</span> <span style="color: #eab700;">(</span><span style="color: #3e999f;">"proselint"</span> source-inplace<span style="color: #eab700;">)</span>
    <span style="color: #8959a8;">:error-patterns</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>warning line-start <span style="color: #4271ae;">(</span>file-name<span style="color: #4271ae;">)</span> <span style="color: #3e999f;">":"</span> line <span style="color: #3e999f;">":"</span> column <span style="color: #3e999f;">": "</span>
              <span style="color: #4271ae;">(</span>id <span style="color: #4d4d4c;">(</span>one-or-more <span style="color: #3e999f;">(</span>not <span style="color: #eab700;">(</span>any <span style="color: #3e999f;">" "</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
              <span style="color: #4271ae;">(</span>message <span style="color: #4d4d4c;">(</span>one-or-more not-newline<span style="color: #4d4d4c;">)</span>
                       <span style="color: #4d4d4c;">(</span>zero-or-more <span style="color: #3e999f;">"\n"</span> <span style="color: #3e999f;">(</span>any <span style="color: #3e999f;">" "</span><span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>one-or-more not-newline<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
              line-end<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #8959a8;">:modes</span> <span style="color: #eab700;">(</span>text-mode markdown-mode gfm-mode org-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'flycheck-checkers 'proselint<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org16ebbc9" class="outline-3">
<h3 id="org16ebbc9"><span class="section-number-3">4.5.</span> Buffers</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Handling buffers is central to an effective Emacs experience. This
section adds in the tools to make management easy.
</p>
</div>

<div id="outline-container-org236ea7b" class="outline-4">
<h4 id="org236ea7b"><span class="section-number-4">4.5.1.</span> Midnight Mode</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
This mode looks at midnight and kills any inactive buffers
(keeping things tidy). By default, <i>inactive</i> means is any buffer
untouched for three days.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">midnight</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:defer</span> 10<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
