Readme.org
*** IBuffer

Use [[help:ibuffer][ibuffer]] instead of [[help:list-buffers][list-buffers]] for buffer management. The
most visible difference being the coloring that ~ibuffer~ uses.

I also squash any empty groups from being displayed and add hooks
to automatically set the filter groups and update contents.

#+begin_src emacs-lisp
  (use-package ibuffer
    :ensure nil
    :bind
    ("C-x C-b" . ibuffer)
    :custom
    (ibuffer-show-empty-filter-groups nil)
    :hook
    (ibuffer-mode . (lambda ()
                      (ibuffer-auto-mode 1)
                      (ibuffer-switch-to-saved-filter-groups "Standard"))))
#+end_src

**** Groups

The buffer list splits into arbitrary groups for easier
management. Below I create an "Org" group for ~org-mode~ buffers.

#+begin_src emacs-lisp
  (setq ibuffer-saved-filter-groups
        '(("Standard"
           ("Emacs" (or (filename . ".*bnb-emacs.*")
                        (mode . emacs-lisp-mode)))
           ("Org" (mode . org-mode))
           ("Magit" (name . "\*magit"))
           ("Mail" (or (mode . message-mode)
                       (mode . mail-mode)))
           ("HTML" (mode . html-mode))
           ("Help" (or (name . "\*Help\*")
                       (name . "\*Apropos\*")
                       (name . "\*info\*"))))))
#+end_src

***** VC Grouping

The [[https://github.com/purcell/ibuffer-vc][ibuffer-vc]] Package provides groups according to version
control sets. Here I setup a small keybinding (=/ v=) to get to the
filtered vc groups.  The keys =/ R= will go back to the standard
view.

#+begin_src emacs-lisp
  (use-package ibuffer-vc
    :after (ibuffer)
    :ensure t
    :bind
    (:map ibuffer-mode-map
          ("/ ;" . ibuffer-vc-set-filter-groups-by-vc-root)))
#+end_src

*** Unique Buffer Names

When editing files with the same name, but different location, a
unique identifier (based on path) is preferred over a number. The
format below shows the buffername as =<filename>:<parent directory>=.

#+begin_src emacs-lisp
  (use-package uniquify
    :ensure nil
    :defer 10
    :config
    (setq uniquify-buffer-name-style 'post-forward
          uniquify-separator ":"))
#+end_src

*** OSX Reveal

For file-backed buffers, reveal the file in OSX finder with this
binding.

#+begin_src emacs-lisp
  (use-package reveal-in-osx-finder
    :ensure t
    :bind ("C-c z" . reveal-in-osx-finder))
#+end_src

** Development

The minor modes for development deal mainly with parenthenses and
structured editing.

*** Check parens on save

This check has saved me from a broken configuration file many
times. I highly recommend.

#+begin_src emacs-lisp
  (add-hook 'after-save-hook  'check-parens nil t)
#+end_src

*** Edit indirect

Working like =org-edit-src-code=, [[https://github.com/Fanael/edit-indirect/blob/master/edit-indirect.el][=edit-indirect=]] allows for source-code
style editing of arbitrary regions. This is most useful with [[Markdown]].

#+begin_src emacs-lisp
  (use-package edit-indirect
    :ensure t)
#+end_src

*** Eldoc

While developing, documentation is nice to have handy and automatic.

#+begin_src emacs-lisp
  (use-package eldoc
    :ensure nil
    :hook
    (prog-mode . turn-on-eldoc-mode)
    (ielm-mode . turn-on-eldoc-mode)
    :custom (eldoc-documentation-strategy 'eldoc-documentation-compose-eagerly))
#+end_src

*** Ellama

#+begin_src emacs-lisp
  (use-package ellama
    :ensure t
    :defer 10
    :init
    (require 'llm-ollama)
    (setopt ellama-keymap-prefix "C-c e")
    (setopt ellama-provider
            (make-llm-ollama
             :chat-model "hermes3:latest"
             :embedding-model "nomic-embed-text"))
    (setopt ellama-summarization-provider
  	  (make-llm-ollama
  	   :chat-model "qwen2.5:latest"
  	   :embedding-model "nomic-embed-text"
  	   :default-chat-non-standard-params '(("num_ctx" . 32768))))
    (setopt ellama-coding-provider
  	  (make-llm-ollama
  	   :chat-model "qwen2.5-coder:latest"
  	   :embedding-model "nomic-embed-text"
  	   :default-chat-non-standard-params '(("num_ctx" . 32768))))) 
#+end_src

*** Eglot

Use the built-in `eglot` functionality.

#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :demand t)
#+end_src

In Emacs devel, there is also an `eglot-x` that will be available, but
it is tracking some development versions for now, so I have left it
out.

