index.html

<div id="outline-container-org8b896c7" class="outline-4">
<h4 id="org8b896c7"><span class="section-number-4">4.5.2.</span> IBuffer</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Use <code>ibuffer</code> instead of <code>list-buffers</code> for buffer management. The
most visible difference being the coloring that <code>ibuffer</code> uses.
</p>

<p>
I also squash any empty groups from being displayed and add hooks
to automatically set the filter groups and update contents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ibuffer</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-x C-b"</span> . ibuffer<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>ibuffer-show-empty-filter-groups nil<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>ibuffer-mode . <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">()</span>
                    <span style="color: #718c00;">(</span>ibuffer-auto-mode 1<span style="color: #718c00;">)</span>
                    <span style="color: #718c00;">(</span>ibuffer-switch-to-saved-filter-groups <span style="color: #3e999f;">"Standard"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org8d9a347"></a>Groups<br />
<div class="outline-text-5" id="text-4-5-2-1">
<p>
The buffer list splits into arbitrary groups for easier
management. Below I create an "Org" group for <code>org-mode</code> buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> ibuffer-saved-filter-groups
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"Standard"</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"Emacs"</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>filename . <span style="color: #3e999f;">".*bnb-emacs.*"</span><span style="color: #4d4d4c;">)</span>
                      <span style="color: #4d4d4c;">(</span>mode . emacs-lisp-mode<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"Org"</span> <span style="color: #4271ae;">(</span>mode . org-mode<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"Magit"</span> <span style="color: #4271ae;">(</span>name . <span style="color: #3e999f;">"</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*magit"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"Mail"</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>mode . message-mode<span style="color: #4d4d4c;">)</span>
                     <span style="color: #4d4d4c;">(</span>mode . mail-mode<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"HTML"</span> <span style="color: #4271ae;">(</span>mode . html-mode<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span><span style="color: #3e999f;">"Help"</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">or</span> <span style="color: #4d4d4c;">(</span>name . <span style="color: #3e999f;">"</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*Help</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*"</span><span style="color: #4d4d4c;">)</span>
                     <span style="color: #4d4d4c;">(</span>name . <span style="color: #3e999f;">"</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*Apropos</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*"</span><span style="color: #4d4d4c;">)</span>
                     <span style="color: #4d4d4c;">(</span>name . <span style="color: #3e999f;">"</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*info</span><span style="color: #c82829; font-weight: bold;">\</span><span style="color: #3e999f;">*"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orge66ccb8"></a>VC Grouping<br />
<div class="outline-text-6" id="text-4-5-2-1-1">
<p>
The <a href="https://github.com/purcell/ibuffer-vc">ibuffer-vc</a> Package provides groups according to version
control sets. Here I setup a small keybinding (<code>/ v</code>) to get to the
filtered vc groups.  The keys <code>/ R</code> will go back to the standard
view.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ibuffer-vc</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> ibuffer-mode-map
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"/ ;"</span> . ibuffer-vc-set-filter-groups-by-vc-root<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org45d9da7" class="outline-4">
<h4 id="org45d9da7"><span class="section-number-4">4.5.3.</span> Unique Buffer Names</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
When editing files with the same name, but different location, a
unique identifier (based on path) is preferred over a number. The
format below shows the buffername as <code>&lt;filename&gt;:&lt;parent directory&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">uniquify</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:defer</span> 10
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> uniquify-buffer-name-style 'post-forward
        uniquify-separator <span style="color: #3e999f;">":"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge02b4d4" class="outline-4">
<h4 id="orge02b4d4"><span class="section-number-4">4.5.4.</span> OSX Reveal</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
For file-backed buffers, reveal the file in OSX finder with this
binding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">reveal-in-osx-finder</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c z"</span> . reveal-in-osx-finder<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2e3158f" class="outline-3">
<h3 id="org2e3158f"><span class="section-number-3">4.6.</span> Development</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The minor modes for development deal mainly with parenthenses and
structured editing.
</p>
</div>

<div id="outline-container-org09be855" class="outline-4">
<h4 id="org09be855"><span class="section-number-4">4.6.1.</span> Check parens on save</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
This check has saved me from a broken configuration file many
times. I highly recommend.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>add-hook 'after-save-hook  'check-parens nil t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3c1b6c" class="outline-4">
<h4 id="orgf3c1b6c"><span class="section-number-4">4.6.2.</span> Eldoc</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
While developing, documentation is nice to have handy and
automatic.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">eldoc</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>prog-mode . turn-on-eldoc-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>ielm-mode . turn-on-eldoc-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span> <span style="color: #3e999f;">(</span>eldoc-documentation-strategy 'eldoc-documentation-compose-eagerly<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>eldoc-add-command-completions <span style="color: #3e999f;">"paredit-"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
