index.html

<li><a id="org95da16e"></a>Colorized Files<br />
<div class="outline-text-6" id="text-5-1-1-2-2">
<p>
This next addition colorizes files in dired accorting to type or
the <code>chmod</code> bits.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">dired-rainbow</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">progn</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> html        <span style="color: #3e999f;">"#eb5286"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"css"</span> <span style="color: #3e999f;">"less"</span> <span style="color: #3e999f;">"sass"</span> <span style="color: #3e999f;">"scss"</span> <span style="color: #3e999f;">"htm"</span> <span style="color: #3e999f;">"html"</span> <span style="color: #3e999f;">"jhtm"</span> <span style="color: #3e999f;">"mht"</span> <span style="color: #3e999f;">"eml"</span> <span style="color: #3e999f;">"mustache"</span> <span style="color: #3e999f;">"xhtml"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> xml         <span style="color: #3e999f;">"#f2d024"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"xml"</span> <span style="color: #3e999f;">"xsd"</span> <span style="color: #3e999f;">"xsl"</span> <span style="color: #3e999f;">"xslt"</span> <span style="color: #3e999f;">"wsdl"</span> <span style="color: #3e999f;">"bib"</span> <span style="color: #3e999f;">"json"</span> <span style="color: #3e999f;">"msg"</span> <span style="color: #3e999f;">"pgn"</span> <span style="color: #3e999f;">"rss"</span> <span style="color: #3e999f;">"yaml"</span> <span style="color: #3e999f;">"yml"</span> <span style="color: #3e999f;">"rdata"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> document    <span style="color: #3e999f;">"#9561e2"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"docm"</span> <span style="color: #3e999f;">"doc"</span> <span style="color: #3e999f;">"docx"</span> <span style="color: #3e999f;">"odb"</span> <span style="color: #3e999f;">"odt"</span> <span style="color: #3e999f;">"pdb"</span> <span style="color: #3e999f;">"pdf"</span> <span style="color: #3e999f;">"ps"</span> <span style="color: #3e999f;">"rtf"</span> <span style="color: #3e999f;">"djvu"</span> <span style="color: #3e999f;">"epub"</span> <span style="color: #3e999f;">"odp"</span> <span style="color: #3e999f;">"ppt"</span> <span style="color: #3e999f;">"pptx"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> markdown    <span style="color: #3e999f;">"#ffed4a"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"org"</span> <span style="color: #3e999f;">"etx"</span> <span style="color: #3e999f;">"info"</span> <span style="color: #3e999f;">"markdown"</span> <span style="color: #3e999f;">"md"</span> <span style="color: #3e999f;">"mkd"</span> <span style="color: #3e999f;">"nfo"</span> <span style="color: #3e999f;">"pod"</span> <span style="color: #3e999f;">"rst"</span> <span style="color: #3e999f;">"tex"</span> <span style="color: #3e999f;">"textfile"</span> <span style="color: #3e999f;">"txt"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> database    <span style="color: #3e999f;">"#6574cd"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"xlsx"</span> <span style="color: #3e999f;">"xls"</span> <span style="color: #3e999f;">"csv"</span> <span style="color: #3e999f;">"accdb"</span> <span style="color: #3e999f;">"db"</span> <span style="color: #3e999f;">"mdb"</span> <span style="color: #3e999f;">"sqlite"</span> <span style="color: #3e999f;">"nc"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> media       <span style="color: #3e999f;">"#de751f"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"mp3"</span> <span style="color: #3e999f;">"mp4"</span> <span style="color: #3e999f;">"MP3"</span> <span style="color: #3e999f;">"MP4"</span> <span style="color: #3e999f;">"avi"</span> <span style="color: #3e999f;">"mpeg"</span> <span style="color: #3e999f;">"mpg"</span> <span style="color: #3e999f;">"flv"</span> <span style="color: #3e999f;">"ogg"</span> <span style="color: #3e999f;">"mov"</span> <span style="color: #3e999f;">"mid"</span> <span style="color: #3e999f;">"midi"</span> <span style="color: #3e999f;">"wav"</span> <span style="color: #3e999f;">"aiff"</span> <span style="color: #3e999f;">"flac"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> image       <span style="color: #3e999f;">"#f66d9b"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"tiff"</span> <span style="color: #3e999f;">"tif"</span> <span style="color: #3e999f;">"cdr"</span> <span style="color: #3e999f;">"gif"</span> <span style="color: #3e999f;">"ico"</span> <span style="color: #3e999f;">"jpeg"</span> <span style="color: #3e999f;">"jpg"</span> <span style="color: #3e999f;">"png"</span> <span style="color: #3e999f;">"psd"</span> <span style="color: #3e999f;">"eps"</span> <span style="color: #3e999f;">"svg"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> log         <span style="color: #3e999f;">"#c17d11"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"log"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> shell       <span style="color: #3e999f;">"#f6993f"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"awk"</span> <span style="color: #3e999f;">"bash"</span> <span style="color: #3e999f;">"bat"</span> <span style="color: #3e999f;">"sed"</span> <span style="color: #3e999f;">"sh"</span> <span style="color: #3e999f;">"zsh"</span> <span style="color: #3e999f;">"vim"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> interpreted <span style="color: #3e999f;">"#38c172"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"py"</span> <span style="color: #3e999f;">"ipynb"</span> <span style="color: #3e999f;">"rb"</span> <span style="color: #3e999f;">"pl"</span> <span style="color: #3e999f;">"t"</span> <span style="color: #3e999f;">"msql"</span> <span style="color: #3e999f;">"mysql"</span> <span style="color: #3e999f;">"pgsql"</span> <span style="color: #3e999f;">"sql"</span> <span style="color: #3e999f;">"r"</span> <span style="color: #3e999f;">"clj"</span> <span style="color: #3e999f;">"cljs"</span> <span style="color: #3e999f;">"scala"</span> <span style="color: #3e999f;">"js"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> compiled    <span style="color: #3e999f;">"#4dc0b5"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"asm"</span> <span style="color: #3e999f;">"cl"</span> <span style="color: #3e999f;">"lisp"</span> <span style="color: #3e999f;">"el"</span> <span style="color: #3e999f;">"c"</span> <span style="color: #3e999f;">"h"</span> <span style="color: #3e999f;">"c++"</span> <span style="color: #3e999f;">"h++"</span> <span style="color: #3e999f;">"hpp"</span> <span style="color: #3e999f;">"hxx"</span> <span style="color: #3e999f;">"m"</span> <span style="color: #3e999f;">"cc"</span> <span style="color: #3e999f;">"cs"</span> <span style="color: #3e999f;">"cp"</span> <span style="color: #3e999f;">"cpp"</span> <span style="color: #3e999f;">"go"</span> <span style="color: #3e999f;">"f"</span> <span style="color: #3e999f;">"for"</span> <span style="color: #3e999f;">"ftn"</span> <span style="color: #3e999f;">"f90"</span> <span style="color: #3e999f;">"f95"</span> <span style="color: #3e999f;">"f03"</span> <span style="color: #3e999f;">"f08"</span> <span style="color: #3e999f;">"s"</span> <span style="color: #3e999f;">"rs"</span> <span style="color: #3e999f;">"hi"</span> <span style="color: #3e999f;">"hs"</span> <span style="color: #3e999f;">"pyc"</span> <span style="color: #3e999f;">".java"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> executable  <span style="color: #3e999f;">"#8cc4ff"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"exe"</span> <span style="color: #3e999f;">"msi"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> compressed  <span style="color: #3e999f;">"#51d88a"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"7z"</span> <span style="color: #3e999f;">"zip"</span> <span style="color: #3e999f;">"bz2"</span> <span style="color: #3e999f;">"tgz"</span> <span style="color: #3e999f;">"txz"</span> <span style="color: #3e999f;">"gz"</span> <span style="color: #3e999f;">"xz"</span> <span style="color: #3e999f;">"z"</span> <span style="color: #3e999f;">"Z"</span> <span style="color: #3e999f;">"jar"</span> <span style="color: #3e999f;">"war"</span> <span style="color: #3e999f;">"ear"</span> <span style="color: #3e999f;">"rar"</span> <span style="color: #3e999f;">"sar"</span> <span style="color: #3e999f;">"xpi"</span> <span style="color: #3e999f;">"apk"</span> <span style="color: #3e999f;">"xz"</span> <span style="color: #3e999f;">"tar"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> packaged    <span style="color: #3e999f;">"#faad63"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"deb"</span> <span style="color: #3e999f;">"rpm"</span> <span style="color: #3e999f;">"apk"</span> <span style="color: #3e999f;">"jad"</span> <span style="color: #3e999f;">"jar"</span> <span style="color: #3e999f;">"cab"</span> <span style="color: #3e999f;">"pak"</span> <span style="color: #3e999f;">"pk3"</span> <span style="color: #3e999f;">"vdf"</span> <span style="color: #3e999f;">"vpk"</span> <span style="color: #3e999f;">"bsp"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> encrypted   <span style="color: #3e999f;">"#ffed4a"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"gpg"</span> <span style="color: #3e999f;">"pgp"</span> <span style="color: #3e999f;">"asc"</span> <span style="color: #3e999f;">"bfe"</span> <span style="color: #3e999f;">"enc"</span> <span style="color: #3e999f;">"signature"</span> <span style="color: #3e999f;">"sig"</span> <span style="color: #3e999f;">"p12"</span> <span style="color: #3e999f;">"pem"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> fonts       <span style="color: #3e999f;">"#6cb2eb"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"afm"</span> <span style="color: #3e999f;">"fon"</span> <span style="color: #3e999f;">"fnt"</span> <span style="color: #3e999f;">"pfb"</span> <span style="color: #3e999f;">"pfm"</span> <span style="color: #3e999f;">"ttf"</span> <span style="color: #3e999f;">"otf"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> partition   <span style="color: #3e999f;">"#e3342f"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"dmg"</span> <span style="color: #3e999f;">"iso"</span> <span style="color: #3e999f;">"bin"</span> <span style="color: #3e999f;">"nrg"</span> <span style="color: #3e999f;">"qcow"</span> <span style="color: #3e999f;">"toast"</span> <span style="color: #3e999f;">"vcd"</span> <span style="color: #3e999f;">"vmdk"</span> <span style="color: #3e999f;">"bak"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define</span> vc          <span style="color: #3e999f;">"#0074d9"</span> <span style="color: #718c00;">(</span><span style="color: #3e999f;">"git"</span> <span style="color: #3e999f;">"gitignore"</span> <span style="color: #3e999f;">"gitattributes"</span> <span style="color: #3e999f;">"gitmodules"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define-chmod</span> executable-unix <span style="color: #3e999f;">"#38c172"</span> <span style="color: #3e999f;">"-.*x.*"</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">dired-rainbow-define-chmod</span> directory       <span style="color: #3e999f;">"#6cb2eb"</span> <span style="color: #3e999f;">"d.*"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
