Readme.org
***** Narrowing

Instead of [[*Filter mode][filter mode]], we can use two functions to narrow the =dired=
buffer to only the matches. The flavors of filterring are /fuzzy/ or
/regexp/.

#+begin_src emacs-lisp
  (use-package dired-narrow
    :defer t
    :bind (:map dired-mode-map
                ("C-c C-d n" . dired-narrow-fuzzy)
                ("C-c C-d r" . dired-narrow-regexp))
    :ensure t)
#+end_src

***** Collapsing directories

In the case of deep folder structures without any intermediate files
(files only in the leaves), this mode helps collapse the view to be
easier to navigate.

Per the documentation, this will be especially useful in directories
such as =~/.config/foo/config=.

#+begin_src emacs-lisp
  (use-package dired-collapse
    :defer t
    :bind
    ("C-c C-d c" . dired-collapse-mode)
    :ensure t)
#+end_src

***** External Commands

Also, there is a nice faculty to run an external command on a given
file with ==!==.

*** Neotree

Neotree is a file sidebar for navigation.  Dired has a superior
interface for interacting with files, but =Neotree= offers the tree
stucture view for the times you need to see the whole folder tree.

#+begin_src emacs-lisp
  (use-package neotree
    :ensure t
    :commands (neotree)
    :bind ("H-t" . neotree-toggle)
    :config
    (setq neo-theme (if (display-graphic-p) 'icons 'arrow)))
#+end_src

** Documents

These days, one of my favorite uses of the one true editor is to
author prose and scientific writing. These major modes provide the
tools to make this easy and fun.

*** AucTeX

Using TeX systems is easy with AUCTeX. To learn everything, read the
[[https://www.gnu.org/software/auctex/manual/auctex/index.html][AUCTeX Manual]].

The following block ensures that AUCTeX builds and loads
correctly. The main settings deal with setting up =PDF= output and the
=xetex= engine.

#+begin_src emacs-lisp
  (use-package auctex
    :after org
    :ensure (auctex
             :pre-build (("./autogen.sh")
                         ("./configure" "--without-texmf-dir" "--with-lispdir=.")
                         ("make")))
    :mode (("\\.tex\\'" . LaTeX-mode)
           ("\\.tex\\.erb\\'" . LaTeX-mode)
           ("\\.etx\\'" . LaTeX-mode))
    :hook ((LaTeX-mode . flyspell-mode)
           (LaTeX-mode . LaTeX-math-mode)
           (LaTeX-mode . auto-fill-mode)
           (LaTeX-mode . orgtbl-mode)
           (doc-view-mode . auto-revert-mode))
    :config
    (setq TeX-auto-untabify t
          TeX-auto-save t
          TeX-save-query nil
          TeX-parse-self t
          TeX-output-view-style
          (if (eq system-type 'windows-nt)
              (quote
               (("^pdf$" "." "SumatraPDF.exe -reuse-instance %o")
                ("^html?$" "." "start %o")))
            (quote
             (("^pdf$" "." "evince -f %o")
              ("^html?$" "." "start %o"))))
          TeX-PDF-mode 1
          TeX-engine 'default
          TeX-engine-alist '((default
                              "Tectonic"
                              "tectonic -c minimal -X compile -f plain %t"
                              "tectonic -c minimal -X compile %t"
                              nil))
          TeX-check-TeX nil
          TeX-process-asynchronous t
          LaTeX-command-style '(("" "%(latex)")))
    (let ((tex-list (assoc "TeX" TeX-command-list))
          (latex-list (assoc "LaTeX" TeX-command-list)))
      (setf (cadr tex-list) "%(tex)"
            (cadr latex-list) "%l"))
    (setq-default TeX-master nil)
    (setq-default TeX-global-PDF-mode 1)
    (add-to-list 'org-latex-packages-alist
                 '("" "tikz" t))
;;    (add-to-list 'org-latex-packages-alist
;;                 '("" "listings" t))
    (add-to-list 'org-latex-packages-alist
                 '("" "fvextra" t))
    (setq org-latex-create-formula-image-program 'imagemagick)
    (eval-after-load "preview"
      '(add-to-list 'preview-default-preamble "\\PreviewEnvironment{tikzpicture}" t)))
#+end_src

Let me walk through some of the settings.

Parse-self and auto-save will parse the file on load and save
respectively. Untabify will remove tabs (real ones) before saving.

I also have a default of =TeX-master= set to =nil=. I used to have it set
to "master" as recommended in the documentation, but I had bad results
for LaTeX files generated on the fly.

For viewing the output, I can specify the command to use on the files
generated in the process. However, the programs differ on GNU/Linux
and Windows, so I have per-platform settings.

There are two settings that add the =tikz= and =minted= packages to
=org-mode= exports.

