index.html

<li><a id="org7fcd80d"></a>Narrowing<br />
<div class="outline-text-6" id="text-5-1-1-2-3">
<p>
Instead of <a href="#org3d28eee">filter mode</a>, we can use two functions to narrow the
<code>dired</code> buffer to only the matches. The flavors of filterring are
<i>fuzzy</i> or <i>regexp</i>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">dired-narrow</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> dired-mode-map
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c C-d n"</span> . dired-narrow-fuzzy<span style="color: #eab700;">)</span>
              <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c C-d r"</span> . dired-narrow-regexp<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb375dec"></a>Collapsing directories<br />
<div class="outline-text-6" id="text-5-1-1-2-4">
<p>
In the case of deep folder structures without any intermediate
files (files only in the leaves), this mode helps collapse the
view to be easier to navigate.
</p>

<p>
Per the documentation, this will be especially useful in
directories such as <code>~/.config/foo/config</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">dired-collapse</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c C-d c"</span> . dired-collapse-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgf61e19d"></a>External Commands<br />
<div class="outline-text-6" id="text-5-1-1-2-5">
<p>
Also, there is a nice faculty to run an external command on a given
file with <code>=!=</code>.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org91bc8d8" class="outline-4">
<h4 id="org91bc8d8"><span class="section-number-4">5.1.2.</span> Neotree</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Neotree is a file sidebar for navigation.  Dired has a superior
interface for interacting with files, but <code>Neotree</code> offers the tree
stucture view for the times you need to see the whole folder tree.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">neotree</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>neotree<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-t"</span> . neotree-toggle<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> neo-theme <span style="color: #eab700;">(</span><span style="color: #718c00;">if</span> <span style="color: #718c00;">(</span>display-graphic-p<span style="color: #718c00;">)</span> 'icons 'arrow<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9772500" class="outline-3">
<h3 id="org9772500"><span class="section-number-3">5.2.</span> Documents</h3>
<div class="outline-text-3" id="text-5-2">
<p>
These days, one of my favorite uses of the one true editor is to
author prose and scientific writing. These major modes provide the
tools to make this easy and fun.
</p>
</div>

<div id="outline-container-org0add342" class="outline-4">
<h4 id="org0add342"><span class="section-number-4">5.2.1.</span> AucTeX</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
Using TeX systems is easy with AUCTeX. To learn everything, read
the <a href="https://www.gnu.org/software/auctex/manual/auctex/index.html">AUCTeX Manual</a>.
</p>

<p>
The following block ensures that AUCTeX builds and loads
correctly. The main settings deal with setting up <code>PDF</code> output and
the <code>xetex</code> engine.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">auctex</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:after</span> org
  <span style="color: #8959a8;">:ensure</span> <span style="color: #3e999f;">(</span>auctex <span style="color: #8959a8;">:pre-build</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #3e999f;">"./autogen.sh"</span><span style="color: #718c00;">)</span>
                              <span style="color: #718c00;">(</span><span style="color: #3e999f;">"./configure"</span> <span style="color: #3e999f;">"--without-texmf-dir"</span> <span style="color: #3e999f;">"--with-lispdir=."</span><span style="color: #718c00;">)</span>
                              <span style="color: #718c00;">(</span><span style="color: #3e999f;">"make"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:mode</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.tex\\'"</span> . LaTeX-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.tex\\.erb\\'"</span> . LaTeX-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.etx\\'"</span> . LaTeX-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>LaTeX-mode . flyspell-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>LaTeX-mode . LaTeX-math-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>LaTeX-mode . auto-fill-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>LaTeX-mode . orgtbl-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>doc-view-mode . auto-revert-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> TeX-auto-untabify t
        TeX-auto-save t
        TeX-save-query nil
        TeX-parse-self t
        TeX-output-view-style
        <span style="color: #eab700;">(</span><span style="color: #718c00;">if</span> <span style="color: #718c00;">(</span>eq system-type 'windows-nt<span style="color: #718c00;">)</span>
            <span style="color: #718c00;">(</span><span style="color: #718c00;">quote</span>
             <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">"^pdf$"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"SumatraPDF.exe -reuse-instance %o"</span><span style="color: #4d4d4c;">)</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">"^html?$"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"start %o"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #718c00;">quote</span>
           <span style="color: #4271ae;">(</span><span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">"^pdf$"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"evince -f %o"</span><span style="color: #4d4d4c;">)</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">"^html?$"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"start %o"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
        TeX-command-extra-options <span style="color: #3e999f;">"-shell-escape"</span>
        TeX-PDF-mode 1
        TeX-engine 'xetex<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> TeX-master nil<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> TeX-global-PDF-mode 1<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'org-latex-packages-alist
               '<span style="color: #eab700;">(</span><span style="color: #3e999f;">""</span> <span style="color: #3e999f;">"tikz"</span> t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'org-latex-packages-alist
               '<span style="color: #eab700;">(</span><span style="color: #3e999f;">""</span> <span style="color: #3e999f;">"minted"</span> t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-latex-create-formula-image-program 'imagemagick<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eval-after-load <span style="color: #3e999f;">"preview"</span>
    '<span style="color: #eab700;">(</span>add-to-list 'preview-default-preamble <span style="color: #3e999f;">"\\PreviewEnvironment{tikzpicture}"</span> t<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Let me walk through some of the settings.
</p>

<p>
Parse-self and auto-save will parse the file on load and save
respectively. Untabify will remove tabs (real ones) before saving.
</p>

<p>
I also have a default of <code>TeX-master</code> set to <code>nil</code>. I used to have it
set to "master" as recommended in the documentation, but I had bad
results for LaTeX files generated on the fly.
</p>

<p>
For viewing the output, I can specify the command to use on the
files generated in the process. However, the programs differ on
GNU/Linux and Windows, so I have per-platform settings.
</p>

<p>
There are two settings that add the <code>tikz</code> and <code>minted</code> packages to
<code>org-mode</code> exports.
</p>
</div>

<ol class="org-ol">
