Readme.org
**** RefTeX

RefTeX provides navigation, easy references, easy citations and
integrates well into AUCTeX. Find all of the details in the
[[https://www.gnu.org/software/auctex/manual/reftex/index.html][RefTeX Manual]].

Automatically turn it on in LaTeX modes.

#+begin_src emacs-lisp
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
#+end_src

| Keystroke | Function                           |
|-----------+------------------------------------|
| C-c =     | Show TOC and jump to sections      |
| C-c (     | Insert a label                     |
| C-c )     | Reference a label                  |
| C-c [     | Insert a citation (from BibTex db) |
| C-c <     | Index entry                        |
| C-c >     | View index                         |
| C-c &     | View crossref                      |

*** HTML

The document standard that is ubiquitous, but typically authored
through some processing tool. This section helps wtih the real
hands-on editing of HTML (and other similarily structued) documents.

**** Impatient mode

In order to play nicely with HTML+, it needs to be added to the
filters of impatient mode.

#+begin_src emacs-lisp
  (use-package impatient-mode
    :ensure t
    :mode "\\.html\\'"
    :bind
    ("C-x C-h s" . httpd-start)
    ("C-x C-h x" . httpd-stop)
    ("C-x C-h d" . httpd-serve-directory)
    :config
    (add-to-list 'imp-default-user-filters '(mhtml-mode . nil)))
#+end_src

To use impatient mode, you'll first want to call [[help:httpd-start][httpd-start]] and then
navigate to [[http://localhost:8080/imp]] to see the rendered buffers.

**** Emmet

[[https://github.com/smihica/emmet-mode][Emmet mode]] allows for terse description of nested elements. There
is great documentation on the approach at [[http://emmet.io][emmet.io]].

#+begin_src emacs-lisp
  (use-package emmet-mode
    :ensure t
    :commands (emmet-mode)
    :hook ((web-mode  . emmet-mode)
           (sgml-mode . emmet-mode)
           (css-mode  . emmet-mode)))
#+end_src

*** Markdown

Everything can't be as nice as [[*Orgmode][org-mode]]. Oh well.

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown"))
#+end_src

*** Orgmode

The one feature I cannot do without. Let's set up some basics.

#+begin_src emacs-lisp
  (use-package org
    :ensure (org :type git :repo "https://git.savannah.gnu.org/git/emacs/org-mode.git" :tag "release_9.7.12")
    :delight (org-mode "🦄" :major)
    :mode ("\\.org\\(_archive\\)?\\'" . org-mode)
    :bind
    ("C-c t"  . orgtbl-mode)
    ("C-c l"  . org-store-link)
    ("C-c r"  . org-capture)
    ("C-c a"  . org-agenda)
    ("<f12>"  . org-agenda)
    ("H-z"    . org-agenda)
    ("<apps>" . org-agenda)
    ("<f9> g" . org-clock-goto)
    ("<f9> i" . org-clock-in)
    ("<f9> o" . org-clock-out)
    (:map org-mode-map
          ("M-i"   . org-toggle-inline-images)
          ("C-c ," . org-insert-structure-template)
          ("C-c ," . org-insert-structure-template)
          ("M-o"   . ace-link-org))
    :hook
    (org-babel-after-execute . (lambda () (org-display-inline-images t t))))
#+end_src

This block installs [[https://orgmode.org/][org-mode]] along with some bindings.

| Binding | Effect                         |
|---------+--------------------------------|
| =C-c t=   | Edit tables in any mode        |
| =C-c l=   | Store a link to thing at point |
| =C-c r=   | Dispatch org capture           |
| =<f12>=   | Open org agenda                |
| =H-z=     | Open org agenda                |
| =<apps>=  | Open org agenda                |
| =<f9> g=  | Goto open org clock            |
| =<f9> i=  | Org clock in                   |
| =<f9> o=  | Org clock out                  |

