index.html
<li><a id="orgf2ee47e"></a>RefTeX<br />
<div class="outline-text-5" id="text-5-2-1-1">
<p>
RefTeX provides navigation, easy references, easy citations and
integrates well into AUCTeX. Find all of the details in the
<a href="https://www.gnu.org/software/auctex/manual/reftex/index.html">RefTeX Manual</a>.
</p>

<p>
Automatically turn it on in LaTeX modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>add-hook 'LaTeX-mode-hook 'turn-on-reftex<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keystroke</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c =</td>
<td class="org-left">Show TOC and jump to sections</td>
</tr>

<tr>
<td class="org-left">C-c (</td>
<td class="org-left">Insert a label</td>
</tr>

<tr>
<td class="org-left">C-c )</td>
<td class="org-left">Reference a label</td>
</tr>

<tr>
<td class="org-left">C-c [</td>
<td class="org-left">Insert a citation (from BibTex db)</td>
</tr>

<tr>
<td class="org-left">C-c &lt;</td>
<td class="org-left">Index entry</td>
</tr>

<tr>
<td class="org-left">C-c &gt;</td>
<td class="org-left">View index</td>
</tr>

<tr>
<td class="org-left">C-c &amp;</td>
<td class="org-left">View crossref</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8bc35e3" class="outline-4">
<h4 id="org8bc35e3"><span class="section-number-4">5.2.2.</span> HTML</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
The document standard that is ubiquitous, but typically authored
through some processing tool. This section helps wtih the real
hands-on editing of HTML (and other similarily structued)
documents.
</p>
</div>

<ol class="org-ol">
<li><a id="org52b99a1"></a>Impatient mode<br />
<div class="outline-text-5" id="text-5-2-2-1">
<p>
In order to play nicely with HTML+, it needs to be added to the
filters of impatient mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">impatient-mode</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:mode</span> <span style="color: #3e999f;">"\\.html\\'"</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-x C-h s"</span> . httpd-start<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-x C-h x"</span> . httpd-stop<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-x C-h d"</span> . httpd-serve-directory<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>add-to-list 'imp-default-user-filters '<span style="color: #eab700;">(</span>mhtml-mode . nil<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
To use impatient mode, you'll first want to call <code>httpd-start</code> and
then navigate to <a href="http://localhost:8080/imp">http://localhost:8080/imp</a> to see the rendered
buffers.
</p>
</div>
</li>

<li><a id="org71bc905"></a>Emmet<br />
<div class="outline-text-5" id="text-5-2-2-2">
<p>
<a href="https://github.com/smihica/emmet-mode">Emmet mode</a> allows for terse description of nested elements. There
is great documentation on the approach at <a href="http://emmet.io">emmet.io</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">emmet-mode</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>emmet-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>web-mode  . emmet-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>sgml-mode . emmet-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span>css-mode  . emmet-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb984cc0" class="outline-4">
<h4 id="orgb984cc0"><span class="section-number-4">5.2.3.</span> Markdown</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
Everything can't be as nice as <a href="#orgf3faca8">org-mode</a>. Oh well.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">markdown-mode</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>markdown-mode gfm-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:mode</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"README\\.md\\'"</span> . gfm-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.md\\'"</span> . markdown-mode<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.markdown\\'"</span> . markdown-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span> <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> markdown-command <span style="color: #3e999f;">"multimarkdown"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3faca8" class="outline-4">
<h4 id="orgf3faca8"><span class="section-number-4">5.2.4.</span> Orgmode</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
The one feature I cannot do without. Let's set up some basics.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org</span>
  <span style="color: #8959a8;">:ensure</span> <span style="color: #3e999f;">(</span>org <span style="color: #8959a8;">:type</span> git <span style="color: #8959a8;">:repo</span> <span style="color: #3e999f;">"https://git.savannah.gnu.org/git/emacs/org-mode.git"</span> <span style="color: #8959a8;">:tag</span> <span style="color: #3e999f;">"release_9.6.19"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:delight</span> <span style="color: #3e999f;">(</span>org-mode <span style="color: #3e999f;">"&#129412;"</span> <span style="color: #8959a8;">:major</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:mode</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"\\.org</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">_archive</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">?\\'"</span> . org-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c t"</span>  . orgtbl-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c l"</span>  . org-store-link<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c r"</span>  . org-capture<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c a"</span>  . org-agenda<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;f12&gt;"</span>  . org-agenda<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-z"</span>    . org-agenda<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;apps&gt;"</span> . org-agenda<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;f9&gt; g"</span> . org-clock-goto<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;f9&gt; i"</span> . org-clock-in<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"&lt;f9&gt; o"</span> . org-clock-out<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> org-mode-map
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-i"</span>   . org-toggle-inline-images<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c ,"</span> . org-insert-structure-template<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c ,"</span> . org-insert-structure-template<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"M-o"</span>   . ace-link-org<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>org-babel-after-execute . <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">()</span> <span style="color: #718c00;">(</span>org-display-inline-images t t<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
This block installs <a href="https://orgmode.org/">org-mode</a> along with some bindings.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Binding</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c t</code></td>
<td class="org-left">Edit tables in any mode</td>
</tr>

<tr>
<td class="org-left"><code>C-c l</code></td>
<td class="org-left">Store a link to thing at point</td>
</tr>

<tr>
<td class="org-left"><code>C-c r</code></td>
<td class="org-left">Dispatch org capture</td>
</tr>

<tr>
<td class="org-left"><code>&lt;f12&gt;</code></td>
<td class="org-left">Open org agenda</td>
</tr>

<tr>
<td class="org-left"><code>H-z</code></td>
<td class="org-left">Open org agenda</td>
</tr>

<tr>
<td class="org-left"><code>&lt;apps&gt;</code></td>
<td class="org-left">Open org agenda</td>
</tr>

<tr>
<td class="org-left"><code>&lt;f9&gt; g</code></td>
<td class="org-left">Goto open org clock</td>
</tr>

<tr>
<td class="org-left"><code>&lt;f9&gt; i</code></td>
<td class="org-left">Org clock in</td>
</tr>

<tr>
<td class="org-left"><code>&lt;f9&gt; o</code></td>
<td class="org-left">Org clock out</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
