Readme.org
**** Contrib

There are a set of contributed packages that install nicely
together. This code block ensures that the libraries are
available.

#+begin_src emacs-lisp
  (use-package org-contrib
    :after org
    :ensure t)
#+end_src

**** Auto mode

I add =_archive= to the list of known org files. This alternative
extensions correctly identifies org archives (=.org_archive=).

This mode is set above with =use-package=.

**** Hooks

There are two hooks to consider. The one initialized in [[Orgmode]] toggles
on the inline images.

The next hook just saves the org files opened before exiting emacs --
just in case.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-hook 'bnb/kill-emacs-hooks 'org-save-all-org-buffers 'append))
#+end_src

**** Speed Keys

Using org-mode efficiently for task management is best done with speed
keys. This are in effect when the cursor is on the first =*= of a
headline. And they come with an easy cheat-sheet by typing =?=. I enable
this feature and add some of my own commands.

#+begin_src emacs-lisp
       (with-eval-after-load 'org
         (setq org-use-speed-commands t
               org-speed-commands
               (append org-speed-commands
                       '(("BNB Additions")
                         ("0" . delete-window)
                         ("1" . delete-other-windows)
                         ("2" . split-window-vertically)
                         ("3" . split-window-horizontally)
                         ("z" . org-add-note)
                         ("h" . hide-other)
                         ("." . org-save-all-org-buffers)
                         ("/" . org-global-cycle)
                         ("k" . #'(lambda ()
                                     (org-mark-subtree)
                                     (kill-region
                                      (region-beginning)
                                      (region-end))))))))
#+end_src

**** Org Configuration

This is the meat of what Org can do. Keeping track of todo items with
due dates, tags, etc. is really powerful. And I get to customize it to
suit my needs and my workflow.

***** Keywords

The keywords that org uses in the headlines exist as sequences
describing the state changes. [[https://orgmode.org/manual/Workflow-states.html][The sequences]] describe how you can cycle
through the different states. However, I don't cycle through states
and just select them. I find that is better for the large list of
possibilities here.

The characters in =()= also allow fast access to these states described
[[https://orgmode.org/manual/Fast-access-to-TODO-states.html][here]].

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!/!)")
  	  (sequence "WAITING(w@/!)" "SOMEDAY(s!)" "|" "CANCELED(c@/!)")
  	  (sequence "CANCELED(c@/!)"))))
#+end_src

***** Tags

Org uses tags on headlines for organization. I don't currently use
them much. I organize mainly by file with a file tag specified via
[[https://orgmode.org/manual/In_002dbuffer-Settings.html][in-buffer settings]] (=#+FILETAGS=).

However, a global tag list provides a selection list for the tagging
interface. I use 'project' as my tag to easily differentiate simple
tasks from more complex ones.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-tag-alist '(("PROJECT" . ?p))))
#+end_src

