index.html
<li><a id="orgc7680bf"></a>Contrib<br />
<div class="outline-text-5" id="text-5-2-4-1">
<p>
There are a set of contributed packages that install nicely
together. This code block ensures that the libraries are
available.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-contrib</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org58f9ce6"></a>Auto mode<br />
<div class="outline-text-5" id="text-5-2-4-2">
<p>
I add <code>_archive</code> to the list of known org files. This alternative
extensions correctly identifies org archives (<code>.org_archive</code>).
</p>

<p>
This mode is set above with <code>use-package</code>.
</p>
</div>
</li>

<li><a id="org35fdd93"></a>Hooks<br />
<div class="outline-text-5" id="text-5-2-4-3">
<p>
There are two hooks to consider. Theone initialized in <a href="#orgf3faca8">5.2.4</a>
toggles on the inline images.
</p>

<p>
The next hook just saves the org files opened before exiting
emacs &#x2013; just in case.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-hook 'bnb/kill-emacs-hooks 'org-save-all-org-buffers 'append<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgbf840bc"></a>Speed Keys<br />
<div class="outline-text-5" id="text-5-2-4-4">
<p>
Using org-mode efficiently for task management is best done with
speed keys. This are in effect when the cursor is on the first <code>*</code>
of a headline. And they come with an easy cheat-sheet by typing
<code>?</code>. I enable this feature and add some of my own commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-use-speed-commands t
        org-speed-commands
        <span style="color: #eab700;">(</span>append org-speed-commands
                '<span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span><span style="color: #3e999f;">"BNB Additions"</span><span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"0"</span> . delete-window<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"1"</span> . delete-other-windows<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"2"</span> . split-window-vertically<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"3"</span> . split-window-horizontally<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"z"</span> . org-add-note<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"h"</span> . hide-other<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"."</span> . org-save-all-org-buffers<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"/"</span> . org-global-cycle<span style="color: #4271ae;">)</span>
                  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"k"</span> . #'<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #3e999f;">()</span>
                              <span style="color: #3e999f;">(</span>org-mark-subtree<span style="color: #3e999f;">)</span>
                              <span style="color: #3e999f;">(</span>kill-region
                               <span style="color: #eab700;">(</span>region-beginning<span style="color: #eab700;">)</span>
                               <span style="color: #eab700;">(</span>region-end<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgeec0e76"></a>Org Configuration<br />
<div class="outline-text-5" id="text-5-2-4-5">
<p>
This is the meat of what Org can do. Keeping track of todo items
with due dates, tags, etc. is really powerful. And I get to
customize it to suit my needs and my workflow.
</p>
</div>

<ol class="org-ol">
<li><a id="org1b9daf9"></a>Keywords<br />
<div class="outline-text-6" id="text-5-2-4-5-1">
<p>
The keywords that org uses in the headlines exist as sequences
describing the state changes. <a href="https://orgmode.org/manual/Workflow-states.html">The sequences</a> describe how you can
cycle through the different states. However, I don't cycle
through states and just select them. I find that is better for
the large list of possibilities here.
</p>

<p>
The characters in <code>()</code> also allow fast access to these states
described <a href="https://orgmode.org/manual/Fast-access-to-TODO-states.html">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-todo-keywords
        '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>sequence <span style="color: #3e999f;">"TODO(t)"</span> <span style="color: #3e999f;">"NEXT(n)"</span> <span style="color: #3e999f;">"|"</span> <span style="color: #3e999f;">"DONE(d!/!)"</span><span style="color: #718c00;">)</span>
                <span style="color: #718c00;">(</span>sequence <span style="color: #3e999f;">"WAITING(w@/!)"</span> <span style="color: #3e999f;">"SOMEDAY(s!)"</span> <span style="color: #3e999f;">"|"</span> <span style="color: #3e999f;">"CANCELED(c@/!)"</span><span style="color: #718c00;">)</span>
                <span style="color: #718c00;">(</span>sequence <span style="color: #3e999f;">"CANCELED(c@/!)"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org533f194"></a>Tags<br />
<div class="outline-text-6" id="text-5-2-4-5-2">
<p>
Org uses tags on headlines for organization. I don't currently
use them much. I organize mainly by file with a file tag
specified via <a href="https://orgmode.org/manual/In_002dbuffer-Settings.html">in-buffer settings</a> (<code>#+FILETAGS</code>).
</p>

<p>
However, a global tag list provides a selection list for the
tagging interface. I use 'project' as my tag to easily
differentiate simple tasks from more complex ones.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-tag-alist '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #3e999f;">"PROJECT"</span> . ?p<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
