Readme.org
***** Mechanics

The todo interface allows easy selection of states and triggers on
certain states to store notes.

Instead of cycling through states (and possibly triggering log
entries), I prefer fast entry to jump right to the correct state. I
also turn off the S-cursor transitions as state changes to avoid the
logging prompts.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-use-fast-todo-selection t
          org-treat-S-cursor-todo-selection-as-state-change nil))
#+end_src

Upon changing the state of todo items, I can automatically add/remove
tags with the following list. It's a bit lispy, but describes what
happens upon entry in the specified state. The state named as a string
has tuples of tags and flags. 't' indicates to set the flag, empty
means to remove it.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-todo-state-tags-triggers
          '(("CANCELED" ("CANCELED" . t))
            ("WAITING"  ("WAITING" . t))
            ("SOMEDAY"  ("SOMEDAY" . t))
            (done       ("WAITING"))
            ("TODO"     ("WAITING") ("CANCELED"))
            ("NEXT"     ("WAITING"))
            ("DONE"     ("WAITING") ("CANCELED")))))
#+end_src

Along with tags and states are priorities. I do not use task
priorities myself so I turn them off.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-enable-priority-commands nil))
#+end_src

****** Logging

Org allows logging of states. I turn this on to prompt myself for
reasons behind specific state changes. There is also a setting to set
a different drawer for clocking and logs.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-log-done       'note
          org-log-redeadline 'time
          org-log-reschedule 'time
          org-log-into-drawer t
          org-drawers '("PROPERTIES" "LOGBOOK" "CLOCK")))
#+end_src

****** Sub-tasks

Naturally, some tasks are projects composed of smaller sub-tasks. Org
handles this easily. I like to enforce the dependencies of regular
todo items and plain checkbox lists. In this way, the overall item
cannot change to done without the completion of the sub-tasks.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-enforce-todo-checkbox-dependencies t
          org-enforce-todo-dependencies t))
#+end_src

Because of the previous enforcement of state, I can also automatically
infer when a parent state is complete. The following code marks the
parent complete once the sub-tasks are all done.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (defun org-summary-todo (n-done n-not-done)
      "Switch entry to DONE when all sub-entries are done, to TODO otherwise."
      (let (org-log-done org-log-states)
        (org-todo (if (= n-not-done 0) "DONE" "TODO"))))
    (add-hook 'org-after-todo-statistics-hook 'org-summary-todo))
#+end_src

