index.html

<li><a id="org20554c9"></a>Mechanics<br />
<div class="outline-text-6" id="text-5-2-4-5-3">
<p>
The todo interface allows easy selection of states and triggers
on certain states to store notes.
</p>

<p>
Instead of cycling through states (and possibly triggering log
entries), I prefer fast entry to jump right to the correct
state. I also turn off the S-cursor transitions as state changes
to avoid the logging prompts.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-use-fast-todo-selection t
        org-treat-S-cursor-todo-selection-as-state-change nil<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Upon changing the state of todo items, I can automatically
add/remove tags with the following list. It's a bit lispy, but
describes what happens upon entry in the specified state. The
state named as a string has tuples of tags and flags. 't'
indicates to set the flag, empty means to remove it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-todo-state-tags-triggers
        '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #3e999f;">"CANCELED"</span> <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"CANCELED"</span> . t<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"WAITING"</span>  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"WAITING"</span> . t<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"SOMEDAY"</span>  <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"SOMEDAY"</span> . t<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span>done       <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"WAITING"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"TODO"</span>     <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"WAITING"</span><span style="color: #4271ae;">)</span> <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"CANCELED"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"NEXT"</span>     <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"WAITING"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"DONE"</span>     <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"WAITING"</span><span style="color: #4271ae;">)</span> <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"CANCELED"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Along with tags and states are priorities. I do not use task
priorities myself so I turn them off.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-enable-priority-commands nil<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org6aacb52"></a>Logging<br />
<div class="outline-text-7" id="text-5-2-4-5-3-1">
<p>
Org allows logging of states. I turn this on to prompt myself
for reasons behind specific state changes. There is also a
setting to set a different drawer for clocking and logs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-log-done       'note
        org-log-redeadline 'time
        org-log-reschedule 'time
        org-log-into-drawer t
        org-drawers '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"PROPERTIES"</span> <span style="color: #3e999f;">"LOGBOOK"</span> <span style="color: #3e999f;">"CLOCK"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org053dfd4"></a>Sub-tasks<br />
<div class="outline-text-7" id="text-5-2-4-5-3-2">
<p>
Naturally, some tasks are projects composed of smaller
sub-tasks. Org handles this easily. I like to enforce the
dependencies of regular todo items and plain checkbox lists. In
this way, the overall item cannot change to done without the
completion of the sub-tasks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-enforce-todo-checkbox-dependencies t
        org-enforce-todo-dependencies t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Because of the previous enforcement of state, I can also
automatically infer when a parent state is complete. The
following code marks the parent complete once the sub-tasks
are all done.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">org-summary-todo</span> <span style="color: #eab700;">(</span>n-done n-not-done<span style="color: #eab700;">)</span>
    <span style="color: #8959a8;">"Switch entry to DONE when all sub-entries are done, to TODO otherwise."</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">let</span> <span style="color: #718c00;">(</span>org-log-done org-log-states<span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>org-todo <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> <span style="color: #4d4d4c;">(</span>= n-not-done 0<span style="color: #4d4d4c;">)</span> <span style="color: #3e999f;">"DONE"</span> <span style="color: #3e999f;">"TODO"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-hook 'org-after-todo-statistics-hook 'org-summary-todo<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
