Readme.org
**** Capture

[[https://orgmode.org/manual/Capture.html][Capturing]] is crucial to a task system and in this vein, org is no
slouch. The capture templates define what get captured, where it goes,
and what the user needs to type.

#+begin_src emacs-lisp
  ;; Files
  (setq org-default-notes-file "~/Documents/Org/Inbox.org"
        bnb/weekly-reports-file "~/Documents/Org/WeeklyReports.org")

  ;; Default templates
  (setq org-capture-templates
        `(("t" "Todo" entry
           (file ,org-default-notes-file)
           "* TODO %?\n%U\n%^{Score}p" :clock-in t :clock-resume t)
          ("r" "todo (Remember location)" entry
           (file org-default-notes-file)
           "* TODO %?\n%U\n  %a" :clock-in t :clock-resume t)
          ("n" "Note" entry
           (file org-default-notes-file)
           "* %?                                                                            :NOTE:\n%U\n%a\n:CLOCK:\n:END:")
          ("c" "Capture current TODO mix in table" table-line (file+headline ,bnb/weekly-reports-file "Burndown")
           "%(bnb/org-count-tasks-by-status)")
          ("s" "Capture Weekly Score in table" table-line (file+headline ,bnb/weekly-reports-file "Scores")
           "%(bnb/add-weekly-score-table-entry)")
          ("e" "Capture Weekly time in table" table-line (file+headline ,bnb/weekly-reports-file "Minutes")
           "%(bnb/org-time-logged-table-entry)")
          ("u" "Url" entry (file ,org-default-notes-file)
           "* TODO %?\n  %U\n\n  %(org-mac-chrome-get-frontmost-url)")
          ("m" "Mail" entry (file ,org-default-notes-file)
           "* TODO %?\n  %U\n\n  %(org-mac-message-get-links \"s\")")))
#+end_src

There are five main capture templates here. The first two store a todo
item in my Refile.org file. The only difference is automatic
(contextual) link storage in the second case.

The next item simply stores a note. The next for "Weekly Report" is a
work in progress. I think that I'll have to either settle for a proper
datetree or write a custom function.

The final item is not for direct use, but through the =org-protocol=
interface and =org-outlook= usage. This lets me add a link to an Outlook
message on windows. I can then get an email at work, mark it to store
in emacs and quickly get back to the message later.

