index.html

<li><a id="org9870660"></a>Capture<br />
<div class="outline-text-5" id="text-5-2-4-6">
<p>
<a href="https://orgmode.org/manual/Capture.html">Capturing</a> is crucial to a task system and in this vein, org is no
slouch. The capture templates define what get captured, where it
goes, and what the user needs to type.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Files</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-default-notes-file <span style="color: #3e999f;">"~/Documents/Org/Inbox.org"</span>
      bnb/weekly-reports-file <span style="color: #3e999f;">"~/Documents/Org/WeeklyReports.org"</span><span style="color: #4d4d4c;">)</span>

<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Default templates</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-capture-templates
      `<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"t"</span> <span style="color: #3e999f;">"Todo"</span> entry
         <span style="color: #718c00;">(</span>file ,org-default-notes-file<span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"* TODO %?\n  %U\n%^{Score}p"</span> <span style="color: #8959a8;">:clock-in</span> t <span style="color: #8959a8;">:clock-resume</span> t<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"r"</span> <span style="color: #3e999f;">"todo (Remember location)"</span> entry
         <span style="color: #718c00;">(</span>file org-default-notes-file<span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"* TODO %?\n  %U\n  %a"</span> <span style="color: #8959a8;">:clock-in</span> t <span style="color: #8959a8;">:clock-resume</span> t<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"n"</span> <span style="color: #3e999f;">"Note"</span> entry
         <span style="color: #718c00;">(</span>file org-default-notes-file<span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"* %?                                                                            :NOTE:\n  %U\n  %a\n  :CLOCK:\n  :END:"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"c"</span> <span style="color: #3e999f;">"Capture current TODO mix in table"</span> table-line <span style="color: #718c00;">(</span>file+headline ,bnb/weekly-reports-file <span style="color: #3e999f;">"Burndown"</span><span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"%(bnb/org-count-tasks-by-status)"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s"</span> <span style="color: #3e999f;">"Capture Weekly Score in table"</span> table-line <span style="color: #718c00;">(</span>file+headline ,bnb/weekly-reports-file <span style="color: #3e999f;">"Scores"</span><span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"%(bnb/add-weekly-score-table-entry)"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"e"</span> <span style="color: #3e999f;">"Capture Weekly time in table"</span> table-line <span style="color: #718c00;">(</span>file+headline ,bnb/weekly-reports-file <span style="color: #3e999f;">"Minutes"</span><span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"%(bnb/org-time-logged-table-entry)"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"u"</span> <span style="color: #3e999f;">"Url"</span> entry <span style="color: #718c00;">(</span>file ,org-default-notes-file<span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"* TODO %?\n  %U\n\n  %(org-mac-chrome-get-frontmost-url)"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"m"</span> <span style="color: #3e999f;">"Mail"</span> entry <span style="color: #718c00;">(</span>file ,org-default-notes-file<span style="color: #718c00;">)</span>
         <span style="color: #3e999f;">"* TODO %?\n  %U\n\n  %(org-mac-message-get-links \"s\")"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
There are five main capture templates here. The first two store a
todo item in my Refile.org file. The only difference is automatic
(contextual) link storage in the second case.
</p>

<p>
The next item simply stores a note. The next for "Weekly Report"
is a work in progress. I think that I'll have to either settle
for a proper datetree or write a custom function.
</p>

<p>
The final item is not for direct use, but through the
<code>org-protocol</code> interface and <code>org-outlook</code> usage. This lets me add a
link to an Outlook message on windows. I can then get an email at
work, mark it to store in emacs and quickly get back to the
message later.
</p>
</div>

<ol class="org-ol">
