Readme.org
**** Refile

[[https://orgmode.org/manual/Refiling-and-Archiving.html][Refiling notes]] is also spectacular with Org. That is what makes it
possible for me to simply put every captured item into Refile.org and
worry about organization later.

For my setup, I use separate files that hold a singular Tasks
headline. Because of that, I turn on caching first.

For the refile targets, I will allow up to 2 levels of search for
filing in any of the agenda files. For refiling within the current
file, I set the max to five levels. Anything deeper than six levels
will exhaust the depth of my thought.

The refiling system is set to =confirm= creation of parent nodes. This
allows me to not only refile, but create along the way for faster
organization.

Finally, I set the filenames to be first for refiling.

#+begin_src emacs-lisp
  (setq org-refile-use-cache t
        org-refile-targets '((org-agenda-files :maxlevel . 2)
                             (nil :maxlevel . 5))
        org-refile-allow-creating-parent-nodes 'confirm
        org-refile-use-outline-path 'file)
#+end_src

**** Agenda

Once I have captured and refiled my tasks, I need to remember to do
them and see what is on the agenda. The ways to view the tasks at hand
are nicely programmable.

Some basic settings control small tidbits in the agenda. I turn on
tags in the agenda line, show the logged items for the day, and only
show a time grid if a scheduled tasks exists.

#+begin_src emacs-lisp
  (setq org-agenda-show-inherited-tags t
        org-agenda-log-mode-items '(clock)
        org-agenda-clockreport-parameter-plist '(:link nil :maxlevel 2 :fileskip0 t)
        org-agenda-block-separator nil
        org-agenda-dim-blocked-tasks nil
        org-agenda-inhibit-startup t
        org-agenda-breadcrumbs-separator " ❱ ")
#+end_src

***** Super agenda

Enriching the agenda view is easy with [[https://github.com/alphapapa/org-super-agenda/tree/master][org-super-agenda]]. I don't make
any default settings here, but override [[help:org-super-agenda-groups][org-super-agenda-groups]] for
each agenda view dispatcher.

#+begin_src emacs-lisp
  (use-package org-super-agenda
    :after org
    :ensure t
    :config
    (org-super-agenda-mode))
#+end_src

The [[https://github.com/alphapapa/org-super-agenda/blob/master/examples.org][examples]] online provide a good idea of the grouping customization
(and ease).

***** Category Icons

Org-mode can show category icons in some agenda views. The underlying
setting is just an ~alist~ of categories and the icons to use.

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;
  ;; Org agenda category icons
  (with-eval-after-load 'nerd-icons
    (setq org-agenda-category-icon-alist 
          `(("[iI]nbox"     ;; 
             ,(list (nerd-icons-octicon "nf-oct-inbox")) nil nil :ascent center)
            ("[Ww]ork"      ;; 
             ,(list (nerd-icons-octicon "nf-oct-organization")) nil nil :ascent center)
            ("[Pp]ersonal"  ;; 
             ,(list (nerd-icons-octicon "nf-oct-home")) nil nil :ascent center)
            ("[Ii][Cc]"     ;; 
             ,(list (nerd-icons-octicon "nf-oct-person")) nil nil :ascent center)
            ("[Mm]anager"   ;; 
             ,(list (nerd-icons-faicon "nf-fa-cogs")) nil nil :ascent center))))
#+end_src

