index.html

<li><a id="orge03a131"></a>Refile<br />
<div class="outline-text-5" id="text-5-2-4-7">
<p>
<a href="https://orgmode.org/manual/Refiling-and-Archiving.html">Refiling notes</a> is also spectacular with Org. That is what makes
it possible for me to simply put every captured item into
Refile.org and worry about organization later.
</p>

<p>
For my setup, I use separate files that hold a singular Tasks
headline. Because of that, I turn on caching first.
</p>

<p>
For the refile targets, I will allow up to 2 levels of search for
filing in any of the agenda files. For refiling within the
current file, I set the max to five levels. Anything deeper than
six levels will exhaust the depth of my thought.
</p>

<p>
The refiling system is set to <code>confirm</code> creation of parent
nodes. This allows me to not only refile, but create along the
way for faster organization.
</p>

<p>
Finally, I set the filenames to be first for refiling.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-refile-use-cache t
      org-refile-targets '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>org-agenda-files <span style="color: #8959a8;">:maxlevel</span> . 2<span style="color: #eab700;">)</span>
                           <span style="color: #eab700;">(</span>nil <span style="color: #8959a8;">:maxlevel</span> . 5<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
      org-refile-allow-creating-parent-nodes 'confirm
      org-refile-use-outline-path 'file<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7a19293"></a>Agenda<br />
<div class="outline-text-5" id="text-5-2-4-8">
<p>
Once I have captured and refiled my tasks, I need to remember to
do them and see what is on the agenda. The ways to view the tasks
at hand are nicely programmable.
</p>

<p>
Some basic settings control small tidbits in the agenda. I turn
on tags in the agenda line, show the logged items for the day,
and only show a time grid if a scheduled tasks exists.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-agenda-show-inherited-tags t
      org-agenda-log-mode-items '<span style="color: #3e999f;">(</span>clock<span style="color: #3e999f;">)</span>
      org-agenda-clockreport-parameter-plist '<span style="color: #3e999f;">(</span><span style="color: #8959a8;">:link</span> nil <span style="color: #8959a8;">:maxlevel</span> 2 <span style="color: #8959a8;">:fileskip0</span> t<span style="color: #3e999f;">)</span>
      org-agenda-block-separator nil
      org-agenda-dim-blocked-tasks nil
      org-agenda-inhibit-startup t
      org-agenda-breadcrumbs-separator <span style="color: #3e999f;">" &#10097; "</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgbf1fa18"></a>Category Icons<br />
<div class="outline-text-6" id="text-5-2-4-8-1">
<p>
Org-mode can show category icons in some agenda views. The
underlying setting is just an <code>alist</code> of categories and the icons
to use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;;;;;;;;;;;;;</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Org agenda category icons</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'nerd-icons
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-agenda-category-icon-alist 
        `<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #3e999f;">"[iI]nbox"</span>     <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&#62605;</span>
           ,<span style="color: #4271ae;">(</span>list <span style="color: #4d4d4c;">(</span>nerd-icons-octicon <span style="color: #3e999f;">"nf-oct-inbox"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span> nil nil <span style="color: #8959a8;">:ascent</span> center<span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"[Ww]ork"</span>      <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&#62507;</span>
           ,<span style="color: #4271ae;">(</span>list <span style="color: #4d4d4c;">(</span>nerd-icons-octicon <span style="color: #3e999f;">"nf-oct-organization"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span> nil nil <span style="color: #8959a8;">:ascent</span> center<span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"[Pp]ersonal"</span>  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&#62573;</span>
           ,<span style="color: #4271ae;">(</span>list <span style="color: #4d4d4c;">(</span>nerd-icons-octicon <span style="color: #3e999f;">"nf-oct-home"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span> nil nil <span style="color: #8959a8;">:ascent</span> center<span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"[Ii][Cc]"</span>     <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&#62485;</span>
           ,<span style="color: #4271ae;">(</span>list <span style="color: #4d4d4c;">(</span>nerd-icons-octicon <span style="color: #3e999f;">"nf-oct-person"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span> nil nil <span style="color: #8959a8;">:ascent</span> center<span style="color: #718c00;">)</span>
          <span style="color: #718c00;">(</span><span style="color: #3e999f;">"[Mm]anager"</span>   <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&#62523;</span>
           ,<span style="color: #4271ae;">(</span>list <span style="color: #4d4d4c;">(</span>nerd-icons-octicon <span style="color: #3e999f;">"nf-oct-ruby"</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span> nil nil <span style="color: #8959a8;">:ascent</span> center<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
