Readme.org
***** Views

The key to exploring open work are the agenda views. These provide a
landscape to list, filter or manipulate
tasks. [[help:org-agenda-custom-commands][org-agenda-custom-commands]] defines which views are available by
default.

Adapted from [[https://github.com/fniessen/emacs-leuven/blob/master/lisp/org-leuven-agenda-views.txt][org-leuven-agenda-views.txt]].

#+begin_src emacs-lisp
  ;; Reset everything to nil
  (setq org-agenda-custom-commands nil)
#+end_src

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("o" "My Agenda"
       ((todo "TODO"
              ((org-agenda-overriding-header "\n⚡ Do Today\n┄┄┄┄┄┄┄┄┄┄")
               (org-agenda-remove-tags t)
               (org-agenda-prefix-format " %-2i %-15b")
               (org-agenda-todo-keyword-format "")))
        (agenda ""
                ((org-agenda-start-day "+0d")
                 (org-agenda-span 5)
                 (org-agenda-overriding-header "⚡ Schedule\n┄┄┄┄┄┄┄┄┄┄")
                 (org-agenda-repeating-timestamp-show-all nil)
                 (org-agenda-remove-tags t)
                 (org-agenda-prefix-format   "  %-3i  %-15b %t%s")
                 (org-agenda-todo-keyword-format " ☐ ")
                 (org-agenda-current-time-string "⮜┈┈┈┈┈┈┈ now")
                 (org-agenda-scheduled-leaders '("" ""))
                 (org-agenda-time-grid (quote ((daily today remove-match)
                                               (0900 1200 1500 1800 2100)
                                               "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈")))))))))
#+end_src

