index.html

<li><a id="orgdc35bed"></a>Views<br />
<div class="outline-text-6" id="text-5-2-4-8-2">
<p>
The key to exploring open work are the agenda views. These
provide a landscape to list, filter or manipulate
tasks. <code>org-agenda-custom-commands</code> defines which views are
available by default.
</p>

<p>
Adapted from <a href="https://github.com/fniessen/emacs-leuven/blob/master/lisp/org-leuven-agenda-views.txt">org-leuven-agenda-views.txt</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Reset everything to nil</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-agenda-custom-commands nil<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"o"</span> <span style="color: #3e999f;">"My Agenda"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"TODO"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"\n&#9889; Do Today\n&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;"</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-remove-tags t<span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-prefix-format <span style="color: #3e999f;">" %-2i %-15b"</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-todo-keyword-format <span style="color: #3e999f;">""</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>agenda <span style="color: #3e999f;">""</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-start-day <span style="color: #3e999f;">"+0d"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-span 5<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"&#9889; Schedule\n&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-repeating-timestamp-show-all nil<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-remove-tags t<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-prefix-format   <span style="color: #3e999f;">"  %-3i  %-15b %t%s"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-todo-keyword-format <span style="color: #3e999f;">" &#9744; "</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-current-time-string <span style="color: #3e999f;">"&#11164;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480; now"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-scheduled-leaders '<span style="color: #eab700;">(</span><span style="color: #3e999f;">""</span> <span style="color: #3e999f;">""</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-time-grid <span style="color: #eab700;">(</span><span style="color: #718c00;">quote</span> <span style="color: #718c00;">(</span><span style="color: #4d4d4c;">(</span>daily today remove-match<span style="color: #4d4d4c;">)</span>
                                             <span style="color: #4d4d4c;">(</span>0900 1200 1500 1800 2100<span style="color: #4d4d4c;">)</span>
                                             <span style="color: #3e999f;">"      "</span> <span style="color: #3e999f;">"&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;&#9480;"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
