Readme.org
****** Focus

The /focus/ section builds up views to help focus on tasks. The
dispatcher starts with an =f=.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("f" . "FOCUS...") t))
#+end_src

The /today/ focus view unfolds like a compass guiding through the day's
tasks, presenting a constellation of sections aimed at pinpointing the
most crucial endeavors to tackle next.

In the calendar section, a mosaic of diary entries and timestamps for
today awaits exploration, offering a glimpse into the rhythm of the
day.

The inbox section beckons with its array of unscheduled top-level
items, each a potential gem awaiting processing. Here lie tasks in
need of scheduling, refining, or simply bringing to completion.

For those with deadlines looming, the due today and overdue sections
serve as a stark reminder, listing tasks teetering on the edge of
time. They demand attention, beckoning to be brought to fruition.

Meanwhile, the scheduled section offers a glimpse into the near
future, showcasing the tasks slated for today, like eager performers
awaiting their cue.

Lastly, the completed section stands as a testament to progress, a
growing archive of triumphs marked by tasks conquered. As the week
unfolds, this section burgeons, reflecting the journey traversed and
milestones achieved.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     `("f." "Today"
       ((agenda ""
                ((org-agenda-entry-types '(:timestamp :sexp))
                 (org-agenda-overriding-header
                  (concat "CALENDAR Today "
                          (format-time-string "%a %d" (current-time))))
                 (org-agenda-span 'day)))
        (tags-todo "LEVEL=1+inbox"
                   ((org-agenda-overriding-header "INBOX (Unscheduled)")))
        (tags-todo "DEADLINE<\"<+1d>\"+DEADLINE>\"<-1d>\""
                   ((org-agenda-overriding-header "DUE TODAY")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))
                    (org-agenda-sorting-strategy '(priority-down))))
        (tags-todo "DEADLINE<\"<today>\""
                   ((org-agenda-overriding-header "OVERDUE")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))
                    (org-agenda-sorting-strategy '(priority-down))))
        (agenda ""
                ((org-agenda-entry-types '(:scheduled))
                 (org-agenda-overriding-header "SCHEDULED")
                 (org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-sorting-strategy
                  '(priority-down time-down))
                 (org-agenda-span 'day)
                 (org-agenda-start-on-weekday nil)))
        (todo "DONE"
              ((org-agenda-overriding-header "COMPLETED"))))
       ((org-agenda-format-date "")
        (org-agenda-start-with-clockreport-mode nil))) t))
#+end_src

The hotlist keeps a focus on tasks that may be heating up. This has
three sections: overdue tasks, ones due within a week, and anything
marked FLAGGED.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("fh" "Hotlist"
       ((tags-todo "DEADLINE<\"<+0d>\""
                   ((org-agenda-overriding-header "OVERDUE")))
        (tags-todo "DEADLINE>=\"<+0d>\"+DEADLINE<=\"<+1w>\""
                   ((org-agenda-overriding-header "DUE IN NEXT 7 DAYS")))
        (tags-todo "DEADLINE=\"\"+FLAGGED|DEADLINE>\"<+1w>\"+FLAGGED"
                   ((org-agenda-overriding-header "FLAGGED"))))
       ((org-agenda-todo-ignore-scheduled 'future)
        (org-agenda-sorting-strategy '(deadline-up)))) t))
#+end_src

Finally the /Hot & Fast/ view assembles tasks into three sections:
overdue, take less then 1 hour, or a score of 1.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("ff" "Hot & Fast"
       ((tags-todo "DEADLINE<\"<+0d>\""
                   ((org-agenda-overriding-header "OVERDUE")))
        (tags-todo "Effort={.}+Effort<\"1:00\""
                   ((org-agenda-overriding-header "QUICK")))
        (tags-todo "SCORE=1"
                   ((org-agenda-overriding-header "EASY"))))) t))
#+end_src

