index.html

<li><a id="orged52216"></a>Focus<br />
<div class="outline-text-7" id="text-5-2-4-8-2-2">
<p>
The <i>focus</i> section builds up views to help focus on tasks. The
dispatcher starts with an <code>f</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"f"</span> . <span style="color: #3e999f;">"FOCUS..."</span><span style="color: #eab700;">)</span> t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The <i>today</i> focus view unfolds like a compass guiding through the
day's tasks, presenting a constellation of sections aimed at
pinpointing the most crucial endeavors to tackle next.
</p>

<p>
In the calendar section, a mosaic of diary entries and
timestamps for today awaits exploration, offering a glimpse
into the rhythm of the day.
</p>

<p>
The inbox section beckons with its array of unscheduled
top-level items, each a potential gem awaiting processing. Here
lie tasks in need of scheduling, refining, or simply bringing
to completion.
</p>

<p>
For those with deadlines looming, the due today and overdue
sections serve as a stark reminder, listing tasks teetering on
the edge of time. They demand attention, beckoning to be
brought to fruition.
</p>

<p>
Meanwhile, the scheduled section offers a glimpse into the near
future, showcasing the tasks slated for today, like eager
performers awaiting their cue.
</p>

<p>
Lastly, the completed section stands as a testament to
progress, a growing archive of triumphs marked by tasks
conquered. As the week unfolds, this section burgeons,
reflecting the journey traversed and milestones achieved.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   `<span style="color: #eab700;">(</span><span style="color: #3e999f;">"f."</span> <span style="color: #3e999f;">"Today"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>agenda <span style="color: #3e999f;">""</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-entry-types '<span style="color: #eab700;">(</span><span style="color: #8959a8;">:timestamp</span> <span style="color: #8959a8;">:sexp</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-overriding-header
                <span style="color: #eab700;">(</span>concat <span style="color: #3e999f;">"CALENDAR Today "</span>
                        <span style="color: #718c00;">(</span>format-time-string <span style="color: #3e999f;">"%a %d"</span> <span style="color: #4d4d4c;">(</span>current-time<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-span 'day<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"LEVEL=1+inbox"</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"INBOX (Unscheduled)"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&lt;\"&lt;+1d&gt;\"+DEADLINE&gt;\"&lt;-1d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE TODAY"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy '<span style="color: #eab700;">(</span>priority-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&lt;\"&lt;today&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"OVERDUE"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy '<span style="color: #eab700;">(</span>priority-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>agenda <span style="color: #3e999f;">""</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-entry-types '<span style="color: #eab700;">(</span><span style="color: #8959a8;">:scheduled</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"SCHEDULED"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-skip-function
                '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'todo 'done<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy
                '<span style="color: #eab700;">(</span>priority-down time-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-span 'day<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-start-on-weekday nil<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"DONE"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"COMPLETED"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-format-date <span style="color: #3e999f;">""</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-clockreport-mode nil<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>

<p>
The hotlist keeps a focus on tasks that may be heating up. This
has three sections: overdue tasks, ones due within a week, and
anything marked FLAGGED.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"fh"</span> <span style="color: #3e999f;">"Hotlist"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&lt;\"&lt;+0d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"OVERDUE"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&gt;=\"&lt;+0d&gt;\"+DEADLINE&lt;=\"&lt;+1w&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE IN NEXT 7 DAYS"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE=\"\"+FLAGGED|DEADLINE&gt;\"&lt;+1w&gt;\"+FLAGGED"</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"FLAGGED"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-todo-ignore-scheduled 'future<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-sorting-strategy '<span style="color: #4d4d4c;">(</span>deadline-up<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>

<p>
Finally the <i>Hot &amp; Fast</i> view assembles tasks into three
sections: overdue, take less then 1 hour, or a score of 1.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"ff"</span> <span style="color: #3e999f;">"Hot &amp; Fast"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&lt;\"&lt;+0d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"OVERDUE"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"Effort={.}+Effort&lt;\"1:00\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"QUICK"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"SCORE=1"</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"EASY"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>
</div>
</li>
