Readme.org
****** Review

After processing incoming items and focusing on some work, there is
the step of reviewing to ensure that progress is being made in the
right spots.

The set of views start on the =r= key.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("r" . "REVIEW...") t))
#+end_src

On a weekly basis, the view (=rw=) prvides a look back and look forward
for all tasks.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("rw" "Weekly review"
       ((tags "{INBOX}&LEVEL<=2"
              ((org-agenda-overriding-header "NEW TASKS")))
        (agenda ""
                ((org-agenda-clockreport-mode t)
                 (org-agenda-format-date
                  (concat "\n"
                          "%Y-%m-%d" " %a "
                          (make-string (window-width) ?_)))
                 (org-agenda-overriding-header "PAST WEEK")
                 (org-agenda-prefix-format " %?-11t %i %-12:c% s")
                 (org-agenda-show-log 'clockcheck)
                 (org-agenda-span 7)
                 (org-deadline-warning-days 0)))
        (agenda ""
                ((org-agenda-overriding-header "NEXT MONTH")
                 (org-agenda-span 'month)
                 (org-agenda-start-day "+0d")
                 (org-deadline-warning-days 0)))
        (todo "PROJECT"
              ((org-agenda-overriding-header "PROJECT LIST")))
        (todo "DONE|PROJECTDONE"
              ((org-agenda-overriding-header
                "Candidates to be archived"))))) t))
#+end_src

