index.html

<li><a id="org3860f7d"></a>Review<br />
<div class="outline-text-7" id="text-5-2-4-8-2-3">
<p>
After processing incoming items and focusing on some work,
there is the step of reviewing to ensure that progress is being
made in the right spots.
</p>

<p>
The set of views start on the <code>r</code> key.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"r"</span> . <span style="color: #3e999f;">"REVIEW..."</span><span style="color: #eab700;">)</span> t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
On a weekly basis, the view (<code>rw</code>) prvides a look back and look
forward for all tasks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rw"</span> <span style="color: #3e999f;">"Weekly review"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>tags <span style="color: #3e999f;">"{INBOX}&amp;LEVEL&lt;=2"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"NEW TASKS"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>agenda <span style="color: #3e999f;">""</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-clockreport-mode t<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-format-date
                <span style="color: #eab700;">(</span>concat <span style="color: #3e999f;">"\n"</span>
                        <span style="color: #3e999f;">"%Y-%m-%d"</span> <span style="color: #3e999f;">" %a "</span>
                        <span style="color: #718c00;">(</span>make-string <span style="color: #4d4d4c;">(</span>window-width<span style="color: #4d4d4c;">)</span> ?_<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"PAST WEEK"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-prefix-format <span style="color: #3e999f;">" %?-11t %i %-12:c% s"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-show-log 'clockcheck<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-span 7<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-start-day <span style="color: #3e999f;">"-1w"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-deadline-warning-days 0<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>agenda <span style="color: #3e999f;">""</span>
              <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"NEXT MONTH"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-span 'month<span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-agenda-start-day <span style="color: #3e999f;">"+0d"</span><span style="color: #3e999f;">)</span>
               <span style="color: #3e999f;">(</span>org-deadline-warning-days 0<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"PROJECT"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"PROJECT LIST"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"DONE|PROJECTDONE"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header
              <span style="color: #3e999f;">"Candidates to be archived"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
