Readme.org
******* All Tasks

The first review section is for all tasks and launchable via =ra=.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("ra" . "All Tasks...") t))
#+end_src

The first view lists tasks grouped by due dates.  The sections of this
view list tasks that are overdue, due today, due tomorrow, due within
a week, due within a month, due later, waiting for, and tasks without
a due date.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("rad" "All Tasks (grouped by Due Date)"
       ((tags-todo "DEADLINE<\"<+0d>\""
                   ((org-agenda-overriding-header "OVERDUE")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "DEADLINE=\"<+0d>\""
                   ((org-agenda-overriding-header "DUE TODAY")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "DEADLINE=\"<+1d>\""
                   ((org-agenda-overriding-header "DUE TOMORROW")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "DEADLINE>\"<+1d>\"+DEADLINE<=\"<+7d>\""
                   ((org-agenda-overriding-header "DUE WITHIN A WEEK")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "DEADLINE>\"<+7d>\"+DEADLINE<=\"<+28d>\""
                   ((org-agenda-overriding-header "DUE WITHIN A MONTH")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "DEADLINE>\"<+28d>\""
                   ((org-agenda-overriding-header "DUE LATER")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'notdeadline))))
        (tags-todo "TODO={WAIT}"
                   ((org-agenda-overriding-header "WAITING FOR")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'deadline))))
        (todo ""
              ((org-agenda-overriding-header "NO DUE DATE")
               (org-agenda-skip-function
                '(org-agenda-skip-entry-if 'deadline)))))
       ((org-agenda-sorting-strategy '(priority-down))
        (org-agenda-write-buffer-name "All Tasks (grouped by Due Date)"))
       "~/Documents/Org/all-tasks-by-due-date.pdf") t))
#+end_src

Hitting =ra1= lists all tasks (with a due date) by due date.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("ra1" "All Tasks with a due date" alltodo ""
       ((org-agenda-overriding-header "All Tasks (sorted by Due Date)")
        (org-agenda-skip-function
         '(org-agenda-skip-entry-if 'notdeadline))
        (org-agenda-sorting-strategy '(deadline-up)))) t))
#+end_src


#+begin_src emacs-lisp
  (defconst bnb/org-completed-date-regexp
    (concat " \\("
            "CLOSED: \\[%Y-%m-%d"
            "\\|"
            "- State \"\\(DONE\\)\" * from .* \\[%Y-%m-%d"
            "\\|"
            "- State .* ->  *\"\\(DONE\\)\" * \\[%Y-%m-%d"
            "\\) ")
    "Matches any completion time stamp.")

  (defun current-time-ndays-ago (n)
    "Return the current time minus N days."
    (time-subtract (current-time) (days-to-time n)))

  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     `("rac" "Completed view"
       ((todo "TODO|DONE"
              ((org-agenda-overriding-header
                (format "YESTERDAY [%s]" (format-time-string "%a %d" (current-time-ndays-ago 1))))
               (org-agenda-skip-function
                '(org-agenda-skip-entry-if
                  'notregexp
                  (format-time-string bnb/org-completed-date-regexp (current-time-ndays-ago 1))))
               (org-agenda-sorting-strategy '(priority-down))))
        (todo "TODO|DONE"
              ((org-agenda-overriding-header
                (format "2 DAYS AGO [%s]" (format-time-string "%a %d" (current-time-ndays-ago 2))))
               (org-agenda-skip-function
                '(org-agenda-skip-entry-if
                  'notregexp
                  (format-time-string bnb/org-completed-date-regexp (current-time-ndays-ago 2))))
               (org-agenda-sorting-strategy '(priority-down))))
        (todo "TODO|DONE"
              ((org-agenda-overriding-header
                (format "3 DAYS AGO [%s]" (format-time-string "%a %d" (current-time-ndays-ago 3))))
               (org-agenda-skip-function
                '(org-agenda-skip-entry-if
                  'notregexp
                  (format-time-string bnb/org-completed-date-regexp (current-time-ndays-ago 3))))
               (org-agenda-sorting-strategy '(priority-down)))))
       ((org-agenda-format-date "")
        (org-agenda-start-with-clockreport-mode nil)))))
#+end_src

