index.html
<li><a id="org5872e64"></a>All Tasks<br />
<div class="outline-text-8" id="text-5-2-4-8-2-3-1">
<p>
The first review section is for all tasks and launchable via
<code>ra</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"ra"</span> . <span style="color: #3e999f;">"All Tasks..."</span><span style="color: #eab700;">)</span> t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The first view lists tasks grouped by due dates.  The sections
of this view list tasks that are overdue, due today, due
tomorrow, due within a week, due within a month, due later,
waiting for, and tasks without a due date.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rad"</span> <span style="color: #3e999f;">"All Tasks (grouped by Due Date)"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&lt;\"&lt;+0d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"OVERDUE"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE=\"&lt;+0d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE TODAY"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE=\"&lt;+1d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE TOMORROW"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&gt;\"&lt;+1d&gt;\"+DEADLINE&lt;=\"&lt;+7d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE WITHIN A WEEK"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&gt;\"&lt;+7d&gt;\"+DEADLINE&lt;=\"&lt;+28d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE WITHIN A MONTH"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"DEADLINE&gt;\"&lt;+28d&gt;\""</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DUE LATER"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>tags-todo <span style="color: #3e999f;">"TODO={WAIT}"</span>
                 <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"WAITING FOR"</span><span style="color: #3e999f;">)</span>
                  <span style="color: #3e999f;">(</span>org-agenda-skip-function
                   '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'deadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">""</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"NO DUE DATE"</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-skip-function
              '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if 'deadline<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-sorting-strategy '<span style="color: #4d4d4c;">(</span>priority-down<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-write-buffer-name <span style="color: #3e999f;">"All Tasks (grouped by Due Date)"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #3e999f;">"~/Documents/Org/all-tasks-by-due-date.pdf"</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>

<p>
Hitting <code>ra1</code> lists all tasks (with a due date) by due date.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"ra1"</span> <span style="color: #3e999f;">"All Tasks with a due date"</span> alltodo <span style="color: #3e999f;">""</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"All Tasks (sorted by Due Date)"</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-skip-function
       '<span style="color: #4d4d4c;">(</span>org-agenda-skip-entry-if 'notdeadline<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-sorting-strategy '<span style="color: #4d4d4c;">(</span>deadline-up<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>



<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defconst</span> <span style="color: #eab700;">bnb/org-completed-date-regexp</span>
  <span style="color: #3e999f;">(</span>concat <span style="color: #3e999f;">" </span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">"</span>
          <span style="color: #3e999f;">"CLOSED: \\[%Y-%m-%d"</span>
          <span style="color: #3e999f;">"</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">|</span><span style="color: #3e999f;">"</span>
          <span style="color: #3e999f;">"- State \"</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">DONE</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">\" * from .* \\[%Y-%m-%d"</span>
          <span style="color: #3e999f;">"</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">|</span><span style="color: #3e999f;">"</span>
          <span style="color: #3e999f;">"- State .* -&gt;  *\"</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">(</span><span style="color: #3e999f;">DONE</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;">\" * \\[%Y-%m-%d"</span>
          <span style="color: #3e999f;">"</span><span style="color: #eab700;">\\</span><span style="color: #8959a8;">)</span><span style="color: #3e999f;"> "</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Matches any completion time stamp."</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">current-time-ndays-ago</span> <span style="color: #3e999f;">(</span>n<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Return the current time minus N days."</span>
  <span style="color: #3e999f;">(</span>time-subtract <span style="color: #eab700;">(</span>current-time<span style="color: #eab700;">)</span> <span style="color: #eab700;">(</span>days-to-time n<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   `<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rac"</span> <span style="color: #3e999f;">"Completed view"</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"TODO|DONE"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header
              <span style="color: #eab700;">(</span>format <span style="color: #3e999f;">"YESTERDAY [%s]"</span> <span style="color: #718c00;">(</span>format-time-string <span style="color: #3e999f;">"%a %d"</span> <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 1<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-skip-function
              '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if
                'notregexp
                <span style="color: #718c00;">(</span>format-time-string bnb/org-completed-date-regexp <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 1<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy '<span style="color: #eab700;">(</span>priority-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"TODO|DONE"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header
              <span style="color: #eab700;">(</span>format <span style="color: #3e999f;">"2 DAYS AGO [%s]"</span> <span style="color: #718c00;">(</span>format-time-string <span style="color: #3e999f;">"%a %d"</span> <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 2<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-skip-function
              '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if
                'notregexp
                <span style="color: #718c00;">(</span>format-time-string bnb/org-completed-date-regexp <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 2<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy '<span style="color: #eab700;">(</span>priority-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>todo <span style="color: #3e999f;">"TODO|DONE"</span>
            <span style="color: #4d4d4c;">(</span><span style="color: #3e999f;">(</span>org-agenda-overriding-header
              <span style="color: #eab700;">(</span>format <span style="color: #3e999f;">"3 DAYS AGO [%s]"</span> <span style="color: #718c00;">(</span>format-time-string <span style="color: #3e999f;">"%a %d"</span> <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 3<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-skip-function
              '<span style="color: #eab700;">(</span>org-agenda-skip-entry-if
                'notregexp
                <span style="color: #718c00;">(</span>format-time-string bnb/org-completed-date-regexp <span style="color: #4d4d4c;">(</span>current-time-ndays-ago 3<span style="color: #4d4d4c;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
             <span style="color: #3e999f;">(</span>org-agenda-sorting-strategy '<span style="color: #eab700;">(</span>priority-down<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-format-date <span style="color: #3e999f;">""</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-clockreport-mode nil<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
