Readme.org
******* Timesheets

As part of a review, timesheets (reachable at =rt=) illustrate where the
time went.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     '("rt" . "Timesheet...") t))
#+end_src

The first timesheet is a daily one that includes the logged tasks and
a clockreport.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    ;; Show what happened today.
    (add-to-list
     'org-agenda-custom-commands
     '("rtd" "Daily Timesheet" agenda ""
       ((org-agenda-log-mode-items '(clock closed))
        (org-agenda-overriding-header "DAY TIMESHEET")
        (org-agenda-show-log '(clock closed clockcheck))
        (org-agenda-span 'day)
        (org-agenda-start-with-clockreport-mode t)
        (org-agenda-start-with-log-mode t)
        (org-agenda-time-grid nil))) t))
#+end_src

Naturally, the level up from a daily timesheet is a weekly timesheet
(reachable via =rtw=).

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    ;; Show what happened this week.
    (add-to-list
     'org-agenda-custom-commands
     '("rtw" "Weekly Timesheet" agenda ""
       (
        ;; (org-agenda-format-date "")
        (org-agenda-overriding-header "WEEKLY TIMESHEET")
        (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp))
        (org-agenda-span 'week)
        (org-agenda-log-mode-items '(closed clock))
        (org-agenda-show-log '(closed clock))
        (org-agenda-start-on-weekday 1)
        (org-agenda-start-with-clockreport-mode t)
        (org-agenda-start-with-log-mode t)
        (org-agenda-time-grid '(weekly)))) t))
#+end_src

**** Export

The following sections configue global export settings that make
sense for HTML and \LaTeX.

***** HTML

For HTML, I just want to inline the links to images.

#+begin_src emacs-lisp
  (setq org-export-html-inline-images t)
#+end_src

I suppress the postamble with [[help:org-html-postamble][org-html-postamble]].

#+begin_src emacs-lisp
  (setq org-html-postamble nil)
#+end_src

I'll use the /fancy/ HTML5 export by default.

#+begin_src emacs-lisp
  (setq org-html-doctype "html5"
        org-html-html5-fancy t)
#+end_src

Striped tables are nice in email, but this is terribly difficult due
to cruddy CSS support. Luckily, [[https://orgmode.org/manual/Tables-in-HTML-export.html][org-html-table-row-tags]] saves the day
and assigns the right classes to the table rows with a little bit of
help. This makes styling correct in CSS-reduced instances.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-html-table-row-tags
          (cons '(cond (top-row-p "<tr class=\"tr-top\">")
                       (bottom-row-p "<tr class=\"tr-bottom\">")
                       (t (if (= (mod row-number 2) 1)
                              "<tr class=\"tr-odd\">"
                            "<tr class=\"tr-even\">")))
                "</tr>")))
#+end_src

***** LaTeX

For \LaTeX, I want to convert fragments to images, and use [[https://ctan.org/pkg/minted?lang=en][minted]] for
any source blocks. I also want to have [[https://en.wikipedia.org/wiki/XeTeX][XeTeX]] as the backend.

#+begin_src emacs-lisp
  (setq org-export-latex-listings 'engraved
        org-export-latex-custom-lang-environments
        '((emacs-lisp "common-lispcode"))
        org-highlight-latex-and-related '(latex script entities)
        org-latex-pdf-process
        '("tectonic -c minimal -X compile -o %o %f"))
#+end_src

***** Tufte

Other contributed org-mode exporters require activiation to show up in
the export menus. This exporter stylizes =html= in a beautiful way.

#+begin_src emacs-lisp
  (use-package ox-tufte
    :after org-mode
    :ensure t)
#+end_src

***** Github Flavored Markdown

Useful on its own, but required for the [[*Slack][Slack]] exporter, the [[https://github.com/larstvei/ox-gfm][GFM]]
exporter transforms the current orgmode buffer into markdown (yuck).

#+begin_src emacs-lisp
  (use-package ox-gfm
    :after org-mode
    :ensure (ox-gfm :depth nil :version (lambda (x) "1.0")))
#+end_src

