index.html


<li><a id="orgf92e01d"></a>Timesheets<br />
<div class="outline-text-8" id="text-5-2-4-8-2-3-2">
<p>
As part of a review, timesheets (reachable at <code>rt</code>) illustrate
where the time went.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rt"</span> . <span style="color: #3e999f;">"Timesheet..."</span><span style="color: #eab700;">)</span> t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The first timesheet is a daily one that includes the logged
tasks and a clockreport.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Show what happened today.</span>
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rtd"</span> <span style="color: #3e999f;">"Daily Timesheet"</span> agenda <span style="color: #3e999f;">""</span>
     <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>org-agenda-log-mode-items '<span style="color: #4d4d4c;">(</span>clock closed<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"DAY TIMESHEET"</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-show-log '<span style="color: #4d4d4c;">(</span>clock closed clockcheck<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-span 'day<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-clockreport-mode t<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-log-mode t<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-time-grid nil<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>

<p>
Naturally, the level up from a daily timesheet is a weekly
timesheet (reachable via <code>rtw</code>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Show what happened this week.</span>
  <span style="color: #3e999f;">(</span>add-to-list
   'org-agenda-custom-commands
   '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"rtw"</span> <span style="color: #3e999f;">"Weekly Timesheet"</span> agenda <span style="color: #3e999f;">""</span>
     <span style="color: #718c00;">(</span>
      <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">(org-agenda-format-date "")</span>
      <span style="color: #4271ae;">(</span>org-agenda-overriding-header <span style="color: #3e999f;">"WEEKLY TIMESHEET"</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-skip-function '<span style="color: #4d4d4c;">(</span>org-agenda-skip-entry-if 'timestamp<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-span 'week<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-log-mode-items '<span style="color: #4d4d4c;">(</span>closed clock<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-show-log '<span style="color: #4d4d4c;">(</span>closed clock<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-on-weekday 1<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-clockreport-mode t<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-start-with-log-mode t<span style="color: #4271ae;">)</span>
      <span style="color: #4271ae;">(</span>org-agenda-time-grid '<span style="color: #4d4d4c;">(</span>weekly<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span> <span style="color: #c82829; font-weight: bold;">t</span><span style="color: #3e999f; font-weight: bold;">)</span><span style="color: #4d4d4c; font-weight: bold;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="org5110414"></a>Export<br />
<div class="outline-text-5" id="text-5-2-4-9">
<p>
THe following sections configue global export settings that make
sense for HTML and \LaTeX.
</p>
</div>

<ol class="org-ol">
<li><a id="org4e31bac"></a>HTML<br />
<div class="outline-text-6" id="text-5-2-4-9-1">
<p>
For HTML, I just want to inline the links to images.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-export-html-inline-images t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
I suppress the postamble with <code>org-export-html-postamble</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-html-postamble nil<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
I'll use the <i>fancy</i> HTML5 export by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-html-doctype <span style="color: #3e999f;">"html5"</span>
      org-html-html5-fancy t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Striped tables are nice in email, but this is terribly difficult
due to cruddy CSS support. Luckily, <code>org-html-table-row-tags</code>
saves the day and assigns the right classes to the table rows
with a little bit of help. This makes styling correct in
CSS-reduced instances.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-html-table-row-tags
      <span style="color: #3e999f;">(</span>cons '<span style="color: #eab700;">(</span>cond <span style="color: #718c00;">(</span>top-row-p <span style="color: #3e999f;">"&lt;tr class=\"tr-top\"&gt;"</span><span style="color: #718c00;">)</span>
                   <span style="color: #718c00;">(</span>bottom-row-p <span style="color: #3e999f;">"&lt;tr class=\"tr-bottom\"&gt;"</span><span style="color: #718c00;">)</span>
                   <span style="color: #718c00;">(</span>t <span style="color: #4271ae;">(</span><span style="color: #718c00;">if</span> <span style="color: #4d4d4c;">(</span>= <span style="color: #3e999f;">(</span>mod row-number 2<span style="color: #3e999f;">)</span> 1<span style="color: #4d4d4c;">)</span>
                          <span style="color: #3e999f;">"&lt;tr class=\"tr-odd\"&gt;"</span>
                        <span style="color: #3e999f;">"&lt;tr class=\"tr-even\"&gt;"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
            <span style="color: #3e999f;">"&lt;/tr&gt;"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3f57971"></a>LaTeX<br />
<div class="outline-text-6" id="text-5-2-4-9-2">
<p>
For \LaTeX, I want to convert fragments to images, and use
<a href="https://ctan.org/pkg/minted?lang=en">minted</a> for any source blocks. I also want to have <a href="https://en.wikipedia.org/wiki/XeTeX">XeTeX</a> as the
backend.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-export-latex-listings 'minted
      org-export-latex-custom-lang-environments
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>emacs-lisp <span style="color: #3e999f;">"common-lispcode"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
      org-export-latex-minted-options '<span style="color: #3e999f;">()</span>
      org-highlight-latex-and-related '<span style="color: #3e999f;">(</span>latex script entities<span style="color: #3e999f;">)</span>
      org-latex-to-pdf-process
      '<span style="color: #3e999f;">(</span><span style="color: #3e999f;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #3e999f;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #3e999f;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge942bad"></a>Tufte<br />
<div class="outline-text-6" id="text-5-2-4-9-3">
<p>
Other contributed org-mode exporters require activiation to show
up in the export menus. This exporter stylizes <code>html</code> in a
beautiful way.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ox-tufte</span>
  <span style="color: #8959a8;">:after</span> org-mode
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org4a8809a"></a>Github Flavored Markdown<br />
<div class="outline-text-6" id="text-5-2-4-9-4">
<p>
Useful on its own, but required for the <a href="#org98bbea6">Slack</a> exporter, the <a href="https://github.com/larstvei/ox-gfm">GFM</a>
exporter transforms the current orgmode buffer into markdown
(yuck).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ox-gfm</span>
  <span style="color: #8959a8;">:after</span> org-mode
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
