Readme.org
***** Slack

[[https://github.com/titaniumbones/ox-slack][This exporter]] is not added to the export dispatcher, but provides
functions to copy the text into the clipboard or open a buffer with
the markdown.

#+begin_src emacs-lisp
  (use-package ox-slack
    :after (ox-gfm org-mode)
    :bind
    (:map org-mode-map
          ("C-c e c" . org-slack-export-to-clipboard-as-slack)
          ("C-c e b" . org-slack-export-as-slack))
    :ensure t)
#+end_src

**** Clocking

I have found clocking to be useful in understanding where my time
goes. And Org makes this easy, fast, and painless to do.

The clock has some general settings around persistence (resuming
clocks), history length and resuming a task after clocking in twice
(interrupted task).

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (org-clock-persistence-insinuate)
   (setq org-clock-history-length 28
         org-clock-in-resume t))
#+end_src

Behavior of the clock can change to accommodate other needs. I like
having clocks log into a specific drawer. Also, it is nice to remove
zero-time clocks and clock out automatically when an item completes.

#+begin_src emacs-lisp
  (setq org-clock-into-drawer "CLOCK"
        org-clock-out-remove-zero-time-clocks t
        org-clock-out-when-done t)
#+end_src

Two settings help resolve most clock issues that I have
seen. Persisting the clock across sessions helps prevent loss of time
by accident. Auto-resolution of open clocks help prompt how to handle
the situation where a dangling clock exists.

#+begin_src emacs-lisp
  (setq org-clock-persist 'history
        org-clock-auto-clock-resolution 'when-no-clock-is-running)
#+end_src

Two final settings regarding clocking configure how I change and view
the clocks. I want any clock reports to include the currently clocked
task as well. And for clock editing, I change to 15 minute increments.

#+begin_src emacs-lisp
  (setq org-clock-report-include-clocking-task t
        org-time-stamp-rounding-minutes '(1 15))
#+end_src

**** Modules

Org-modules allow for specific functionality within org-mode. These
modules (plugins) activate by adding them to the list of [[help:org-modules][org-modules]].

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (mapc (lambda (x) (add-to-list 'org-modules x t))
          '(org-id
            org-habit
            org-plot
            org-protocol
            ol-bookmark)))
#+end_src

***** Global Ids

By enabling the =org-id= module, =org= will use globally unique
identifiers for entries.

***** Habit

Some tasks repeat, but you still want to log when you have done it. I
use this to help me always do my weekly or yearly reviews. By
including it in =org-modules=, habits get activated.

My one setting blow sets a width for the graph in Agenda View.

#+begin_src emacs-lisp
  (setq org-habit-graph-column 50)
#+end_src

To view habits in the agenda (not just on today), try =C-u K=.

To ensure that a task is treated as a /habit/, the =STYLE= property will
have to be set to =habit=.  [[info:org#Tracking your habits][Read more in the manual]].

***** Org protocol

External applications can have actions in =org-mode= through the use of
protocols. A popular usage is accepting bookmarks from browsers. [[info:org#Protocols][Read
more about it in the manual]].

***** Bookmarks

The org linking system is powerful in the way it can connect to many
part of Emacs. This module enables links to any stored bookmark.

**** Babel

Babel is some serious magic for Org files. It enables tangled code
blocks (this file), notebook-style interactive documents, delarative
diagrams, and nicely-formatted examples.

Each code block can have a different language and be edited remotely
in a properly mode'd buffer.

This is the list of languages I like to have enabled for use.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((calc       . t)
      (C          . t)
      (ditaa      . t)
      (dot        . t)
      (emacs-lisp . t)
      (gnuplot    . t)
      (latex      . t)
      (maxima     . t)
      (perl       . t)
      (plantuml   . t)
      (python     . t)
      (ruby       . t)
      (shell      . t)
      (sqlite     . t)
      (sql        . t)
      (R          . t))))
#+end_src

***** Extra Babel Packages

These two packages assist with making HTTP requets. They can act like
an alternative to Postman.

#+begin_src emacs-lisp
  (use-package ob-http :after org-mode
    :ensure t)

  (use-package ob-restclient
    :after org-mode
    :ensure (ob-restclient :host github :repo "alf/ob-restclient.el")
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     (append org-babel-load-languages '((restclient . t)))))
#+end_src

