index.html

<li><a id="org98bbea6"></a>Slack<br />
<div class="outline-text-6" id="text-5-2-4-9-5">
<p>
<a href="https://github.com/titaniumbones/ox-slack">This exporter</a> is not added to the export dispatcher, but
provides functions to copy the text into the clipboard or open a
buffer with the markdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ox-slack</span>
  <span style="color: #8959a8;">:after</span> <span style="color: #3e999f;">(</span>ox-gfm org-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> org-mode-map
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c e c"</span> . org-slack-export-to-clipboard-as-slack<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c e b"</span> . org-slack-export-as-slack<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="org27b5579"></a>Clocking<br />
<div class="outline-text-5" id="text-5-2-4-10">
<p>
I have found clocking to be useful in understanding where my time
goes. And Org makes this easy, fast, and painless to do.
</p>

<p>
The clock has some general settings around persistence (resuming
clocks), history length and resuming a task after clocking in
twice (interrupted task).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span>org-clock-persistence-insinuate<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-clock-history-length 28
        org-clock-in-resume t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Behavior of the clock can change to accommodate other needs. I
like having clocks log into a specific drawer. Also, it is nice
to remove zero-time clocks and clock out automatically when an
item completes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-clock-into-drawer <span style="color: #3e999f;">"CLOCK"</span>
      org-clock-out-remove-zero-time-clocks t
      org-clock-out-when-done t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Two settings help resolve most clock issues that I have
seen. Persisting the clock across sessions helps prevent loss of
time by accident. Auto-resolution of open clocks help prompt how
to handle the situation where a dangling clock exists.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-clock-persist 'history
      org-clock-auto-clock-resolution 'when-no-clock-is-running<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Two final settings regarding clocking configure how I change and
view the clocks. I want any clock reports to include the
currently clocked task as well. And for clock editing, I change
to 15 minute increments.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-clock-report-include-clocking-task t
      org-time-stamp-rounding-minutes '<span style="color: #3e999f;">(</span>1 15<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd056ea1"></a>Modules<br />
<div class="outline-text-5" id="text-5-2-4-11">
<p>
Org-modules allow for specific functionality within
org-mode. These modules (plugins) activate by adding them to the
list of <code>org-modules</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>mapc <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">(</span>x<span style="color: #718c00;">)</span> <span style="color: #718c00;">(</span>add-to-list 'org-modules x t<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
        '<span style="color: #eab700;">(</span>org-id
          org-habit
          org-plot
          org-protocol
          ol-bookmark<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org196be69"></a>Global Ids<br />
<div class="outline-text-6" id="text-5-2-4-11-1">
<p>
By enabling the <code>org-id</code> module, <code>org</code> will use globally unique
identifiers for entries.
</p>
</div>
</li>

<li><a id="org7dee837"></a>Habit<br />
<div class="outline-text-6" id="text-5-2-4-11-2">
<p>
Some tasks repeat, but you still want to log when you have done
it. I use this to help me always do my weekly or yearly
reviews. By including it in <code>org-modules</code>, habits get activated.
</p>

<p>
My one setting blow sets a width for the graph in Agenda View.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-habit-graph-column 50<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
To view habits in the agenda (not just on today), try <code>C-u K</code>.
</p>

<p>
To ensure that a task is treated as a <i>habit</i>, the <code>STYLE</code> property
will have to be set to <code>habit</code>.  <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Tracking-your-habits">Read more in the manual</a>.
</p>
</div>
</li>

<li><a id="org6d783ec"></a>Org protocol<br />
<div class="outline-text-6" id="text-5-2-4-11-3">
<p>
External applications can have actions in <code>org-mode</code> through the
use of protocols. A popular usage is accepting bookmarks from
browsers. <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Protocols">Read more about it in the manual</a>.
</p>
</div>
</li>

<li><a id="org596a344"></a>Bookmarks<br />
<div class="outline-text-6" id="text-5-2-4-11-4">
<p>
The org linking system is powerful in the way it can connect to
many part of Emacs. This module enables links to any stored
bookmark.
</p>
</div>
</li>
</ol>
</li>

<li><a id="orge34f2e9"></a>Babel<br />
<div class="outline-text-5" id="text-5-2-4-12">
<p>
Babel is some serious magic for Org files. It enables tangled
code blocks (this file), notebook-style interactive documents,
delarative diagrams, and nicely-formatted examples.
</p>

<p>
Each code block can have a different language and be edited
remotely in a properly mode'd buffer.
</p>

<p>
This is the list of languages I like to have enabled for use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span>org-babel-do-load-languages
   'org-babel-load-languages
   '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>calc       . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>C          . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>ditaa      . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>dot        . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>emacs-lisp . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>gnuplot    . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>latex      . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>maxima     . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>perl       . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>plantuml   . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>python     . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>ruby       . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>shell      . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>sqlite     . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>sql        . t<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span>R          . t<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org713c489"></a>Extra Babel Packages<br />
<div class="outline-text-6" id="text-5-2-4-12-1">
<p>
These two packages assist with making HTTP requets. They can act
like an alternative to Postman.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ob-http</span> <span style="color: #8959a8;">:after</span> org-mode
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">ob-restclient</span>
  <span style="color: #8959a8;">:after</span> org-mode
  <span style="color: #8959a8;">:ensure</span> <span style="color: #3e999f;">(</span>ob-restclient <span style="color: #8959a8;">:host</span> github <span style="color: #8959a8;">:repo</span> <span style="color: #3e999f;">"alf/ob-restclient.el"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>org-babel-do-load-languages
   'org-babel-load-languages
   <span style="color: #eab700;">(</span>append org-babel-load-languages '<span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>restclient . t<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
