Readme.org
***** Customization

Python needs to find the right executable, so I hard code what babel
should use for a command.

#+begin_src emacs-lisp
  (setq org-babel-python-command "python3")
#+end_src

**** Miscellaneous Settings

This section holds important small preferences for Org.

***** Auto-revert mode

If the org files are under DVCS like git, then the edits may happen
while open in emacs.

This is a global setting, but most useful for the org files that
exists elsewhere.

#+begin_src emacs-lisp
  (use-package autorevert
    :ensure nil
    :defer 10
    :diminish " "
    :custom
    (global-auto-revert-mode t))
#+end_src

***** Automatically save org files

I like to save early and often. In earlier versions of orgmode, I
sometimes had the capture buffer/timer crash on me. So, now I save at
the top of every hour to be sure.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (run-at-time "00:59" 3600 'org-save-all-org-buffers))
#+end_src

***** Columns

The default columns are as follows. In English, it shows the item (or
task), the score, the effort estimate, and the current clock sum (time
already spent).

#+begin_src emacs-lisp
  (setq
   org-columns-default-format
   "%80ITEM(Task) %5Score{+} %10Effort(Effort){:} %10CLOCKSUM")
#+end_src

***** Display settings

There are a collection of settings that define how the headlines,
subtrees, and notes render.

For the headline stars, there are two settings of note. I am explicit
that I do *not* want only odd levels. I also like to hide the leading
stars.

#+begin_src emacs-lisp
  (setq org-odd-levels-only nil
        org-hide-leading-stars nil)
#+end_src

Cycling the headline states can produce different views of the
files. I like this to be as compact as possible, so I try to squash
the lines between the collapsed trees. There is also a flag to open a
file collapsed. This I like too -- I get a compact view of the file
and can jump to a relevant section with =C-c C-j=.

#+begin_src emacs-lisp
  (setq org-cycle-separator-lines 0
        org-startup-folded 'content)
#+end_src

When using SRC-blocks, org can provide highlighting native to the SRC
type. Note that this may slow down some files.

#+begin_src emacs-lisp
  (setq org-src-fontify-natively t)
#+end_src

For regular usage, subscripts interpolation is too aggressive. Ensure
that subscripts only show when I use the brackets.

#+begin_src emacs-lisp
  (setq org-use-sub-superscripts "{}")
#+end_src

For images, I want them to be limited to the window width upon
toggling. The default is `fill-column` which can be too small.
#+begin_src emacs-lisp
  (setq org-image-max-width 'window)
#+end_src

***** File Applications

This list lets org know how to handle the links of given file
types. Most things open inside =emacs=, but the others set to default
rely on the OS to supply a program.

#+begin_src emacs-lisp
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.x?html?\\'" . default)
          ("\\.pdf\\'"     . default)
          ("\\.mm\\'"      . default)))
#+end_src

***** Goto Interface

By using =C-c C-j=, you can jump easily around a large orgfile
such as this one. Naturally, the interface you use to do so is
customizable.

I explicitly set it to the default because I sometimes go back
and forth with the default and =outline-path-completion= setting.

#+begin_src emacs-lisp
  (setq org-goto-interface 'outline-path)
#+end_src

***** IDO Integration

IDO integrates well into orgmode. Anytime completion is necessary, I
like to use the IDO mechanics.

The =outline-path-completion= may conflict with IDO, so then it is best
to have it not use IDO in this case.

#+begin_src emacs-lisp
  (setq org-completion-use-ido t
        org-outline-path-complete-in-steps nil)
#+end_src

***** Insertion

I define when org should leave a blank line before an item. In my case
it is headings and plain list items.

#+begin_src emacs-lisp
  (setq org-blank-before-new-entry
        '((heading)
          (plain-list-item)))
#+end_src

Also, when inserting a new heading, do so after the current subtree.

#+begin_src emacs-lisp
  (setq org-insert-heading-respect-content t)
#+end_src

***** Plantuml

Ensure that we use the correct execution mode. The default is =jar=
which uses Java directly, but as long as the executable is present
(thanks =brew=!) then the correct mode is =plantuml= to use the executable
instead.

#+begin_src emacs-lisp
  (setq org-plantuml-exec-mode 'plantuml)
#+end_src

***** Properties

Here I add my global properties. The appendix =_ALL= indicates to
the system that these are the values avaialble for completion
for each of these properties.

#+begin_src emacs-lisp
  (setq org-global-properties
        '(("STYLE_ALL"  . "habit")
          ("Effort_ALL" . "0:10 0:30 1:00 2:00 3:00 4:00")
          ("Score_ALL"  . "1 2 3 5 8")))
#+end_src

