index.html

<li><a id="orgf27911f"></a>Customization<br />
<div class="outline-text-6" id="text-5-2-4-12-2">
<p>
Python needs to find the right executable, so I hard code what babel
should use for a command.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-babel-python-command <span style="color: #3e999f;">"python3"</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="org38ae6d1"></a>Miscellaneous Settings<br />
<div class="outline-text-5" id="text-5-2-4-13">
<p>
This section holds important small preferences for Org.
</p>
</div>

<ol class="org-ol">
<li><a id="org087de9c"></a>Auto-revert mode<br />
<div class="outline-text-6" id="text-5-2-4-13-1">
<p>
If the org files are under DVCS like git, then the edits may
happen while open in emacs.
</p>

<p>
This is a global setting, but most useful for the org files that
exists elsewhere.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">autorevert</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:defer</span> 10
  <span style="color: #8959a8;">:diminish</span> <span style="color: #3e999f;">" "</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>global-auto-revert-mode t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd493050"></a>Automatically save org files<br />
<div class="outline-text-6" id="text-5-2-4-13-2">
<p>
I like to save early and often. In earlier versions of orgmode, I
sometimes had the capture buffer/timer crash on me. So, now I
save at the top of every hour to be sure.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'org
  <span style="color: #3e999f;">(</span>run-at-time <span style="color: #3e999f;">"00:59"</span> 3600 'org-save-all-org-buffers<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7e6136d"></a>Columns<br />
<div class="outline-text-6" id="text-5-2-4-13-3">
<p>
The default columns are as follows. In English, it shows the
item (or task), the score, the effort estimate, and the current
clock sum (time already spent).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span>
 org-columns-default-format
 <span style="color: #3e999f;">"%80ITEM(Task) %5Score{+} %10Effort(Effort){:} %10CLOCKSUM"</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9c8c3b7"></a>Display settings<br />
<div class="outline-text-6" id="text-5-2-4-13-4">
<p>
There are a collection of settings that define how the
headlines, subtrees, and notes render.
</p>

<p>
For the headline stars, there are two settings of note. I am
explicit that I do <b>not</b> want only odd levels. I also like to hide
the leading stars.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-odd-levels-only nil
      org-hide-leading-stars nil<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Cycling the headline states can produce different views of the
files. I like this to be as compact as possible, so I try to
squash the lines between the collapsed trees. There is also a
flag to open a file collapsed. This I like too &#x2013; I get a
compact view of the file and can jump to a relevant section with
<code>C-c C-j</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-cycle-separator-lines 0
      org-startup-folded 'content<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
When using SRC-blocks, org can provide highlighting native to
the SRC type. Note that this may slow down some files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-src-fontify-natively t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7410493"></a>File Applications<br />
<div class="outline-text-6" id="text-5-2-4-13-5">
<p>
This list lets org know how to handle the links of given file
types. Most things open inside <code>emacs</code>, but the others set to
default rely on the OS to supply a program.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-file-apps
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>auto-mode . emacs<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.x?html?\\'"</span> . default<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.pdf\\'"</span>     . default<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.mm\\'"</span>      . default<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org1dbfeb6"></a>Goto Interface<br />
<div class="outline-text-6" id="text-5-2-4-13-6">
<p>
By using <code>C-c C-j</code>, you can jump easily around a large orgfile
such as this one. Naturally, the interface you use to do so is
customizable.
</p>

<p>
I explicitly set it to the default because I sometimes go back
and forth with the default and <code>outline-path-completion</code> setting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-goto-interface 'outline-path<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org882c7ad"></a>IDO Integration<br />
<div class="outline-text-6" id="text-5-2-4-13-7">
<p>
IDO integrates well into orgmode. Anytime completion is
necessary, I like to use the IDO mechanics.
</p>

<p>
The <code>outline-path-completion</code> may conflict with IDO, so then it is
best to have it not use IDO in this case.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-completion-use-ido t
      org-outline-path-complete-in-steps nil<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgfff1fbf"></a>Insertion<br />
<div class="outline-text-6" id="text-5-2-4-13-8">
<p>
I define when org should leave a blank line before an
item. In my case it is headings and plain list items.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-blank-before-new-entry
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span>heading<span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span>plain-list-item<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Also, when inserting a new heading, do so after the current
subtree.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-insert-heading-respect-content t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Set the indentation to the outline node level.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-adapt-indentation t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org6f7add0"></a>Plantuml<br />
<div class="outline-text-6" id="text-5-2-4-13-9">
<p>
Setup the path for orgmode to find the jar needed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-plantuml-jar-path <span style="color: #3e999f;">"/usr/local/Cellar/plantuml/1.2017.18/libexec/plantuml.jar"</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org6ecaf65"></a>Properties<br />
<div class="outline-text-6" id="text-5-2-4-13-10">
<p>
Here I add my global properties. The appendix <code>_ALL</code> indicates to
the system that these are the values avaialble for completion
for each of these properties.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-global-properties
      '<span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"STYLE_ALL"</span>  . <span style="color: #3e999f;">"habit"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"Effort_ALL"</span> . <span style="color: #3e999f;">"0:10 0:30 1:00 2:00 3:00 4:00"</span><span style="color: #eab700;">)</span>
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"Score_ALL"</span>  . <span style="color: #3e999f;">"1 2 3 5 8"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
