Readme.org
***** Special Control Keys

Org has a different idea of some of the default emacs commands to make
it easier to work with the structures involved.

For =C-a= or =C-e= within a headline, it will only try to navigate the
headline text the first time. Additional keypresses will move to the
true beginning/ending of lines.

=C-k= also can behave specially in headlines depending on its
location. When point is at the beginning, it will kill the headline
and the folded subtree below. In the middle of a headline, it kills
the headline text up to the tags. After the headline text, it kills
the tags.

#+begin_src emacs-lisp
  (setq org-special-ctrl-a/e t
        org-special-ctrl-k t)
#+end_src

**** Pretty Org-mode

This collection of settings enhances the visual appeal when working in
org-mode.

First, some initial built-in settings to make.This block styles the
headlines to hide the stars, and fontify them. The next setting hides
emphasis markers on words. And finally, entities are drawn with UTF-8
characters.

#+begin_src emacs-lisp
  (setq org-hide-leading-stars t
        org-fontify-done-headline t
        org-hide-emphasis-markers t
        org-pretty-entities t)
#+end_src

Using [[*Prettify Symbols][Prettify]], I add these symbols to make the structure of org-mode
files cleaner to read. In the list, the strings on the left are
replaced by the elements on the right. Moving a cursor over the
symbols will show them in their original form.

#+begin_src emacs-lisp
  (bnb/prettify
   "org-mode"
   '(("#+BEGIN_SRC" . "⌈")
     ("#+END_SRC"   . "⌊")
     ("#+begin_src" . "⌈")
     ("#+end_src"   . "⌊")
     (">="          . "≥")
     ("=>"          . "⇨")))
#+end_src

***** Org Bullets

Bullet shapes do a better job conveying depth then just position/depth
of stars. This snippet loads the package and sets the list of bullets
to use.

#+begin_src emacs-lisp
  (use-package org-bullets
    :ensure t
    :custom
    (org-bullets-bullet-list '("◉" "◊" "○" "⧫" "✸" "⬨" "⬟" "⬧" "⬢" "⬫" "⌑" "⬪" "▱"))
    (org-ellipsis "˯") ;; Options: ˯⇂↯⤵🠻🢗
    :hook (org-mode . org-bullets-mode))
#+end_src

**** Org-AI

As much as I find this to be ridiculous, interacting with AI via Emacs
is likely the one true way. [[https://github.com/rksm/org-ai][Org-ai]] provides a natrual interface for
real humans.

#+begin_src emacs-lisp
  (use-package org-ai
    :ensure t
    :defer t
    :commands (org-ai-mode
               org-ai-global-mode)
    :init
    (org-ai-global-mode) ; installs global keybindings on C-c M-a
    :custom
    (org-ai-default-chat-model "gpt-3.5-turbo")
    :config
    (org-ai-install-yasnippets))
#+end_src

This adds the ability to have =#+begin/end_ai= blocks to have a
"conversation" with ChatGPT or DALL⋅E. Be sure to set
[[help:org-ai-openai-api-token][org-ai-openai-api-token]] to your API token before using.

**** Org Repo Todo                                                  :PENDING:

Make it easy to setup a =TODO.org= from within a repo. I use this to
capture thoughts while coding.

#+begin_src emacs-lisp
  (use-package org-repo-todo
    :ensure t
    :bind (("s-;" . ort/capture-todo)
           ("s-'" . ort/capture-checkitem)
           ("s-`" . ort/goto-todos)))
#+end_src

**** Org Ref

Setups the Org-style interface with Biblio.
#+begin_src emacs-lisp
  (use-package org-ref
    :defer 10
    :config
    (setq org-ref-notes-directory "~/Documents/Personal/Org/Biblio/"
          org-ref-bibliography-notes "~/Documents/Personal/Org/Biblio/index.org"
          org-ref-default-bibliography '("~/Documents/Personal/Org/Biblio/index.bib")
          org-ref-pdf-directory "~/Documents/Personal/Org/Biblio/lib"))
#+end_src

**** Org Noter

[[https://github.com/weirdNox/org-noter][Taking notes in a PDF]] is a useful trick. =org-noter= lets me do just
that.

#+begin_src emacs-lisp
  (use-package org-noter
    :ensure t
    :bind ("H-n" . org-noter))
#+end_src

