index.html

<li><a id="org3a8e894"></a>Special Control Keys<br />
<div class="outline-text-6" id="text-5-2-4-13-11">
<p>
Org has a different idea of some of the default emacs commands
to make it easier to work with the structures involved.
</p>

<p>
For <code>C-a</code> or <code>C-e</code> within a headline, it will only try to navigate
the headline text the first time. Additional keypresses will
move to the true beginning/ending of lines.
</p>

<p>
<code>C-k</code> also can behave specially in headlines depending on its
location. When point is at the beginning, it will kill the
headline and the folded subtree below. In the middle of a
headline, it kills the headline text up to the tags. After the
headline text, it kills the tags.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-special-ctrl-a/e t
      org-special-ctrl-k t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="org5490aa3"></a>Pretty Org-mode<br />
<div class="outline-text-5" id="text-5-2-4-14">
<p>
This collection of settings enhances the visual appeal when
working in org-mode.
</p>

<p>
First, some initial built-in settings to make.This block styles
the headlines to hide the stars, and fontify them. The next
setting hides emphasis markers on words. And finally, entities
are drawn with UTF-8 characters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> org-hide-leading-stars t
      org-fontify-done-headline t
      org-hide-emphasis-markers t
      org-pretty-entities t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
Using <a href="#org650eab9">Prettify</a>, I add these symbols to make the structure of
org-mode files cleaner to read. In the list, the strings on the
left are replaced by the elements on the right. Moving a cursor
over the symbols will show them in their original form.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>add-hook
 'org-mode-hook
 <span style="color: #3e999f;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #eab700;">()</span>
   <span style="color: #eab700;">(</span>mapc <span style="color: #718c00;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #4271ae;">(</span>pair<span style="color: #4271ae;">)</span> <span style="color: #4271ae;">(</span><span style="color: #718c00;">push</span> pair prettify-symbols-alist<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         '<span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span><span style="color: #3e999f;">"#+BEGIN_SRC"</span> . <span style="color: #3e999f;">"&#8968;"</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"#+END_SRC"</span> . <span style="color: #3e999f;">"&#8970;"</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"#+begin_src"</span> . <span style="color: #3e999f;">"&#8968;"</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"#+end_src"</span> . <span style="color: #3e999f;">"&#8970;"</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"&gt;="</span> . <span style="color: #3e999f;">"&#8805;"</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"=&gt;"</span> . <span style="color: #3e999f;">"&#8680;"</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org64c38eb"></a>Org Bullets<br />
<div class="outline-text-6" id="text-5-2-4-14-1">
<p>
Bullet shapes do a better job conveying depth then just
position/depth of stars. This snippet loads the package and sets
the list of bullets to use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-bullets</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>org-bullets-bullet-list '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"&#9673;"</span> <span style="color: #3e999f;">"&#9674;"</span> <span style="color: #3e999f;">"&#9675;"</span> <span style="color: #3e999f;">"&#10731;"</span> <span style="color: #3e999f;">"&#10040;"</span> <span style="color: #3e999f;">"&#11048;"</span> <span style="color: #3e999f;">"&#11039;"</span> <span style="color: #3e999f;">"&#11047;"</span> <span style="color: #3e999f;">"&#11042;"</span> <span style="color: #3e999f;">"&#11051;"</span> <span style="color: #3e999f;">"&#8977;"</span> <span style="color: #3e999f;">"&#11050;"</span> <span style="color: #3e999f;">"&#9649;"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>org-ellipsis <span style="color: #3e999f;">"&#751;"</span><span style="color: #3e999f;">)</span> <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Options: &#751;&#8642;&#8623;&#10549;&#129083;&#129175;</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span>org-mode . org-bullets-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orgee3b79a"></a>Org-AI<br />
<div class="outline-text-5" id="text-5-2-4-15">
<p>
As much as I find this to be ridiculous, interacting with AI via
Emacs is likely the one true way. <a href="https://github.com/rksm/org-ai">Org-ai</a> provides a natrual
interface for real humans.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-ai</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>org-ai-mode
             org-ai-global-mode<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>org-ai-global-mode<span style="color: #3e999f;">)</span> <span style="color: #8e908c; font-style: italic;">; </span><span style="color: #8e908c; font-style: italic;">installs global keybindings on C-c M-a</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>org-ai-default-chat-model <span style="color: #3e999f;">"gpt-3.5-turbo"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>org-ai-install-yasnippets<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
This adds the ability to have <code>#+begin/end_ai</code> blocks to have a
"conversation" with ChatGPT or DALL⋅E. Be sure to set
<code>org-ai-openai-api-token</code> to your API token before using.
</p>
</div>
</li>

<li><a id="org08e4ba4"></a>Org Repo Todo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span><br />
<div class="outline-text-5" id="text-5-2-4-16">
<p>
Make it easy to setup a <code>TODO.org</code> from within a repo. I use this
to capture thoughts while coding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-repo-todo</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"s-;"</span> . ort/capture-todo<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s-'"</span> . ort/capture-checkitem<span style="color: #eab700;">)</span>
         <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s-`"</span> . ort/goto-todos<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd2f5d63"></a>Org Ref<br />
<div class="outline-text-5" id="text-5-2-4-17">
<p>
Setups the Org-style interface with Biblio.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-ref</span>
  <span style="color: #8959a8;">:defer</span> 10
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-ref-notes-directory <span style="color: #3e999f;">"~/Documents/Personal/Org/Biblio/"</span>
        org-ref-bibliography-notes <span style="color: #3e999f;">"~/Documents/Personal/Org/Biblio/index.org"</span>
        org-ref-default-bibliography '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"~/Documents/Personal/Org/Biblio/index.bib"</span><span style="color: #eab700;">)</span>
        org-ref-pdf-directory <span style="color: #3e999f;">"~/Documents/Personal/Org/Biblio/lib"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org4dbd0e4"></a>Org Noter<br />
<div class="outline-text-5" id="text-5-2-4-18">
<p>
<a href="https://github.com/weirdNox/org-noter">Taking notes in a PDF</a> is a useful trick. <code>org-noter</code> lets me do
just that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-noter</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-n"</span> . org-noter<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
