Readme.org
**** Org Roam

The best of all worlds? Org-mode and a Zettelkasten system? Yes,
[[https://www.orgroam.com/][Org-roam]] sets up a knowledge capture and organization system built on
the principles of [[https://en.wikipedia.org/wiki/Zettelkasten][Zettelkasten]].

#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :after org
    :delight " 𝕫"
    :hook
    (after-init . org-roam-setup)
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory (file-truename "~/Documents/Org/zettel/"))
    :bind
    (("C-c n f" . org-roam-node-find)
     ("C-c n r" . org-roam-node-random)
     ("C-c n g" . org-roam-graph)
     ("C-c n c" . org-roam-capture)
     ("C-c n j" . org-roam-dailies-capture-today)
     (:map org-mode-map
           (("C-c n l" . org-roam-buffer-toggle)
            ("C-c n a" . org-roam-alias-add)
            ("C-c n i" . org-roam-node-insert)
            ("C-c n I" . org-roam-insert-immediate)))
     (:map org-roam-mode-map
           (("C-c n l" . org-roam)
            ("C-c n t" . org-roam-dailies-find-today)
            ("C-c n w" . org-roam-dailies-find-tomorrow)
            ("C-c n d" . org-roam-date)
            ("C-c n f" . org-roam-find-file)
            ("C-c n g" . org-roam-show-graph)))))
#+end_src

**** Org QL                                                         :PENDING:

The Org Query Language helps walk through a builder interface to find,
filter, and sort org entries.

#+begin_src emacs-lisp
  (use-package org-ql
    :after org
    :commands (org-ql-search org-ql-view-sidebar)
    :bind
    ("C-c q s" . org-ql-search)
    ("C-c q b" . org-ql-view-sidebar)
    ("C-c q v" . org-ql-view)
    ("C-c q t" . org-ql-sparse-tree)
    ("C-c q r" . org-ql-view-recent-items)
    (:map org-mode-map
          ("C-c q f" . org-ql-find))
    :ensure t
    :demand t)
#+end_src

This package is built on a library of searching functions, so it also
has some neat tricks like easily specifying agenda views and building
code blocks.

For example, to get a link to a dynamic list of pending items (in this
file), click on this: [[org-ql-search:tags:PENDING]].

*** PDF Tools

This replaces the built-in DocView for PDF files. Find out the
details [[https://pdftools.wiki/][on the wiki]].

The part that I like over DocView is the ability to add
annotations. They all live on =C-c C-a=.

| Key       | Action                   |
|-----------+--------------------------|
| =C-c C-a D= | delete annotation        |
| =C-c C-a a= | attachment dired         |
| =C-c C-a h= | add highlight            |
| =C-c C-a l= | list annotations         |
| =C-c C-a m= | add markup               |
| =C-c C-a o= | add strikeout annotation |
| =C-c C-a s= | add squiggly annotation  |
| =C-c C-a t= | add text annotation      |
| =C-c C-a u= | add underline annotation |


#+begin_src emacs-lisp
  (defcustom bnb/homebrew-prefix ""
    "Prefix to use for an alternative path to homebrew items"
    :type 'string
    :group 'bnb)

  (setenv "PKG_CONFIG_PATH"
          (let ((hbp bnb/homebrew-prefix))
            (setq pdf-info-epdfinfo-program (concat hbp "/usr/local/bin/epdfinfo"))
            (mapconcat
             'identity
             (list (concat hbp "/usr/local/Cellar/libffi/3.2.1/lib/pkgconfig")
                   (concat hbp "/usr/local/Cellar/zlib/1.2.8/lib/pkgconfig")
                   (concat hbp "/usr/local/lib/pkgconfig")
                   "/opt/X11/lib/pkgconfig")
             ":")))

  (use-package pdf-tools
    :defer t
    :ensure t
    :config
    (custom-set-variables '(pdf-tools-handle-upgrades nil))
    (setq-default pdf-view-display-size 'fit-page)
    (pdf-loader-install))
#+end_src

*** Polymode                                                        :PENDING:

#+begin_src emacs-lisp
  (use-package poly-markdown
    :ensure t)
#+end_src
*** Typst                                                           :PENDING:

#+begin_src emacs-lisp
  (use-package typst-ts-mode
    :ensure (:type git :host sourcehut :repo "meow_king/typst-ts-mode" :files (:defaults "*.el"))
    :custom
    ;; (optional) If you want to ensure your typst tree sitter grammar version is greater than the minimum requirement
    ;; Note this only check and compare file modification time
    (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory)))
#+end_src

** Miscellaneous

This sections holds configuration details for some of the
uncategorized major modes.

