index.html

<li><a id="org8cbce5c"></a>Org Roam<br />
<div class="outline-text-5" id="text-5-2-4-19">
<p>
The best of all worlds? Org-mode and a Zettelkasten system? Yes,
<a href="https://www.orgroam.com/">Org-roam</a> sets up a knowledge capture and organization system
built on the principles of <a href="https://en.wikipedia.org/wiki/Zettelkasten">Zettelkasten</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-roam</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:after</span> org
  <span style="color: #8959a8;">:delight</span> <span style="color: #3e999f;">"&#8201;&#120171;"</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>after-init . org-roam-setup<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> org-roam-v2-ack t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>org-roam-directory <span style="color: #eab700;">(</span>file-truename <span style="color: #3e999f;">"~/Documents/Org/zettel/"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c n f"</span> . org-roam-node-find<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c n r"</span> . org-roam-node-random<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c n g"</span> . org-roam-graph<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c n c"</span> . org-roam-capture<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c n j"</span> . org-roam-dailies-capture-today<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #8959a8;">:map</span> org-mode-map
         <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n l"</span> . org-roam-buffer-toggle<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n a"</span> . org-roam-alias-add<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n i"</span> . org-roam-node-insert<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n I"</span> . org-roam-insert-immediate<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #8959a8;">:map</span> org-roam-mode-map
         <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n l"</span> . org-roam<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n t"</span> . org-roam-dailies-find-today<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n w"</span> . org-roam-dailies-find-tomorrow<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n d"</span> . org-roam-date<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n f"</span> . org-roam-find-file<span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span><span style="color: #3e999f;">"C-c n g"</span> . org-roam-show-graph<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgc77c1d9"></a>Org QL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span><br />
<div class="outline-text-5" id="text-5-2-4-20">
<p>
The Org Query Language helps walk through a builder interface to
find, filter, and sort org entries.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">org-ql</span>
  <span style="color: #8959a8;">:after</span> org
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>org-ql-search org-ql-view-sidebar<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c q s"</span> . org-ql-search<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c q b"</span> . org-ql-view-sidebar<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c q v"</span> . org-ql-view<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c q t"</span> . org-ql-sparse-tree<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"C-c q r"</span> . org-ql-view-recent-items<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #8959a8;">:map</span> org-mode-map
        <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-c q f"</span> . org-ql-find<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:demand</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
This package is built on a library of searching functions, so it
also has some neat tricks like easily specifying agenda views and
building code blocks.
</p>

<p>
For example, to get a link to a dynamic list of pending items (in
this file), click on this: <code>tags:PENDING</code>.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org95290c3" class="outline-4">
<h4 id="org95290c3"><span class="section-number-4">5.2.5.</span> PDF Tools</h4>
<div class="outline-text-4" id="text-5-2-5">
<p>
This replaces the built-in DocView for PDF files. Find out the
details <a href="https://pdftools.wiki/">on the wiki</a>.
</p>

<p>
The part that I like over DocView is the ability to add
annotations. They all live on <code>C-c C-a</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Action</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-a D</code></td>
<td class="org-left">delete annotation</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a a</code></td>
<td class="org-left">attachment dired</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a h</code></td>
<td class="org-left">add highlight</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a l</code></td>
<td class="org-left">list annotations</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a m</code></td>
<td class="org-left">add markup</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a o</code></td>
<td class="org-left">add strikeout annotation</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a s</code></td>
<td class="org-left">add squiggly annotation</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a t</code></td>
<td class="org-left">add text annotation</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a u</code></td>
<td class="org-left">add underline annotation</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defcustom</span> <span style="color: #eab700;">bnb/homebrew-prefix</span> <span style="color: #3e999f;">""</span>
  <span style="color: #8959a8;">"Prefix to use for an alternative path to homebrew items"</span>
  <span style="color: #8959a8;">:type</span> 'string
  <span style="color: #8959a8;">:group</span> 'bnb<span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span>setenv <span style="color: #3e999f;">"PKG_CONFIG_PATH"</span>
        <span style="color: #3e999f;">(</span><span style="color: #718c00;">let</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>hbp bnb/homebrew-prefix<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
          <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> pdf-info-epdfinfo-program <span style="color: #718c00;">(</span>concat hbp <span style="color: #3e999f;">"/usr/local/bin/epdfinfo"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
          <span style="color: #eab700;">(</span>mapconcat
           'identity
           <span style="color: #718c00;">(</span>list <span style="color: #4271ae;">(</span>concat hbp <span style="color: #3e999f;">"/usr/local/Cellar/libffi/3.2.1/lib/pkgconfig"</span><span style="color: #4271ae;">)</span>
                 <span style="color: #4271ae;">(</span>concat hbp <span style="color: #3e999f;">"/usr/local/Cellar/zlib/1.2.8/lib/pkgconfig"</span><span style="color: #4271ae;">)</span>
                 <span style="color: #4271ae;">(</span>concat hbp <span style="color: #3e999f;">"/usr/local/lib/pkgconfig"</span><span style="color: #4271ae;">)</span>
                 <span style="color: #3e999f;">"/opt/X11/lib/pkgconfig"</span><span style="color: #718c00;">)</span>
           <span style="color: #3e999f;">":"</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">pdf-tools</span>
  <span style="color: #8959a8;">:defer</span> t
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>custom-set-variables '<span style="color: #eab700;">(</span>pdf-tools-handle-upgrades nil<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> pdf-view-display-size 'fit-page<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>pdf-loader-install<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8bde3a4" class="outline-3">
<h3 id="org8bde3a4"><span class="section-number-3">5.3.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-5-3">
<p>
This sections holds configuration details for some of the
uncategorized major modes.
</p>
</div>
