Readme.org
**** Prog fill

To go from wide lines to vertical, [[https://github.com/ahungry/prog-fill][prog-fill]] comes into the rescue.

#+begin_src emacs-lisp
  ( use-package prog-fill
    :ensure t
    :commands (prog-fill)
    :hook
    (prog-mode . (lambda () (local-set-key (kbd "M-q") #'prog-fill)))
    :bind
    ("H-q" . prog-fill)
    :custom
    (prog-fill-floating-close-paren-p nil)
    (prog-fill-break-method-immediate-p t))
#+end_src

**** Smart Tabs

[[http://www.emacswiki.org/emacs-en/SmartTabs][SmartTabs]] try to do the right thing regarding tabs/spaces in
indentation/alignment. It installs through the package interface. Look
for =smart-tabs-mode=.

By default, I'm enabling it in all modes that I can.

Since we are dealing with tabs here, I also take the time to set the
default width to 4. Because of the way this mode works, any change in
the default width will result in code that still aligns.

#+begin_src emacs-lisp
  (use-package smart-tabs-mode
    :defer 10
    :ensure t
    :init
    (setq-default indent-tabs-mode nil)
    (smart-tabs-insinuate 'c 'cperl 'c++))
#+end_src

***** Notes

To re-tab the whole file, use =C-x h C-M-\=.

**** Treesit

Now built into Emacs 29, Tree-Sitter is a new parsing library. [[https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][Read
more about it online.]] This code sets up the library for Emacs 29 and
greater, and installs come common grammars.

#+begin_src emacs-lisp
  (use-package treesit
    :ensure nil ;; built-in
    :if (version<= "29" emacs-version)
    :init
    (defun bnb/treesit-setup-install-grammars ()
      "Install Tree-sitter grammars if they are absent."
      (interactive)
      (dolist (grammar
               '((css        . ("https://github.com/tree-sitter/tree-sitter-css" "v0.20.0"))
                 (html       . ("https://github.com/tree-sitter/tree-sitter-html" "v0.20.1"))
                 (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript" "v0.20.1" "src"))
                 (json       . ("https://github.com/tree-sitter/tree-sitter-json" "v0.20.2"))
                 (python     . ("https://github.com/tree-sitter/tree-sitter-python" "v0.20.4"))
                 (toml       . ("https://github.com/tree-sitter/tree-sitter-toml" "v0.5.1"))
                 (rust       . ("https://github.com/tree-sitter/tree-sitter-rust" "v0.21.2" "src"))
                 (yaml       . ("https://github.com/ikatyang/tree-sitter-yaml" "v0.5.0"))
                 (typst      . ("https://github.com/uben0/tree-sitter-typst" "v0.11.0"))))
        (add-to-list 'treesit-language-source-alist grammar)
        ;; Only install `grammar' if we don't already have it
        ;; installed. However, if you want to *update* a grammar then
        ;; this obviously prevents that from happening.
        (unless (treesit-language-available-p (car grammar))
          (treesit-install-language-grammar (car grammar)))))

    ;; Optional, but recommended. Tree-sitter enabled major modes are
    ;; distinct from their ordinary counterparts.
    ;;
    ;; You can remap major modes with `major-mode-remap-alist'. Note
    ;; that this does *not* extend to hooks! Make sure you migrate them
    ;; also
    (dolist (mapping
             '((python-mode     . python-ts-mode)
               (css-mode        . css-ts-mode)
               (js2-mode        . js-ts-mode)
               (bash-mode       . bash-ts-mode)
               (css-mode        . css-ts-mode)
               (json-mode       . json-ts-mode)
               (js-json-mode    . json-ts-mode)))
      (add-to-list 'major-mode-remap-alist mapping))
    :config
    (bnb/treesit-setup-install-grammars))
#+end_src

**** Combobulate                                                    :PENDING:

Enable structured editing and movement with [[https://github.com/mickeynp/combobulate][Combobulate]].

#+begin_src emacs-lisp
  (use-package combobulate
    :after treesit
    :if (version<= "29" emacs-version)
    :ensure (combobulate :host github :repo "mickeynp/combobulate")
    :custom
    ;; You can customize Combobulate's key prefix here.
    ;; Note that you may have to restart Emacs for this to take effect!
    (combobulate-key-prefix "C-c o")

    ;; Optional, but recommended.
    ;;
    ;; You can manually enable Combobulate with `M-x
    ;; combobulate-mode'.
    :hook
    ((python-ts-mode . combobulate-mode)
     (js-ts-mode     . combobulate-mode)
     (html-ts-mode   . combobulate-mode)
     (css-ts-mode    . combobulate-mode)
     (yaml-ts-mode   . combobulate-mode)
     (json-ts-mode   . combobulate-mode)))
#+end_src

*** Web Mode

For all of the webish-stuff, this mode works well. Let's enable it
on the right things.

#+begin_src emacs-lisp
  (use-package web-mode
    :defer
    :mode "\\.html\\'"
    :ensure t
    :bind ("H-b" . browse-url-of-file)
    :custom
    (web-mode-markup-indent-offset 2)
    (web-mode-css-indent-offset 2)
    (web-mode-code-indent-offset 2)
    (web-mode-engines-alist '(("handlebars" . "\\.hbs\\'")))
    :config
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'"  . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'"      . web-mode))
    (add-to-list 'auto-mode-alist '("\\.hbs\\'"      . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'"   . web-mode))
    (add-to-list 'auto-mode-alist '("\\.svelte\\'"   . web-mode)))
#+end_src

** Shells

There are two useful shells in emacs: =eshell= and =ansi-term=.

*** Ansi Term

These settings close =ansi-term= when I exit the shell. They also
default to just launching =zsh= instead of asking me (preferred). Then
it closes by setting up a hook to ensure some nice functionality in
the terminal mode window.

#+begin_src emacs-lisp
  (defun bnb/term-mode-hook ()
    "Setup `term-mode`."
    (goto-address-mode)
    (setq-local term-buffer-maximum-size 10000))

  (use-package term
    :ensure nil
    :hook (term-mode . bnb/term-mode-hook)
    :init
    (defalias 'zsh 'ansi-term)
    :custom
    (ansi-term-color-vector
     [term term-color-black term-color-red term-color-green
           term-color-yellow term-color-blue term-color-magenta term-color-cyan
           term-color-white])
    (ansi-color-faces-vector [default bold shadow italic underline bold bold-italic bold]))
#+end_src

My hook above makes it easy to click on links in any output and
protects the buffer from runaway printing.

