index.html

<li><a id="org0cf27f9"></a>Prog fill<br />
<div class="outline-text-5" id="text-5-4-7-2">
<p>
To go from wide lines to vertical, <a href="https://github.com/ahungry/prog-fill">prog-fill</a> comes into the
rescue.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">prog-fill</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>prog-fill<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>prog-mode . <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">()</span> <span style="color: #718c00;">(</span>local-set-key <span style="color: #4271ae;">(</span>kbd <span style="color: #3e999f;">"M-q"</span><span style="color: #4271ae;">)</span> #'prog-fill<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:bind</span>
  <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-q"</span> . prog-fill<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>prog-fill-floating-close-paren-p nil<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>prog-fill-break-method-immediate-p t<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org6f92556"></a>Smart Tabs<br />
<div class="outline-text-5" id="text-5-4-7-3">
<p>
<a href="http://www.emacswiki.org/emacs-en/SmartTabs">SmartTabs</a> try to do the right thing regarding tabs/spaces in
indentation/alignment. It installs through the package interface. Look for
<code>smart-tabs-mode</code>.
</p>

<p>
By default, I'm enabling it in all modes that I can.
</p>

<p>
Since we are dealing with tabs here, I also take the time to set
the default width to 4. Because of the way this mode works, any
change in the default width will result in code that still aligns.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">smart-tabs-mode</span>
  <span style="color: #8959a8;">:defer</span> 10
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-default</span> indent-tabs-mode nil<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>smart-tabs-insinuate 'c 'cperl 'c++<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org7949dbc"></a>Notes<br />
<div class="outline-text-6" id="text-5-4-7-3-1">
<p>
To re-tab the whole file, use <code>C-x h C-M-\</code>.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orga1dcbd6" class="outline-4">
<h4 id="orga1dcbd6"><span class="section-number-4">5.4.8.</span> Web Mode</h4>
<div class="outline-text-4" id="text-5-4-8">
<p>
For all of the webish-stuff, this mode works well. Let's enable it
on the right things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">web-mode</span>
  <span style="color: #8959a8;">:defer</span>
  <span style="color: #8959a8;">:mode</span> <span style="color: #3e999f;">"\\.html\\'"</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:bind</span> <span style="color: #3e999f;">(</span><span style="color: #3e999f;">"H-b"</span> . browse-url-of-file<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>web-mode-markup-indent-offset 2<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>web-mode-css-indent-offset 2<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>web-mode-code-indent-offset 2<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>web-mode-engines-alist '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #3e999f;">"handlebars"</span> . <span style="color: #3e999f;">"\\.hbs\\'"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.[agj]sp\\'"</span>  . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.erb\\'"</span>      . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.hbs\\'"</span>      . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.mustache\\'"</span> . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.djhtml\\'"</span>   . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>add-to-list 'auto-mode-alist '<span style="color: #eab700;">(</span><span style="color: #3e999f;">"\\.svelte\\'"</span>   . web-mode<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf6a7c9a" class="outline-3">
<h3 id="orgf6a7c9a"><span class="section-number-3">5.5.</span> Shells</h3>
<div class="outline-text-3" id="text-5-5">
<p>
There are two useful shells in emacs: <code>eshell</code> and <code>ansi-term</code>.
</p>
</div>

<div id="outline-container-org5afe55e" class="outline-4">
<h4 id="org5afe55e"><span class="section-number-4">5.5.1.</span> Ansi Term</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
These settings close <code>ansi-term</code> when I exit the shell. They also
default to just launching <code>zsh</code> instead of asking me
(preferred). Then it closes by setting up a hook to ensure some
nice functionality in the terminal mode window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/term-mode-hook</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Setup `term-mode`."</span>
  <span style="color: #3e999f;">(</span>goto-address-mode<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq-local</span> term-buffer-maximum-size 10000<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">term</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span>term-mode . bnb/term-mode-hook<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defalias</span> '<span style="color: #f5871f;">zsh</span> 'ansi-term<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>ansi-term-color-vector  <span style="color: #eab700;">[</span>term term-color-black term-color-red term-color-green term-color-yellow term-color-blue term-color-magenta term-color-cyan term-color-white<span style="color: #eab700;">]</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>ansi-color-faces-vector <span style="color: #eab700;">[</span>default bold shadow italic underline bold bold-italic bold<span style="color: #eab700;">]</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>


<p>
My hook above makes it easy to click on links in any output and
protects the buffer from runaway printing.
</p>
</div>
</div>
