Readme.org
*** Eshell

Built-in Eshell can provide a shell that works the same on windows or
GNU/Linux. One of the really cool features is that you can define
commands to use (like aliases) within the shell and have them directly
integrate with emacs.

**** Eshell Settings

Turn off any =$PAGER= settings inherited in the environment. Because
this is running in Emacs, there is no need for a pager.

#+begin_src emacs-lisp
  (setenv "PAGER" "cat")

  (defun bnb/setup-eshell ()
    "Setup functions to run in the eshell hook"
    (eshell/alias "em" "emacs")
    (eshell/alias "ll" "ls -Aloh")
    (pcase system-type
      ('darwin (eshell/alias "llc" "*ls -AlohG"))
      (-       (eshell/alias "llc" "*ls -AlohG --color=always"))))

  (use-package eshell
    :ensure nil
    :commands eshell
    :hook (eshell-mode . bnb/setup-eshell))
#+end_src

**** Eshell Commands

Like many shells, =eshell= allows for the definition of custom commands.
The following settings add extra functionality for command-line use.

Fast fingers are used to typing =emacs= at a prompt to open a file.
This gives the same behavior in =eshell=.

#+begin_src emacs-lisp
  (defun eshell/emacs (&rest args)
    "Open a file in emacs the natural way"
    (if (null args)
        ;; If emacs is called by itself, then just go to emacs directly
        (bury-buffer)
      ;; If opening multiple files with a directory name, e.g.
      ;; > emacs bar/bar.txt foo.txt
      ;; then the names must be expanded to complete file paths.
      ;; Otherwise, find-file will look in the current directory which
      ;; would fail for 'foo.txt' in the example above.
      (mapc #'find-file (mapcar #'expand-file-name (eshell-flatten-list (reverse args))))))
#+end_src

One can also keep the shell active and open files in the other
window. (Mnemonic here is emacs other window)

#+begin_src emacs-lisp
  (defun eshell/emo (&rest args)
    (mapc
     (lambda (f)
       (save-selected-window
         (find-file-other-window f)))
     (mapcar #'expand-file-name (eshell-flatten-list (reverse args)))))
#+end_src

On a windows box, setup grep to be a cygwin version.

#+begin_src emacs-lisp
  (when (eq system-type 'windows-nt)
    (with-eval-after-load "eshell"
      (defun eshell/grep (&rest args)
        (eshell-grep "c:/cygwin/bin/grep.exe" args t))))
#+end_src

For Magit, there are some niceties to add.

#+begin_src emacs-lisp
  (defun eshell/gst (&rest args)
    (magit-status-setup-buffer (pop args))
    (eshell/echo))

  (defun eshell/gd (&rest args)
    (magit-diff-unstaged)
    (eshell/echo))

  (defun eshell/gds (&rest args)
    (magit-diff-staged)
    (eshell/echo))
#+end_src

**** Plan 9 Smart Shells

See [[http://www.masteringemacs.org/article/complete-guide-mastering-eshell][the complete guide to mastering Eshell]] for more on this.
Basically, the cursor stays on the command for editing if necessary.

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (with-eval-after-load 'eshell
     (require 'eshell)
     (require 'em-smart)

     (setq eshell-where-to-jump 'begin
           eshell-review-quick-commands nil
           eshell-smart-space-goes-to-end t)
     (add-hook  'eshell-mode-hook 'eshell-smart-initialize)))
#+end_src

** Visual

This section contains settings and packages relevant to visual
elements. The theming of emacs is in [[*Style][the style section]].

