index.html

<div id="outline-container-orgddf86ed" class="outline-4">
<h4 id="orgddf86ed"><span class="section-number-4">5.5.2.</span> Eshell</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
Built-in Eshell can provide a shell that works the same on windows
or GNU/Linux. One of the really cool features is that you can
define commands to use (like aliases) within the shell and have
them directly integrate with emacs.
</p>
</div>

<ol class="org-ol">
<li><a id="orgee9814d"></a>Eshell Settings<br />
<div class="outline-text-5" id="text-5-5-2-1">
<p>
Turn off any <code>$PAGER</code> settings inherited in the
environment. Because this is running in Emacs, there is no need
for a pager.
</p>

<p>
Then provide a helper functionm to turn off <code>company-mode</code> and add
some convient aliases.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>setenv <span style="color: #3e999f;">"PAGER"</span> <span style="color: #3e999f;">"cat"</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/setup-eshell</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Setup functions to run in the eshell hook"</span>
  <span style="color: #3e999f;">(</span>company-mode -1<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eshell/alias <span style="color: #3e999f;">"em"</span> <span style="color: #3e999f;">"emacs"</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eshell/alias <span style="color: #3e999f;">"ll"</span> <span style="color: #3e999f;">"ls -Aloh"</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">pcase</span> system-type
    <span style="color: #eab700;">(</span>'darwin <span style="color: #718c00;">(</span>eshell/alias <span style="color: #3e999f;">"llc"</span> <span style="color: #3e999f;">"*ls -AlohG"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>-       <span style="color: #718c00;">(</span>eshell/alias <span style="color: #3e999f;">"llc"</span> <span style="color: #3e999f;">"*ls -AlohG --color=always"</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">eshell</span>
  <span style="color: #8959a8;">:ensure</span> nil
  <span style="color: #8959a8;">:commands</span> eshell
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span>eshell-mode . bnb/setup-eshell<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org8753785"></a>Eshell Commands<br />
<div class="outline-text-5" id="text-5-5-2-2">
<p>
Like many shells, <code>eshell</code> allows for the definition of custom
commands.  The following settings add extra functionality for
command-line use.
</p>

<p>
Fast fingers are used to typing <code>emacs</code> at a prompt to open a file.
This gives the same behavior in <code>eshell</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/emacs</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Open a file in emacs the natural way"</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">if</span> <span style="color: #eab700;">(</span>null args<span style="color: #eab700;">)</span>
      <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">If emacs is called by itself, then just go to emacs directly</span>
      <span style="color: #eab700;">(</span>bury-buffer<span style="color: #eab700;">)</span>
    <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">If opening multiple files with a directory name, e.g.</span>
    <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">&gt; emacs bar/bar.txt foo.txt</span>
    <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">then the names must be expanded to complete file paths.</span>
    <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">Otherwise, find-file will look in the current directory which</span>
    <span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">would fail for '</span><span style="color: #4271ae; font-style: italic;">foo.txt</span><span style="color: #8e908c; font-style: italic;">' in the example above.</span>
    <span style="color: #eab700;">(</span>mapc #'find-file <span style="color: #718c00;">(</span>mapcar #'expand-file-name <span style="color: #4271ae;">(</span>eshell-flatten-list <span style="color: #4d4d4c;">(</span>reverse args<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
One can also keep the shell active and open files in the other
window. (Mnemonic here is emacs other window)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/emo</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>mapc
   <span style="color: #eab700;">(</span><span style="color: #718c00;">lambda</span> <span style="color: #718c00;">(</span>f<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #718c00;">save-selected-window</span>
       <span style="color: #4271ae;">(</span>find-file-other-window f<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span>mapcar #'expand-file-name <span style="color: #718c00;">(</span>eshell-flatten-list <span style="color: #4271ae;">(</span>reverse args<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
On a windows box, setup grep to be a cygwin version.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">when</span> <span style="color: #3e999f;">(</span>eq system-type 'windows-nt<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">with-eval-after-load</span> <span style="color: #3e999f;">"eshell"</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/grep</span> <span style="color: #718c00;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>eshell-grep <span style="color: #3e999f;">"c:/cygwin/bin/grep.exe"</span> args t<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
For Magit, there are some niceties to add.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/gst</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>magit-status-setup-buffer <span style="color: #eab700;">(</span><span style="color: #718c00;">pop</span> args<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eshell/echo<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/gd</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>magit-diff-unstaged<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eshell/echo<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">eshell/gds</span> <span style="color: #3e999f;">(</span><span style="color: #4271ae;">&amp;rest</span> args<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>magit-diff-staged<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>eshell/echo<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org6da4551"></a>Plan 9 Smart Shells<br />
<div class="outline-text-5" id="text-5-5-2-3">
<p>
See <a href="http://www.masteringemacs.org/article/complete-guide-mastering-eshell">the complete guide to mastering Eshell</a> for more on this.
Basically, the cursor stays on the command for editing if
necessary.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">with-eval-after-load</span> 'eshell
    <span style="color: #eab700;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">eshell</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">require</span> '<span style="color: #4271ae;">em-smart</span><span style="color: #eab700;">)</span>

    <span style="color: #eab700;">(</span><span style="color: #718c00;">setq</span> eshell-where-to-jump 'begin
          eshell-review-quick-commands nil
          eshell-smart-space-goes-to-end t<span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>add-hook  'eshell-mode-hook 'eshell-smart-initialize<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org67733df" class="outline-3">
<h3 id="org67733df"><span class="section-number-3">5.6.</span> Visual</h3>
<div class="outline-text-3" id="text-5-6">
<p>
This section contains settings and packages relevant to visual
elements. The theming of emacs is in <a href="#orgb8e281c">the style section</a>.
</p>
</div>
