Readme.org
*** Nerd Icons

The set of [[https://github.com/rainstormstudio/nerd-icons.el][nerd icons]] depends on an installed compatible font, but
there are [[https://www.nerdfonts.com/font-downloads][many alternatives]]. Because it is font-based, this will work
graphically and in the terminal.

Be sure to run [[elisp:(nerd-icons-install-fonts)][nerd-icons-install-fonts]] for this to work well.

#+begin_src emacs-lisp
      (use-package nerd-icons
        :ensure t)
#+end_src

**** Icons in Corfu

[[https://github.com/LuigiPiucco/nerd-icons-corfu?tab=readme-ov-file][This package]] adds icons to th [[*Corfu][Corfu]] completion list.

#+begin_src emacs-lisp
  (use-package nerd-icons-corfu
    :after corfu
    :ensure t
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

**** Icons in dired

Setup [[*Dired][dired]] to [[https://github.com/rainstormstudio/nerd-icons-dired][use icons]] next to the file names.

#+begin_src emacs-lisp
  (use-package nerd-icons-dired
    :ensure t
    :hook
    (dired-mode . nerd-icons-dired-mode))
#+end_src

**** Icons in Ibuffer

Add [[https://github.com/seagle0128/nerd-icons-ibuffer][icons]] to [[*IBuffer][ibuffer]].

#+begin_src emacs-lisp
  (use-package nerd-icons-ibuffer
    :ensure t
    :custom
    (nerd-icons-ibuffer-human-readable-size t)
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

**** Icons in completion

[[https://github.com/rainstormstudio/nerd-icons-completion][Use icons]] in the completion systems.

#+begin_src emacs-lisp
  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :hook
    (marginalia-mode . nerd-icons-completion-marginalia-setup)
    :init
    (nerd-icons-completion-mode))
#+end_src

* Style

The following sections describe items that affect the visual elements
of Emacs.

** Frame Changes

These following items make Emacs really beautiful on every
platform. I remove the menu bar, tool bar and the scroll bar for
starters.

#+begin_src emacs-lisp :tangle "~/.emacs.d/early-init.el" :exports code :results silent
  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
#+end_src

** Window Changes

In the fringe area, I like to have markers to show me where the buffer
begins/ends on the right. On the left, I have emacs show little dashes
where empty lines exist.

In the title bar, I have it print the buffer name, full file name and
size.

#+begin_src emacs-lisp
  (setq-default indicate-buffer-boundaries 'right)
  (setq-default indicate-empty-lines t)
  (setq-default frame-title-format '("%b %f %I"))
#+end_src

*** Window Splitting

By default, I usually want to have vertial window splits. The
following settings achieve that.

#+begin_src emacs-lisp
  (setq split-width-threshold 0
        split-height-threshold nil)
#+end_src

** Faces

Emacs [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Faces.html][faces]] are text styled with attributes including font, slant,
weight, color, etc. These sections go over the necessary settings to
make them exactly right in all circumstances.

For configuration and debugging, [[help:list-faces-display][list-faces-display]] is useful.

