index.html

<div id="outline-container-org7bd6e42" class="outline-4">
<h4 id="org7bd6e42"><span class="section-number-4">5.6.1.</span> Nerd Icons</h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
The set of <a href="https://github.com/rainstormstudio/nerd-icons.el">nerd icons</a> depends on an installed compatible font, but
there are <a href="https://www.nerdfonts.com/font-downloads">many alternatives</a>. Because it is font-based, this will
work graphically and in the terminal.
</p>

<p>
Be sure to run <a href="(nerd-icons-install-fonts)">nerd-icons-install-fonts</a> for this to work well.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">nerd-icons</span>
  <span style="color: #8959a8;">:ensure</span> t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orge560824"></a>Icons in Corfu<br />
<div class="outline-text-5" id="text-5-6-1-1">
<p>
<a href="https://github.com/LuigiPiucco/nerd-icons-corfu?tab=readme-ov-file">This package</a> adds icons to th <a href="#orga0077e9">Corfu</a> completion list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">nerd-icons-corfu</span>
  <span style="color: #8959a8;">:after</span> corfu
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9b29dbd"></a>Icons in dired<br />
<div class="outline-text-5" id="text-5-6-1-2">
<p>
Setup <a href="#org85b8584">dired</a> to <a href="https://github.com/rainstormstudio/nerd-icons-dired">use icons</a> next to the file names.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">nerd-icons-dired</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>dired-mode . nerd-icons-dired-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga3ee923"></a>Icons in Ibuffer<br />
<div class="outline-text-5" id="text-5-6-1-3">
<p>
Add <a href="https://github.com/seagle0128/nerd-icons-ibuffer">icons</a> to <a href="#org8b896c7">ibuffer</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">nerd-icons-ibuffer</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>nerd-icons-ibuffer-human-readable-size t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:hook</span> <span style="color: #3e999f;">(</span>ibuffer-mode . nerd-icons-ibuffer-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org13b46de"></a>Icons in completion<br />
<div class="outline-text-5" id="text-5-6-1-4">
<p>
<a href="https://github.com/rainstormstudio/nerd-icons-completion">Use icons</a> in the completion systems.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">nerd-icons-completion</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:after</span> marginalia
  <span style="color: #8959a8;">:hook</span>
  <span style="color: #3e999f;">(</span>marginalia-mode . nerd-icons-completion-marginalia-setup<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>nerd-icons-completion-mode<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orgb8e281c" class="outline-2">
<h2 id="orgb8e281c"><span class="section-number-2">6.</span> Style</h2>
<div class="outline-text-2" id="text-6">
<p>
The following sections describe items that affect the visual
elements of Emacs.
</p>
</div>

<div id="outline-container-orgc84fb0d" class="outline-3">
<h3 id="orgc84fb0d"><span class="section-number-3">6.1.</span> Frame Changes</h3>
<div class="outline-text-3" id="text-6-1">
<p>
These following items make Emacs really beautiful on every
platform. I remove the menu bar, tool bar and the scroll bar for
starters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">if</span> <span style="color: #3e999f;">(</span>fboundp 'menu-bar-mode<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>menu-bar-mode -1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">if</span> <span style="color: #3e999f;">(</span>fboundp 'tool-bar-mode<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>tool-bar-mode -1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">if</span> <span style="color: #3e999f;">(</span>fboundp 'scroll-bar-mode<span style="color: #3e999f;">)</span> <span style="color: #3e999f;">(</span>scroll-bar-mode -1<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge17d4dc" class="outline-3">
<h3 id="orge17d4dc"><span class="section-number-3">6.2.</span> Window Changes</h3>
<div class="outline-text-3" id="text-6-2">
<p>
In the fringe area, I like to have markers to show me where the
buffer begins/ends on the right. On the left, I have emacs show
little dashes where empty lines exist.
</p>

<p>
In the title bar, I have it print the buffer name, full file name
and size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq-default</span> indicate-buffer-boundaries 'right<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq-default</span> indicate-empty-lines t<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq-default</span> frame-title-format '<span style="color: #3e999f;">(</span><span style="color: #3e999f;">"%b %f %I"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org28a3710" class="outline-3">
<h3 id="org28a3710"><span class="section-number-3">6.3.</span> Faces</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Emacs <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Faces.html">faces</a> are text styled with attributes including font, slant,
weight, color, etc. These sections go over the necessary settings
to make them exactly right in all circumstances.
</p>

<p>
For configuration and debugging, <code>list-faces-display</code> is useful.
</p>
</div>
