Readme.org
*** Default Fonts

#+begin_src emacs-lisp
  (with-after-elpaca-init
   (when window-system
     (defun bnb/filter-existing-fonts (fl)
       "Filter the list for only existing fonts"
       (seq-filter #'font-info fl))
     (setq bnb/fontlist
           '("-*-LunarISO Nerd Font-regular-normal-condensed-*-*-*-*-*-p-0-iso10646-1"
             "LunarISO Nerd Font-12"
             "Fira Code-12"
             "Fira Code-13"
             "Source Code Pro-13"
             "Menlo-12"
             "Consolas-12")
           bnb/font-ring
           (ring-convert-sequence-to-ring (seq-filter #'font-info bnb/fontlist))
           bnb/font
           (ring-ref bnb/font-ring 0))
     (defun bnb/font-apply (font)
       "Change the default font to FONT."
       (set-frame-font (setq bnb/font font))
       (message "Set default font to %s" bnb/font))
     (defun bnb/font-next ()
       "Cycle the default font to the next in the ring."
       (interactive)
       (bnb/font-apply (ring-next bnb/font-ring bnb/font)))
     (defun bnb/font-prev ()
       "Cycle the default font to the previous in the ring."
       (interactive)
       (bnb/font-apply (ring-prev bnb/font-ring bnb/font)))
     (set-frame-font bnb/font)
     (bind-keys
      ("H-f" . bnb/font-next)
      ("H-F" . bnb/font-prev))))
#+end_src

*** Unicode                                                         :PENDING:

Support unicode fonts throughout the system. Be sure to [[https://github.com/rolandwalker/unicode-fonts][install
recommended fonts for support]].

#+begin_src emacs-lisp
  (use-package unicode-fonts
    :disabled t
    :ensure t
    :defer 10
    :init
    (unicode-fonts-setup))
#+end_src

*** Trying out fonts on Windows

On Windows, this function shows a font selection screen and sets the
default face. This will not persist between sessions, but is great for
test driving.

#+begin_src emacs-lisp
  (defun bnb/windows-set-font ()
    "Use Windows font selection to set the default font."
    (interactive)
    (set-face-attribute 'default nil :font (w32-select-font)))
#+end_src

*** Dynamic Font sizes

Changing font sizes in presentations is crucial to have at hand. I use
the following keybindings. =C--= overrides the negative argument
function, but that one is also accessible by =M--=.

#+begin_src emacs-lisp
  (defun bnb/change-frame-font-size (fn)
    "Change the frame font size according to function FN."
    (let* ((font-name (frame-parameter nil 'font))
           (decomposed-font-name (x-decompose-font-name font-name))
           (font-size (string-to-number (aref decomposed-font-name 5))))
      (aset decomposed-font-name 5 (int-to-string (funcall fn font-size)))
      (set-frame-font (x-compose-font-name decomposed-font-name))))

  (defun bnb/frame-text-scale-increase ()
    "Increase the frame font size by 1."
    (interactive)
    (bnb/change-frame-font-size '1+))

  (defun bnb/frame-text-scale-decrease ()
    "Decrease the frame font size by 1."
    (interactive)
    (bnb/change-frame-font-size '1-))

  (with-after-elpaca-init
   (bind-keys
    ("C-+" . text-scale-increase)
    ("C--" . text-scale-decrease)
    ("s--" . bnb/frame-text-scale-decrease)
    ("s-+" . bnb/frame-text-scale-increase)
    ("s-=" . bnb/frame-text-scale-increase)))
#+end_src

*** Mode Line Style

I dislike the box around the =mode-line= making it look like a button. I
disable (set to =nil=) the =box= face attribute to get a flat feel. Be
sure to do it to all =mode-line= faces that have this attribute.

#+begin_src emacs-lisp
  (set-face-attribute 'mode-line nil :box nil)
  (set-face-attribute 'mode-line-inactive nil :box nil)
  (set-face-attribute 'mode-line-highlight nil :box nil)
#+end_src

