index.html

<div id="outline-container-orgf9299df" class="outline-4">
<h4 id="orgf9299df"><span class="section-number-4">6.3.1.</span> Default Fonts</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">if</span> window-system
      <span style="color: #eab700;">(</span><span style="color: #718c00;">progn</span>
        <span style="color: #718c00;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/filter-existing-fonts</span> <span style="color: #4271ae;">(</span>fl<span style="color: #4271ae;">)</span>
          <span style="color: #8959a8;">"Filter the list for only existing fonts"</span>
          <span style="color: #4271ae;">(</span>seq-filter #'font-info fl<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span><span style="color: #718c00;">setq</span> bnb/fontlist
              '<span style="color: #4271ae;">(</span><span style="color: #3e999f;">"-*-Lunar Mono-*-expanded-*-12"</span> <span style="color: #3e999f;">"-*-Lunar Mono-*-*-*-12"</span> <span style="color: #3e999f;">"Fira Code-13"</span> <span style="color: #3e999f;">"Source Code Pro-13"</span><span style="color: #4271ae;">)</span>
              bnb/font-ring
              <span style="color: #4271ae;">(</span>ring-convert-sequence-to-ring <span style="color: #4d4d4c;">(</span>seq-filter #'font-info bnb/fontlist<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
              bnb/font
              <span style="color: #4271ae;">(</span>ring-ref bnb/font-ring 0<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/font-apply</span> <span style="color: #4271ae;">(</span>font<span style="color: #4271ae;">)</span>
          <span style="color: #8959a8;">"Change the default font to FONT."</span>
          <span style="color: #4271ae;">(</span>set-frame-font <span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> bnb/font font<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span>message <span style="color: #3e999f;">"Set default font to %s"</span> bnb/font<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/font-next</span> <span style="color: #4271ae;">()</span>
          <span style="color: #8959a8;">"Cycle the default font to the next in the ring."</span>
          <span style="color: #4271ae;">(</span><span style="color: #718c00;">interactive</span><span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span>bnb/font-apply <span style="color: #4d4d4c;">(</span>ring-next bnb/font-ring bnb/font<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/font-prev</span> <span style="color: #4271ae;">()</span>
          <span style="color: #8959a8;">"Cycle the default font to the previous in the ring."</span>
          <span style="color: #4271ae;">(</span><span style="color: #718c00;">interactive</span><span style="color: #4271ae;">)</span>
          <span style="color: #4271ae;">(</span>bnb/font-apply <span style="color: #4d4d4c;">(</span>ring-prev bnb/font-ring bnb/font<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
        <span style="color: #718c00;">(</span>set-frame-font bnb/font<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">bind-keys</span>
     <span style="color: #718c00;">(</span><span style="color: #3e999f;">"H-f"</span> . bnb/font-next<span style="color: #718c00;">)</span>
     <span style="color: #718c00;">(</span><span style="color: #3e999f;">"H-F"</span> . bnb/font-prev<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cb140c" class="outline-4">
<h4 id="org4cb140c"><span class="section-number-4">6.3.2.</span> Unicode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></h4>
<div class="outline-text-4" id="text-6-3-2">
<p>
Support unicode fonts throughout the system. Be sure to <a href="https://github.com/rolandwalker/unicode-fonts">install
recommended fonts for support</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">unicode-fonts</span>
  <span style="color: #8959a8;">:disabled</span> t
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:defer</span> 10
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>unicode-fonts-setup<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org409de2a" class="outline-4">
<h4 id="org409de2a"><span class="section-number-4">6.3.3.</span> Trying out fonts on Windows</h4>
<div class="outline-text-4" id="text-6-3-3">
<p>
On Windows, this function shows a font selection screen and sets
the default face. This will not persist between sessions, but is
great for test driving.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/windows-set-font</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Use Windows font selection to set the default font."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>set-face-attribute 'default nil <span style="color: #8959a8;">:font</span> <span style="color: #eab700;">(</span>w32-select-font<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36a7c13" class="outline-4">
<h4 id="org36a7c13"><span class="section-number-4">6.3.4.</span> Dynamic Font sizes</h4>
<div class="outline-text-4" id="text-6-3-4">
<p>
Changing font sizes in presentations is crucial to have at hand. I
use the following keybindings. <code>C--</code> overrides the negative argument
function, but that one is also accessible by <code>M--</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/change-frame-font-size</span> <span style="color: #3e999f;">(</span>fn<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">"Change the frame font size according to function FN."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">let*</span> <span style="color: #eab700;">(</span><span style="color: #718c00;">(</span>font-name <span style="color: #4271ae;">(</span>frame-parameter nil 'font<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>decomposed-font-name <span style="color: #4271ae;">(</span>x-decompose-font-name font-name<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
         <span style="color: #718c00;">(</span>font-size <span style="color: #4271ae;">(</span>string-to-number <span style="color: #4d4d4c;">(</span>aref decomposed-font-name 5<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>aset decomposed-font-name 5 <span style="color: #718c00;">(</span>int-to-string <span style="color: #4271ae;">(</span>funcall fn font-size<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span>
    <span style="color: #eab700;">(</span>set-frame-font <span style="color: #718c00;">(</span>x-compose-font-name decomposed-font-name<span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/frame-text-scale-increase</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Increase the frame font size by 1."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>bnb/change-frame-font-size '1+<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/frame-text-scale-decrease</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Decrease the frame font size by 1."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>bnb/change-frame-font-size '1-<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>

<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">elpaca</span> nil
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">bind-keys</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C-+"</span> . text-scale-increase<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"C--"</span> . text-scale-decrease<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s--"</span> . bnb/frame-text-scale-decrease<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s-+"</span> . bnb/frame-text-scale-increase<span style="color: #eab700;">)</span>
   <span style="color: #eab700;">(</span><span style="color: #3e999f;">"s-="</span> . bnb/frame-text-scale-increase<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd019de3" class="outline-4">
<h4 id="orgd019de3"><span class="section-number-4">6.3.5.</span> Mode Line Style</h4>
<div class="outline-text-4" id="text-6-3-5">
<p>
I dislike the box around the <code>mode-line</code> making it look like a
button. I disable (set to <code>nil</code>) the <code>box</code> face attribute to get a
flat feel. Be sure to do it to all <code>mode-line</code> faces that have this
attribute.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>set-face-attribute 'mode-line nil <span style="color: #8959a8;">:box</span> nil<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-face-attribute 'mode-line-inactive nil <span style="color: #8959a8;">:box</span> nil<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span>set-face-attribute 'mode-line-highlight nil <span style="color: #8959a8;">:box</span> nil<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
