Readme.org
*** Missing Glyphs

If I ever use a font with a missing glyph, this will let Emacs check
the /Symbola/ font for the missing data.

[[https://github.com/ChiefMikeK/ttf-symbola][Download Symbola]] if you do not have it.

#+begin_src emacs-lisp
  (set-fontset-font "fontset-default" nil
                    (font-spec :size 20 :name "Symbola"))
#+end_src

*** Cursor width

Make the cursor the full width of the character at point.

#+begin_src emacs-lisp
  (setq x-stretch-cursor t)
#+end_src

** Themes

This function ensures that all enabled themes are shut down -- not
just the most current one.

#+begin_src emacs-lisp
  (defun bnb/disable-all-themes ()
    "Disable all enabled themes."
    (interactive)
    (mapc #'disable-theme custom-enabled-themes))
#+end_src

On creating themes:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Creating-Custom-Themes.html#Creating-Custom-Themes

*** Extra Themes

I like to have a few options for themes easily available. This set
respresents my favorite go-to combinations.

#+begin_src emacs-lisp
  (use-package minimal-theme :ensure t :defer t)
  (use-package gruvbox-theme :ensure t :defer t)
  (use-package material-theme :ensure t :defer t)
  (use-package tango-plus-theme :ensure t :defer t)
  (use-package color-theme-sanityinc-tomorrow :ensure t :defer t)
  ;; dichromacy
  ;; adwaita
#+end_src

** Sky Color Clock

[[https://github.com/zk-phi/sky-color-clock][This is a nice addition]] to any modeline. In a little block, it
shows the date, time, moon phase

#+begin_src emacs-lisp
  (use-package sky-color-clock
    :ensure
    (sky-color-clock :host github :repo "zk-phi/sky-color-clock")
    :commands (sky-color-clock)
    :custom
    (sky-color-clock-enable-emoji-icon t)
    :config
    (sky-color-clock-initialize 40)
    (sky-color-clock-initialize-openweathermap-client
     bnb/openweathermap-api-key
     bnb/openweathermap-city-id))
#+end_src

The variables containging my city and API key are stored in [[*Local customizations (user-login-name)][local
customizations]].

** Doom Modeline

Keeping with the goal of a clean and tidy Emacs, [[https://seagle0128.github.io/doom-modeline/][Doom modeline]]
provides that fancy, fast, and minimal design.

I only customize the height to hug the font and keep everythig small.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init
    (doom-modeline-mode t)
    :custom
    (doom-modeline-height 0))
#+end_src

** Asterism (⁂) Mode                                                  :PENDING:

Let's try ⁂-mode for an interesting mini-buffer line. It writes
information into the minibuffer. Here I have it set to show the output
of [[*Sky Color Clock][sky color clock]].

#+begin_src emacs-lisp
     (use-package asterism-mode
       :after sky-color-clock
       :ensure
       (asterism-mode :host gitlab :repo "lunar.studio/asterism-mode")
       :init
       (defun bnb/smaller-sky-color ()
         (let* ((scc (sky-color-clock))
                (len (length scc)))
           (add-face-text-property 0 len '(:height 90) t scc)
                                             ;(add-face-text-property 0 len '(:justification right) t scc)
           scc))
       :config
       (setq ⁂-format '((:eval (bnb/smaller-sky-color)))))
#+end_src

