index.html

<div id="outline-container-org9adfbc6" class="outline-4">
<h4 id="org9adfbc6"><span class="section-number-4">6.3.6.</span> Missing Glyphs</h4>
<div class="outline-text-4" id="text-6-3-6">
<p>
If I ever use a font with a missing glyph, this will let Emacs
check the <i>Symbola</i> font for the missing data.
</p>

<p>
<a href="http://users.teilar.gr/~g1951d/">Download Symbola</a> if you do not have it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span>set-fontset-font <span style="color: #3e999f;">"fontset-default"</span> nil
                  <span style="color: #3e999f;">(</span>font-spec <span style="color: #8959a8;">:size</span> 20 <span style="color: #8959a8;">:name</span> <span style="color: #3e999f;">"Symbola"</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dd3f61" class="outline-4">
<h4 id="org1dd3f61"><span class="section-number-4">6.3.7.</span> Cursor width</h4>
<div class="outline-text-4" id="text-6-3-7">
<p>
Make the cursor the full width of the character at point.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">setq</span> x-stretch-cursor t<span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5478a0f" class="outline-3">
<h3 id="org5478a0f"><span class="section-number-3">6.4.</span> Themes</h3>
<div class="outline-text-3" id="text-6-4">
<p>
This function ensures that all enabled themes are shut down &#x2013; not
just the most current one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/disable-all-themes</span> <span style="color: #3e999f;">()</span>
  <span style="color: #8959a8;">"Disable all enabled themes."</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">interactive</span><span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>mapc #'disable-theme custom-enabled-themes<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
On creating themes:
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Creating-Custom-Themes.html#Creating-Custom-Themes">https://www.gnu.org/software/emacs/manual/html_node/emacs/Creating-Custom-Themes.html#Creating-Custom-Themes</a>
</p>
</div>

<div id="outline-container-orgff5492f" class="outline-4">
<h4 id="orgff5492f"><span class="section-number-4">6.4.1.</span> Extra Themes</h4>
<div class="outline-text-4" id="text-6-4-1">
<p>
I like to have a few options for themes easily available. This set
respresents my favorite go-to combinations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">minimal-theme</span> <span style="color: #8959a8;">:ensure</span> t <span style="color: #8959a8;">:defer</span> t<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">gruvbox-theme</span> <span style="color: #8959a8;">:ensure</span> t <span style="color: #8959a8;">:defer</span> t<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">material-theme</span> <span style="color: #8959a8;">:ensure</span> t <span style="color: #8959a8;">:defer</span> t<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">tango-plus-theme</span> <span style="color: #8959a8;">:ensure</span> t <span style="color: #8959a8;">:defer</span> t<span style="color: #4d4d4c;">)</span>
<span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">color-theme-sanityinc-tomorrow</span> <span style="color: #8959a8;">:ensure</span> t <span style="color: #8959a8;">:defer</span> t<span style="color: #4d4d4c;">)</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">dichromacy</span>
<span style="color: #8e908c; font-style: italic;">;; </span><span style="color: #8e908c; font-style: italic;">adwaita</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4accf49" class="outline-3">
<h3 id="org4accf49"><span class="section-number-3">6.5.</span> Sky Color Clock</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<a href="https://github.com/zk-phi/sky-color-clock">This is a nice addition</a> to any modeline. In a little block, it
shows the date, time, moon phase
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">sky-color-clock</span>
  <span style="color: #8959a8;">:ensure</span>
  <span style="color: #3e999f;">(</span>sky-color-clock <span style="color: #8959a8;">:host</span> github <span style="color: #8959a8;">:repo</span> <span style="color: #3e999f;">"zk-phi/sky-color-clock"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:commands</span> <span style="color: #3e999f;">(</span>sky-color-clock<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>sky-color-clock-enable-emoji-icon t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span>sky-color-clock-initialize 40<span style="color: #3e999f;">)</span>
  <span style="color: #3e999f;">(</span>sky-color-clock-initialize-openweathermap-client
   bnb/openweathermap-api-key
   bnb/openweathermap-city-id<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>

<p>
The variables containging my city and API key are stored in <a href="#orgc4cf1a5">local
customizations</a>.
</p>
</div>
</div>

<div id="outline-container-orgf4d53af" class="outline-3">
<h3 id="orgf4d53af"><span class="section-number-3">6.6.</span> Doom Modeline</h3>
<div class="outline-text-3" id="text-6-6">
<p>
Keeping with the goal of a clean and tidy Emacs, <a href="https://seagle0128.github.io/doom-modeline/">Doom modeline</a>
provides that fancy, fast, and minimal design.
</p>

<p>
I only customize the height to hug the font and keep everythig
small.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">doom-modeline</span>
  <span style="color: #8959a8;">:ensure</span> t
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span>doom-modeline-mode t<span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:custom</span>
  <span style="color: #3e999f;">(</span>doom-modeline-height 0<span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org05b537b" class="outline-3">
<h3 id="org05b537b"><span class="section-number-3">6.7.</span> Asterism (⁂) Mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PENDING">PENDING</span></span></h3>
<div class="outline-text-3" id="text-6-7">
<p>
Let's try ⁂-mode for an interesting mini-buffer line. It writes
information into the minibuffer. Here I have it set to show the
output of <a href="#org4accf49">sky color clock</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d4d4c;">(</span><span style="color: #718c00;">use-package</span> <span style="color: #4271ae;">asterism-mode</span>
  <span style="color: #8959a8;">:after</span> sky-color-clock
  <span style="color: #8959a8;">:ensure</span>
  <span style="color: #3e999f;">(</span>asterism-mode <span style="color: #8959a8;">:host</span> gitlab <span style="color: #8959a8;">:repo</span> <span style="color: #3e999f;">"lunar.studio/asterism-mode"</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:init</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">defun</span> <span style="color: #f5871f;">bnb/smaller-sky-color</span> <span style="color: #eab700;">()</span>
    <span style="color: #eab700;">(</span><span style="color: #718c00;">let*</span> <span style="color: #718c00;">(</span><span style="color: #4271ae;">(</span>scc <span style="color: #4d4d4c;">(</span>sky-color-clock<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span>
           <span style="color: #4271ae;">(</span>len <span style="color: #4d4d4c;">(</span>length scc<span style="color: #4d4d4c;">)</span><span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span>
      <span style="color: #718c00;">(</span>add-face-text-property 0 len '<span style="color: #4271ae;">(</span><span style="color: #8959a8;">:height</span> 90<span style="color: #4271ae;">)</span> t scc<span style="color: #718c00;">)</span>
                                        <span style="color: #8e908c; font-style: italic;">;</span><span style="color: #8e908c; font-style: italic;">(add-face-text-property 0 len '(:justification right) t scc)</span>
      scc<span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span>
  <span style="color: #8959a8;">:config</span>
  <span style="color: #3e999f;">(</span><span style="color: #718c00;">setq</span> &#8258;-format '<span style="color: #eab700;">(</span><span style="color: #718c00;">(</span><span style="color: #8959a8;">:eval</span> <span style="color: #4271ae;">(</span>bnb/smaller-sky-color<span style="color: #4271ae;">)</span><span style="color: #718c00;">)</span><span style="color: #eab700;">)</span><span style="color: #3e999f;">)</span><span style="color: #4d4d4c;">)</span>
</pre>
</div>
</div>
</div>
